{"yapocks": "plural of yapock", "yech": "(chiefly US) An exclamation of disgust.Yech! This jelly donut is the worst on the planet! (plural yechs)(chiefly US) An exclamation of disgust.", "yawper": " (plural yawpers)A person who yawps; one who cries vigorously.A loud complainer.", "yearday": " (plural yeardays)A day or time occurring in a yearly cycle; an annual day, season, or event.1887, Michael Baxter, Forty coming wonders:The Second Advent of Christ to remove to heaven his waiting people takes place at the end of the yearday sixth vial in accordance with his personal announcement, [...]1998, in the Australian Journal of Botany, volume 46:[...] the amended yearday which was the middle day in flowering range. the yearday which is equivalent to commencement of flowering. the amended yearday (based on flowering yearday) which is the equivalent to the commencement of [...](mathematics) A day of the year.1985, Mathematics magazine volume 58:To avoid the idiosyncracies[sic] of leap years, we propose, as a first approximation to the actual yearday, a standardized yearday s that is a function of ( m, d) only, s = S(m) +dl (6) where 5 is a function of m only.2000, Agricultural and forest meteorology;, volumes 104-105:... T1max the maximum (cloud-free) daily total transmittance at a location with a given elevation and near-surface water-vapor pressure on a given yearday, [...]2002, Journal of physical oceanography, volume 32:Its power supply failed at yearday 227 (0300), [...](dated) An annual remembrance day, the anniversary of a death; a day on which prayers are said for the dead.1907, William Page, The Victoria history of the county of Suffolk, volume 1, page 660:His executors were to keep his yearday for twenty years at the cost of 20s. per year, and finally after his wife\\'s death the bailiffs and commonalty of Southwold were to find a priest for sixteen years next following to sing for his soul []1998, Plutarch (in translation), Lives of the Noble Grecians and Romans, page 310:For they were the very days on the which the women celebrated the feast and yearday of Adonis\\' death: and there were also in divers parts of the city, images of dead men carried to burial, and women following them, mourning and lamenting.2009, Georgette Heyer, My Lord John: A tale of intrigue, honor and the rise of a king, page 56:The younger children remained at Bytham for a year, and saw their brothers again only at Leicester, on the yearday of Mother\\'s death.", "yuch": "Alternative spelling of yech1998, Dean Koontz, Mr. Murder\\'Oh, yuch,\\' Emily said, making a face at Charlotte. \\'You got Bob in your pocket? I hate Bob.\\'Bob was a bug, a slow-moving black beetle as large as the last joint of Daddy\\'s thumb, with faint blue markings on his carapace.", "yadim": "plural of yad", "yuke": " (plural yukes)Alternative form of yeuk (third-person singular simple present yukes, present participle yuking, simple past and past participle yuked)Alternative form of yeuk", "yipe": "!Used to express surprise, fear, or dismay.", "yasmaks": "plural of yasmak", "youth": " (countable and uncountable, plural youths)(uncountable) The quality or state of being young.Her youth and beauty attracted him to her.1915, Emerson Hough, The Purchase Price, chapterI:Serene, smiling, enigmatic, she faced him with no fear whatever showing in her dark eyes. The clear light of the bright autumn morning had no terrors for youth and health like hers.(uncountable) The part of life following childhood; the period of existence preceding maturity or age; the whole early part of life, from childhood, or, sometimes, from infancy, to adulthood.Make the most of your youth, it will not last forever.I made many mistakes in my youth, but learned from them all.2013 January 1,  Brian Hayes,  Father of Fractals, in  American Scientist, volume 101, number 1, page 62:Toward the end of the war, Benoit was sent off on his own with forged papers; he wound up working as a horse groom at a chalet in the Loire valley. Mandelbrot describes this harrowing youth with great sangfroid.(countable) A young person.There was a group of youths hanging around the parking lot, reading fashion magazines and listening to music.(countable) A young man.1919, W. Somerset Maugham, The Moon and Sixpence, chapter 52[] and then a youth appearedno one quite knew where from or to whom he belongedbut he settled down with them in a happy-go-lucky way, and they all lived together.(uncountable) (used in plural form) Young persons, collectively.", "yarr": " (third-person singular simple present yarrs, present participle yarring, simple past and past participle yarred)(intransitive, archaic) To growl or snarl like a dog.1921, Chamber\\'s JournalShe yapped and yarred and ran in foolish circles, as though quarrelling with her own tail.Franois Rabelais (in translation), Gargantua and PantagruelAnd when he saw that all the dogs were flocking about her, yarring at the retardment of their access to her, and every way keeping such a coil with her as they are wont to do about a proud or salt bitch, he forthwith departed [] (uncountable)(Britain, dialect) The plant Spergula arvensis, the corn spurry.", "year": " (plural years)A solar year, the time it takes the Earth to complete one revolution of the Sun (between 365.24 and 365.26 days depending on the point of reference).we moved to this town a year ago;&#160; I quit smoking exactly one year ago(by extension) The time it takes for any astronomical object (such as a planet, dwarf planet, small Solar System body, or comet) in direct orbit around a star (such as the Sun) to make one revolution around the star.Mars goes around the sun once in a Martian year, or 1.88 Earth years.A period between set dates that mark a year, from January 1 to December 31 by the Gregorian calendar, from Tishiri 1 to Elul 29 by the Jewish calendar, and from Muharram 1 to Dhu al-Hijjah 29 or 30 by the Islamic calendar.2013 July 20,  The attack of the MOOCs, in  The Economist, volume 408, number 8845:Dotcom mania was slow in coming to higher education, but now it has the venerable industry firmly in its grip. Since the launch early last year of Udacity and Coursera, two Silicon Valley start-ups offering free education through MOOCs, massive open online courses, the ivory towers of academia have been shaken to their foundations.A normal year has 365 full days, but there are 366 days in a leap year.I was born in the year 1950.This Chinese year is the year of the Rooster.A scheduled part of a calendar year spent in a specific activity.During this school year I have to get up at 6:30 to catch the bus.(sciences) A Julian year, exactly 365.25 days, represented by \"a\".A level or grade in school or college.Every second-year student must select an area of specialization.The exams in year 12 at high school are the most difficult.The proportion of a creature\\'s lifespan equivalent to one year of an average human lifespan (see also dog year).Geneticists have created baker\\'s yeast that can live to 800 in yeast years.eye dialect spelling of here, hear, &amp;c.", "yeggman": " (plural yeggmen)(cant, slang) a person who breaks open safes, a burglar; a yegg.1915, W. M. McCarty, practically every thug, yeggman and ex-convict in the land", "yardlands": "plural of yardland", "yawniness": " (uncountable)The quality of being yawny.", "yarns": "plural of yarnThird-person singular simple present indicative form of yarn", "yachtings": "plural of yachting", "yaksha": " (plural yakshas)(Buddhism, Hinduism) A kind of supernatural being, usually depicted as a benevolent tutelary deity, that attends on Kuvera the god of wealth.(Southeast Asian  mythology) A kind of evil supernatural being, often depicted as having supernatural power, great strength, and frightening appearance; an asura; a demon.", "yacca": " (plural yaccas)Either of two large evergreens of the West Indies, Podocarpus coriaceus and Podocarpus purdicanus. (plural yaccas)Any of the various Australian perennial flowering plants of the genus Xanthorrhoea", "yigh": "(Britain, dialect, Lancashire) yes, used when contradicting.I can\\'t do it.Yigh, thou can.Taken from page 206 in Shorrocks (1999).", "youthen": " (third-person singular simple present youthens, present participle youthening, simple past and past participle youthened)(transitive, nonstandard) To make younger.1897, George Egerton, Symphonies (page 97)It youthened her, melted the stark, hungry grip about her mouth.1966, Congress for Cultural Freedom, Encounter, Volume 26 (page 84)Mr. Wilson can hardly be unaware that once a writer chooses to youthen or resurrect a word, it lives again...(transitive, nonstandard) To become younger.2008, Patrice Rancour, Tales from the Pager Chronicles (page 7)He nods, time traveling to a point when there were no central lines, no low blood counts, no immunosuppressive drugs. His face youthens momentarily as he bridges back to a point on a timeline that has none of this devastation on it.", "yajna": " (countable and uncountable, plural yajnas)(Hinduism) A ritual of sacrifice to the Devas.1997, Kiran Nagarkar, Cuckold, HarperCollins 2013, p. 501:The visit to Pushkar is, however, a little more than the obligatory obeisance done at the site where Brahma carelessly dropped a lotus blossom as he was wondering where to perform a yagnya.", "yucks": "plural of yuckThird-person singular simple present indicative form of yuck", "yokemate": " (plural yokemates)(archaic) A companion.", "yakamik": " (plural yakamiks)A bird allied to the cranes; the agami or trumpeter.", "yardwork": " (uncountable)(Canada, US) Work done in maintaining a lawn, and related landscaping activities2007 December 8,  Sarah Wheaton,  Huckabee Immigration Plan Emphasizes Security, in  New York Times[1]:Mr. Romney endured tough questioning from reporters in Des Moines yesterday about revelations last week that a yardwork company he employed was found for a second time to be using illegal immigrants.", "yali": " (plural yalis)A type of house, particularly found on the Bosporus.", "yahrzeit": " (plural yahrzeits)(Judaism) The anniversary of a person\\'s death, often of a parent\\'s.1892 February,  The Jews in New York--II., in  The Century Magazine[1], volume 43, number 4, page 516:\"Yahrzeit\" (year\\'s time) is the anniversary of the parent\\'s death.1930 August 1,  Leon Spitz,  Tisha b\\'Ab-The Yahrzeit of Every Jew, in  The Canadian Jewish Chronicle[2], page 1:Sad to say, the Yahrzeit of every-Jew is fading away from the memory of the average Jew in America.2002 September 2,  Leon Wieseltier,  A Year Later, in  The New Republic[3]:The yahrzeit is here, and the least lachrymose country on earth is devising its rituals of commemoration.2016 August 10,  Irwin Cohen,  Hank Greenbergs 30th Yahrzeit, in  The Jewish Press[4]:Lets remember Hank Greenbergs yahrzeit, the 30th of Av, which falls this year on Sept. 3.", "youngster": " (plural youngsters)A young person.1963,  Margery Allingham,  chapter 19, in  The China Governess[1]:As soon as Julia returned with a constable, Timothy, who was on the point of exhaustion, prepared to give over to him gratefully. The newcomer turned out to be a powerful youngster, fully trained and eager to help, and he stripped off his tunic at once.2011, Phil McNulty, Euro 2012: Montenegro 2-2 England [2]In a single moment Montenegro and their supporters were given fresh impetus and encouragement. Beciraj tested Hart with a low shot before teenager Phil Jones, on his England debut, suffered an anxious moment when Stevan Jovetic went down under his challenge, leaving the youngster clearly relieved to see referee Stark wave away Montenegro\\'s appeals.", "yarramen": "plural of yarraman", "yttriferous": " (comparative more yttriferous, superlative most yttriferous)Containing or producing yttrium.", "yd": "Yard, a unit of length.", "yarak": " (uncountable)(falconry) A super-alert state where the bird is hungry, but not weak, and ready to hunt.", "yug": " (plural yugs)Archaic form of yuga (any of the religious ages in Hinduism).", "yins": "plural of yinAlternative spelling of yinz", "yelper": " (plural yelpers)One who yelps.2009 July 21,  Nate Chinen,  Vocals That Deliver a Jolt, as Ooh Morphs Into Eh, in  New York Times[1]:Mr. Longstreth, who can be a bit of a yelper, sang sweetly, perhaps in search of contrast.(Britain, dialect) The avocet (so-called from its sharp, shrill cry).(US, dialect) A bird, the tattler.", "yanqui": " (plural yanquis)(sometimes derogatory) A citizen of the United States of America, as opposed to a Latin American.", "yark": " (third-person singular simple present yarks, present participle yarking, simple past and past participle yarked)(transitive, Britain  dialectal) To make ready; prepare.1881, Walter Gregor, Notes on the Folk-Lore of the North-East of Scotland:[...] Yet thou hast given us leather to yark, and leather to bark, [...](transitive, obsolete) To dispose; be set in order for; be destined or intended for.(transitive, obsolete) To set open; open. (third-person singular simple present yarks, present participle yarking, simple past and past participle yarked)To draw (stitches etc.) tight.To hit, strike, especially with a cane or whip.To crack (a whip).1603,  John Florio, transl.; Michel de Montaigne,  Essayes, printed at London: Edward Blount, OCLC 946730821:, Folio Society, 2006, vol.1, p.96:he would throw a Dagger, and make a whip to yarke and lash [tr. faisoit craqueter], as cunningly as any Carter in France.", "yowlers": "plural of yowler", "yeller": " (plural yellers)Someone who yells. (comparative more yeller, superlative most yeller)Eye dialect spelling of yellow.1913,  Joseph C. Lincoln,  chapter 10, in  Mr. Pratt\\'s Patients:Men that I knew around Wapatomac didn\\'t wear high, shiny plug hats, nor yeller spring overcoats, nor carry canes with ivory heads as big as a catboat\\'s anchor, as you might say.", "yashmak": " (plural yashmaks)A veil worn by Muslim women to cover parts of the face when they are in public.1982, TC Boyle, Water Music, Penguin 2006, p. 46:Mungo cannot make out her face, which is concealed behind a yashmak  the double horsehair veil worn by Muslim women in public  but he is immediately struck by her feet and hands.", "yellowman": " (plural yellowmen)Alternative form of yellow man1878 February 11, This Newfoundland of Ours: A lecture delivered by the Rev. M. Harvey, in Across Newfoundland with the Governor, page 104:In the United States we see going on a commingling of types of mankind, of all nationalities, whitemen, blackmen, yellowmen, redmen, producing an amalgam []1891, Francis William Bain, Antichrist: A Short Examination of the Spirit of the Age, page 95:That which the complaints of the ousted white labourers had been unable to effect  the expulsion of the yellowmen who undersold them in the labour-market []1909, Robert Maclauchlan Macdonald, Chillagoe Charlie, page 181:[If they] hope to prospect peaceably and thus avoid trouble with the yellowmen they will be disappointed; I know the pigtails too well, and I also know they have found something good or they wouldn\\'t have risked a fight with such a party as we were.", "yaud": " (plural yauds)(Scotland, Northern England) A workhorse; an old or worn-out mare.1814, Walter Scott, Waverley, Or \\'tis Sixty Years Since, 1821, Volume 2, page 98,\" [] Nay by my faith, if you be so heavy, I will content me with the best of you, and that\\'s the haunch and the nombles, and e\\'en heave up the rest on the old oak-tree yonder, and come for it with one of the yauds.\"a. 1835, James Hogg, Seeking the Houdy, 2006, The Collected Works of James Hogg: Contributions to Annuals and Gift-books, page 60,\" [] Get on, my fine yaud, get on! There is nothing uncanny there.\"Robin coaxed thus, as well to keep up his own spirits, as to encourage his mare; for the truth is, that his hair began to stand on end with affright.1846, Moses Aaron Richardson, The Local Historian\\'s Table Book, of Remarkable Occurrences, page 106,[] he threw it overboard, subjecting it to a spell, that it never should be removed save by the co-operation of \"Two twin yauds, two twin oxen, two twin lads, and a chain forged by a smith of kind.\"", "yearnings": "plural of yearning", "yachting": "present participle of yacht (countable and uncountable, plural yachtings)(often attributive) A physical activity involving boats, be it racing sailing boats, cruising to distant shores, or day-sailing along a coast.", "yores": "Eye dialect spelling of yours.1907,  Emerson Hough,  The Way of a Man[1]:\"Whut business is this here of yores?\"1921,  William Patterson White,  The Heart of the Range[2]:You leave that gun alone, and lemme tell you, stranger, while we\\'re together, that I want to buy that pup of yores.1930,  Ward M. Stevens,  Kid Wolf of Texas[3]:Scotty, yores is the hombre on the west, ridin\\' the pinto.", "yaupers": "plural of yauper", "yakitori": " (countable and uncountable, plural yakitori or yakitoris)A Japanese shish kebab-type dish made with small pieces of chicken, fish, vegetables or beef which have been marinated in soy sauce and then cooked on skewers.2006, Thomas Pynchon, Against the Day, Vintage 2007, p. 851:We should have the bazaars full of yakitori pitches and geishas in bamboo cages.", "yttrocolumbite": " (uncountable)yttrotantalite", "yetling": " (countable and uncountable, plural yetlings)(Britain, chiefly Scotland, obsolete) Cast iron.1794,  John Sinclair,  The Statistical Account of Scotland: Drawn Up from the Communications of the Ministers of the Different Parishes, page 178:Scots ploughs, very neatly made, and covered with yetling, are the only kind used in this parish.1815,  Henry Home (Lord Kames),  The Gentleman Farmer: Being an Attempt to Improve Agriculture by Subjecting it to the Test of Rational Principles, page 54:Rollers are of different kinds, stone, yetling, wood. Each of these has its advantages.1884,  The History of Old Dundee, Narrated Out of the Town Council Register, page 212-213:Having afterwards resolved upon renewing the armament, they instructed the Dean of Guild \" to sell the auld pieces callit heidsticks being in the steeple to the gritest avail, and wair and bestow the money gotten therefor upon sufficient yetling ordinance to the common use of the burgh.\"1896,  John Geddie,  The Water of Leith from Source to Sea, page 32:A caller burn runs wimpling clear, Out o\\'er its rocky bed&#160;; Where sits the rural yetling chair, For youth and hoary head, To rest themselves beside the stream And hear its murmuring.(Britain, chiefly Scotland, by extension) A small cauldron, or rounded pot, typically, but not always, made of cast iron; yet.1842,  Local Collections; Or, Records of Remarkable Events, Connected with the Borough of Gateshead, page 50:Still, it occurs to me that Yetlington is more probably indebted to its name from being the spot where \" yetlings\" were made. To this day the metal pot used by the muggers is known by that appellation in its immediate neighhourhood, and bears a striking resemblance to a sacred utensil used during the sacrifices of the Romans.1859,  Jane Anne Winscom,  Onward: or, The mountain Clamberers&#160;: a Tale of Progress, page 43:Mother had lifted the yetling off the fire, and left it there,\" pointing to the middle of the room&#160;; \" and she comes running along and tumbles in.1880,  John Collingwood Bruce,  A Descriptive Catalogue of Antiquities, Chiefly British, at Alnwick Castle:A bronze yetling, or tripod caldron, with an angular handle at each side.1987,  Peter C. D. Brears,  Traditional Food in Yorkshire, page 79:Baking in the turf-burning areas of the North Yorkshire Moors was also undertaken in a yetling, a cylindrical cast-iron vessel perhaps a foot in diameter and five inches in height which hung over the fire from a reckon-hook.(Britain, chiefly Scotland) A small cast iron ball.1896,  The County Histories of Scotland - Volume 4, page 231:A more recent conjecture traces a connection between it and the game still, or not long ago, played at New Year with yetlings or balls of cast iron on the sands near the Skilleys of Wemyss, in which, as in the North German Klotschiessen, the player who drives the ball to the goal in the fewest number of strokes wins.", "yaps": "plural of yapThird-person singular simple present indicative form of yap", "yede": "(obsolete) simple past tense of go, now replaced by went.(obsolete or literary humour) To go (used as a pseudo-archaism by 16th-century poets and their imitators).1590, Edmund Spenser, The Faerie Queene, II.iii:The whiles on foot was forced for to yeed, / With that blacke Palmer, his most trusty guide []", "yowled": "simple past tense and past participle of yowl", "yar": " (third-person singular simple present yars, present participle yarring, simple past and past participle yarred)(intransitive) To snarl; to gnar.(intransitive, chiefly Scotland) To growl, especially like a dog; quarrel; to be captious or troublesome. (comparative more yar, superlative most yar)(Britain  dialectal) Sour; brackish. (comparative yarer, superlative yarest)(nautical, of a vessel, especially sailboat) Quick and agile; easy to hand, reef and steer.1939 My, she was yar...It means, uh...easy to handle, quick to the helm, fast, right. Everything a boat should be, until she develops dry rot. - The Philadelphia Story written by Philip Barry1958, Bulletin of the John Rylands Library...to make a ship best weighed, or yarest in her going.1993 Arr, here be a fine vessel: the yarest river-going boat there be. - Captain McAllister The Simpsons ep. 1F06", "yenned": "simple past tense and past participle of yen", "yttrocerite": " (uncountable)(mineralogy) A violet-blue mineral, a hydrous fluoride of cerium, yttrium, and calcium.", "yay": "Misspelling of yea.(colloquial) An expression of happiness.Yay! I have finally finished my work! (not comparable)Misspelling of yea. (plural yays)The letter for the y sound in Pitman shorthand. (uncountable)(US, slang) Cocaine (powder or crack).2006, \"They Shootin\\'\", Vibe, December 2006:In Billy Corben\\'s engrossing new documentary, Cocaine Cowboys (Magnolia Pictures), self-described \"assassin\" Jorge \"Rivi\" Ayala (among others) give up the goods on Miami\\'s explosive early \\'80s yay trade.2009, Tyrone Pierson, Murder in the Moonlight, AuthorHouse (2009), ISBN, page 339:I\\'m in charge of a whole city block, and I always wear gloves when I touch the yay, cuz traces of cocaine show up on my u. a., when I touch it with my bare hands.2012, Azealia Banks, \"Liquorice\", 1991:I don\\'t do yay, but if you want to, fine", "yielders": "plural of yielder", "yuletides": "plural of yuletide", "youngly": " (comparative more youngly, superlative most youngly)(archaic) Like a young person or thing; young; youthful.(Can we find and add a quotation of Shakespeare to this entry?)1849, The Living Age - Volume 23:As I mine eye about-e cast, His larg-e beard-e then at last I saw; and thought anon therefore How that his father him before, Which stood upon the sam-e place, Was beardless, with a youngly face.1916, Good Housekeeping - Volumes 62-63:Preacher how dance bunny-trot. When Hon. Sadson got through, he feel quite puffed but very enjoyable and say that, if youngly men would dance with preachers, tango would seem quite sinless.2009, Jason DeGray, Absolutely True Retellings: the Saga of Shamus:By the time he was a youngly adult dragon, he had secured a position as the most ruthless and feared bounty hunter in the Realm. (comparative more youngly, superlative most youngly)(archaic) While young; as a youth.And that fresh blood which youngly thou bestow\\'st  Shakespeare.2013, Ned Rorem, The Later Diaries of Ned Rorem: 19611972:In six sexless weeks the least \"good\" of the twenty or so French books I\\'ve read is the diary of the youngly-dead Jean-Rene Huguenin (all the rage), because it lacks gossip and carnality, the very stuff of journals.(rare) In a young or youthful manner; youthfully1911, Sarah Pratt McLean Greene, The Long Green Road:The youngly born brother made no explanation of his sense of offense other than to go over and give Artie a stolid and resounding blow.2001, David L. Minter, Faulkner\\'s Questioning Narratives:Refusing to go back to writing things he now thought \"youngly glamorous,\" like Soldiers\\' Pay, or \"trashily smart,\" like Mosquitoes, he decided to go on even if it meant relinquishing his dream of success.2002, Anthony Munday, Henry Chettle, Vittorio Gabrielli, Sir Thomas More: By Anthony Munday and Others:The youngest should speak first, so if I chance In this case to speak youngly, pardon me.2010, Katherine Ramsland, Anne Rice Reader:[...] he was also a divine personification, an actual figure, for example sculpted by Skopas (395350 B.C.), which has been described as a youngly ripened boy\\'s body.2014, Margaret Laurence, The Stone Angel:Here we sit, the little minister straight from the book, bashful and youngly anxious, and I the Egyptian, not dancing now with rowanberries in her hair, but sadly altered.", "yellowthroat": " (plural yellowthroats)A mostly yellow-colored group of New World warblers in the genus Geothlypis", "yesternight": " (not comparable)(archaic) Last night.c. 1244,  S. Utchka,  Tales of a German traveler:Makke: Yesternight I woke up.c. 1598,  William Shakespeare,  Much Ado About Nothing:Claudio: What man was he talk\\'d with you yesternight / Out at your window betwixt twelve and one? (Act IV, Scene 1)1611, King James Version of the Bible, Genesis 31:29,[1]It is in the power of my hand to do you hurt: but the God of your father spake unto me yesternight, saying, Take thou heed that thou speak not to Jacob either good or bad.1820, Walter Scott, Ivanhoe, Chapter 6,[2][] when the Templar crossed the hall yesternight, he spoke to his Mussulman slaves in the Saracen language, which I well understand, and charged them this morning to watch the journey of the Jew []1847, Emily Bront, Wuthering Heights, Chapter 29,[3][] she has disturbed me, night and day, through eighteen yearsincessantlyremorselesslytill yesternight; and yesternight I was tranquil. (plural yesternights)(archaic) A preceding night.", "yeasty": " (comparative yeastier, superlative yeastiest)Having or resembling yeast.Foamy and frothy.1819, Lord Byron, Don Juan, III.58:The Ocean when its yeasty war is waging / Is awful to the vessel near the rock [...].Emotionally bubbling over (as with exuberance)Trivial.1602&#160;: William Shakespeare, Hamlet, act V scene 2Thus has he, and many more of the same breed that Inow the drossy age dotes on, only got the tune of thetime and, out of an habit of encounter, a kind ofyeasty collection, which carries them through andthrough the most profane and winnowed opinions", "yield": " (third-person singular simple present yields, present participle yielding, simple past yielded or (obsolete) yold, past participle yielded or (obsolete) yolden)(obsolete) To pay, give in payment; repay, recompense; reward; requite.Shakespeare:God \\'ild [yield] you!Gareth and Lynette, Tennyson:The good mother holds me still a child! Good mother is bad mother unto me! A worse were better; yet no worse would I. Heaven yield her for it!Shakespeare:Tend me to-night two hours, I ask no more, / And the gods yield you for \\'t.Beaumont and Fletcher:God yield thee, and God thank ye.To furnish; to afford; to render; to give forth.Milton:Vines yield nectar.Bible, Job 24.5:The wilderness yieldeth food for them and for their children.To give way; to allow another to pass first.Yield the right of way to pedestrians.To give as required; to surrender, relinquish or capitulate.They refuse to yield to the enemy.Shakespeare:I\\'ll make him yield the crown.Milton:Shall yield up all their virtue, all their fame.(intransitive) To give way; to succumb to a force.1897, Bram Stoker, Dracula, chapter 21:He turned the handle as he spoke, but the door did not yield. We threw ourselves against it. With a crash it burst open, and we almost fell headlong into the room.To produce as return, as from an investment.Historically, that security yields a high return.(mathematics) To produce as a result.Adding 3 and 4 yields a result of 7.(linguistics) To produce a particular sound as the result of a sound law.Indo-European p- yields Germanic f-.(engineering, materials science, of a material specimen) To pass the material\\'s yield point and undergo plastic deformation.(rare) To admit to be true; to concede; to allow.Milton:I yield it just, said Adam, and submit. (countable and uncountable, plural yields)(obsolete) Payment; tribute.A product; the quantity of something produced.Zucchini plants always seem to produce a high yield of fruit.(law) The current return as a percentage of the price of a stock or bond.2013 July 6,  The rise of smart beta, in  The Economist, volume 408, number 8843, page 68:Investors face a quandary. Cash offers a return of virtually zero in many developed countries; government-bond yields may have risen in recent weeks but they are still unattractive. Equities have suffered two big bear markets since 2000 and are wobbling again. It is hardly surprising that pension funds, insurers and endowments are searching for new sources of return.(finance) Profit earned from an investment; return on investment.", "yogurts": "plural of yogurt", "youngth": " (uncountable)(archaic) youth; the quality of being young1579,  Edmund Spenser,  The Shepheardes Calender, Februarie:Youngth is a bubble blown up with breath", "yeomanries": "plural of yeomanry", "yataghan": " (plural yataghans)A type of sword used in Muslim countries from the mid-16th to late 19th centuries.1855, Sir Richard Burton, Personal Narrative of a Pilgrimage to Al-Madinah &amp; Meccah, Dover 1964, p. 22:The angry-faced official communicated the intelligence to a large group of Anadolian, Caramanian, Bosniac, and Roumelian Turks, sturdy, undersized, broad-shouldered, bare-legged, splay-footed, horny-fisted, dark-browed, honest-looking mountaineers, who were lounging about with long pistols and yataghans stuck in their broad sashes [...].1942, Rebecca West, Black Lamb and Grey Falcon, Canongate 2006, p. 1041:A Montenegrin perceived it and ran immediately to him and drew his yataghan, saying, You are very brave, and must wish that I should cut off your head rather than that you should fall into the hands of the enemy.", "yup": " (plural yups)(informal) A yes; an affirmative answer.1981,  Patrick F. McManus &amp; Jack Samson,  A Fine and Pleasant Misery, ISBN, page 196:One was either a Yup or a Nope, depending upon his answer to that age-old question, \"Gotcher deer yet?\" I, of course, was still a Nope. Although Yups and Nopes looked pretty much alike they were as different as mallards from mongooses.1984, Graduating engineer, Volumes 6-7 (page 147)But you positively must have much, much more than the laconic \"yups\" and \"nups\" of the John Waynes and Gary Coopers...1999,  Caitlyn\\'s Cowboy, ISBN, page 33:She\\'d ask him a question that couldn\\'t be answered by a \"yup\" or a \"nope.2002,  Tom Magliozzi, Ray Magliozzi, &amp; Greg Proops,  In Our Humble Opinion: Car Talk\\'s Click and Clack Rant and Rave, ISBN:It was just Yup or Nope. One thing I did notice, though, was that there was no pattern to the Yups and Nopes.2003, Susie Moloney, The Dwelling (page 278)Petey\\'s end was all yups and nopes. And an okay.2015,  Sarah Price,  Second Chances: An Amish Retelling of Jane Austen\\'s Persuasion, ISBN:His hands moved, gesturing towards the two bidders, enticing them to raise their stakes against each other, as he chanted a litany of numbers followed by going once, going twice only to be followed by a resounding yup as he turned, alternately, towards each of the two men.2017 August 17,  Michael Siebert,  Picking the bones at Smurfit-Stone, in  Missoula Independent:A rotating cast of auctioneers unleashed a torrent of increasingly high bids, speaking at a machine gun\\'s pace while a chorus of increasingly aggressive \"yups\" emerged from the audience.A yuppie.2008,  Jeff Gordinier,  X Saves the World, ISBN:What we have these days is a diverse spectrum of yuppiness: guppies, buppies, indie yups, paleo-yups, luxe yups, schlub yups, dharma yups, tyro yups, crypto-yups.2010,  Dennis Lehane,  Mystic River, ISBN:He idled at a red light, saw two yups in matching cranberry crewnecks and khaki cargo shorts sitting on the pavement outside what used to be Primo\\'s Pizza.(informal) Yes.", "youthens": "Third-person singular simple present indicative form of youthen", "yowes": "plural of yowe", "yearnful": " (comparative more yearnful, superlative most yearnful)Filled with yearning; desirous; mournful; distressing.1570,  Richard Edwards,  Damon and Pithias, in  A select collection of old English plays, Volume 4, page 43:So now lend me thy yearnful tunes to utter my sorrow.1886,  Jerome K. Jerome,  Idle Thoughts of an Idle Fellow[1]:Ah! they were grand days, those deep, full days, when our coming life, like an unseen organ, pealed strange, yearnful music in our ears, and our young blood cried out like a war-horse for the battle.1919,  Albert Payson Terhune,  The Strike, in  O Henry Memorial Award Prize Stories of 1919[2]:I am yearnful to know who was the unhappy person the wicked general threatened.", "yaupon": " (plural yaupons)The yaupon holly, Ilex vomitoria, an evergreen holly shrub with white flowers and red or yellow berries, found in the south-eastern United States.2002, Connie C. Barlow, The Ghosts of Evolution: Nonsensical Fruit, Missing Partners, and Other Ecological AnachronismsYaupon is evergreen like the American holly and the familiar hollies of Christmas decorations, but the leaves of yaupon are small and smooth-edged rather than prickly. Easy to chew and blandly tasty, they would not stand out in a tossed salad.A tea-like drink, \"black drink\", brewed from the leaves of this holly (or, sometimes, Ilex cassine).", "yazoo": " (plural yazoos)(US) A tributary that runs parallel to a river (especially when separated by a natural levee).", "york": " (third-person singular simple present yorks, present participle yorking, simple past and past participle yorked)(cricket) to bowl a yorker at a batsman, especially to get a batsman out in this way. (third-person singular simple present yorks, present participle yorking, simple past and past participle yorked)(slang) To vomit.2013, Breaking Bad (TV series), \"Blood Money\" (episode)BADGER: They\\'re eating blueberry pies... [] Okay, finally, Kirk, he can\\'t take it anymore. He yorks! Now it\\'s just down to Chekov and Spock.", "yobbo": " (plural yobbos or yobboes)(Britain, Australia, New Zealand, pejorative, slang) A yob.1997, TISM, Whatareya? (song)A wanker fights inequalityAnd for peoples rights;A wanker fights class prejudiceA \\'yobbo\\' just fights", "yoghourts": "plural of yoghourt", "yellowberries": "plural of yellowberry", "yawled": "simple past tense and past participle of yawl", "youthlike": " (comparative more youthlike, superlative most youthlike)Characteristic of youth.a youthlike complexionyouthlike vigour", "yok": " (plural yoks)Alternative form of yock (third-person singular simple present yoks, present participle yokking, simple past and past participle yokked)Alternative form of yock (plural yoks)(pejorative) A non-Jew; a Gentile.2006, Howard Jacobson, Kalooki Nights, Vintage 2007, page 162:I\\'d been warned about just such a day, when the yoks would come with their white-boned fists and start knocking us about.", "y": " (lower case, upper case Y, plural y\\'s)The twenty-fifth letter of the English alphabet, called wye and written in the Latin script.Abbreviation of year.2003, Howard Tanner, Sonia Jones, Becoming a Successful Teacher of MathematicsConsider the following questions selected from the tests and estimate the proportion of Y8 pupils you would expect to answer correctly.(Britain, television) Abbreviation of youth., usually followed by an age appropriate for the content so marked.Y7(computing) Abbreviation of yes.(slang, text messaging, Internet) Abbreviation of why.", "yarborough": " (plural yarboroughs)(card games) A hand, in bridge or whist, that has no card with a value greater than nine (and no aces), though in some circles it is no card above a ten.", "yorker": " (plural yorkers)(cricket) a ball bowled so as to bounce at or near the batsman\\'s popping crease", "yulan": " (plural yulans)Magnolia denudata, a species of magnolia with large white blossoms that open before the leaves.", "yautia": " (plural yautias)An edible plant commonly found in the Caribbean: Xanthosoma sagittifolium, new cocoyam.", "yex": " (third-person singular simple present yexes, present participle yexing, simple past and past participle yexed)(archaic) to hiccup(archaic) to belch or burp (plural yexes)(archaic or dialectal) a hiccup", "yieldingly": " (comparative more yieldingly, superlative most yieldingly)In a yielding way.1934, George Orwell, Burmese Days, New York: Harcourt, 1974, Chapter 14, p. 168,[1]A sudden stillness came on them both, a sense of something momentous that must happen. Flory reached across and took her other hand. It came yieldingly, willingly.1974, Angela Carter, The Smile of Winter in Fireworks, London: Virago, 1988, p. 44,[2]The wet sand is as dark and more yieldingly solid than fudge and waking across a panful is a promenade in the Kingdom of Sweets.", "yesterweek": " (not comparable)On the week preceding the current week. (uncountable)Previous week, the last week before the current one.", "yucker": " (plural yuckers)A bird, the American flicker or golden-winged woodpecker.", "yeldring": " (plural yeldrings)Alternative form of yeldrin1866, Alexander Smith, Alfred Hagart\\'s Household (page 20)And the birds! not the gray sparrows you see here, but shilfas and bullfinches and yellow-yeldrings.", "yarovizing": "present participle of yarovize", "yamun": " (plural yamuns)Alternative form of yamen1883, Adele Marion Fielde, A Pronouncing and Defining Dictionary of the Swatow Dialect, Arranged According to Syllables and Tones[The] Hai Ie district yamun has a department whose sole business is the rental of fields alloted to resident troops.", "yachtswomen": "plural form of yachtswoman", "yohimbine": " (countable and uncountable, plural yohimbines)Wikipedia has an article on:yohimbineWikipedia(organic chemistry) A tryptamine alkaloid, the active chemical constituent of the medicinal herb Pausinystalia yohimbe: a stimulant and supposed aphrodisiac.", "yearling": " (plural yearlings)An animal that is between one and two years old; one that is in its second year (but not yet two full years old).a yearling lambA racehorse that is considered to be one year old until a subsequent January 1st.", "youre": "Misspelling of you\\'re.", "yeaned": "simple past tense and past participle of yean", "yodler": " (plural yodlers)Archaic form of yodeler.", "yapper": " (plural yappers)(slang) One\\'s mouth, especially of a gossipy person.Shut your yapper or I\\'ll shut it for you!One who yaps.2004, Theresa Mancus, Who moved my bone?: a guide for multi-dog households (page 25)If you want your pack to be a deterrent against burglars or muggers, forget about small dogs, yappers though they be. Focus on the larger breeds, particularly working stock with strong instinctual drives.2007, Training (volume 44, issues 1-10, page 6)I have to admit I would have a lot more tolerance for cell phone yappers on my one-hour train ride to and from work if they were actually learning  instead of yelling []", "yad": " (plural yads or yadim)(Judaism) A pointer used in the ritual of Torah-reading.The letter  in the Tifinagh alphabet.", "yere": " (possessive)(Ireland) your (plural); of ye, belonging to ye2001 Martin McDonagh The Lieutenant of Inishmore, Scene 8:What I want ye to remember, as the bullets come out through yere foreheads, is []2012 Kerry O\\'Shea Edinburghs Fringe festival thinks The Rubberbandits are English IrishCentral 27 July 2012:The Rubberbandits took to their Twitter (@Rubberbandits) on Tuesday in the wake of the Fringe fests apparent typo saying that, @edfringe As much as we\\'d love to swear allegiance to Lizzie. Could ye change our country of origin from \"England\" to Ireland on yere site? (sic)2012 Christy O\\'Connor \"The first great rivalry of the 21st century\" Irish Independent, 28 July 2012:\"I\\'ve been listening to yere s**** there all day about how great ye are,\" he told them. \"Who the hell do ye think ye are with yere two All-Irelands and one ambush?\" (plural yeres)Obsolete spelling of year", "yawling": "present participle of yawl", "yarm": " (third-person singular simple present yarms, present participle yarming, simple past and past participle yarmed)(Britain  dialectal) To cry out; make a loud, unpleasant noise; shriek; yell.(Britain  dialectal) To scold; grumble. (plural yarms)(Britain  dialectal) An outcry; noise.", "yachtsmanship": " (usually uncountable, plural yachtsmanships)The ability or art of being adept at sailing a yacht", "yuckel": " (plural yuckels)(rare) Alternative form of yokel", "yeuked": "simple past tense and past participle of yeuk", "yeuking": "present participle of yeuk", "yeasayer": " (plural yeasayers)One whose attitude is positive, optimistic, confidently affirmative.(pejorative) One who habitually agrees uncritically.", "yampa": " (plural yampas)Alternative form of yampah", "yawners": "plural of yawner", "yond": " (not comparable)further; more distantyonderc 1608, William Shakespeare, s:Coriolanus, Act 5, Scene IV.See you yond coign o\\' the Capitol, yond corner-stone?William Shakespeare, Hamlet, Lines 46-48:Last night of all, / When yond same star thats westward from the pole / Had made his course t\\' illume that part of heaven. (not comparable)yonder(obsolete) Furious; mad; angry; fierce.SpenserThen wexeth wood and yond.", "yellowback": " (plural yellowbacks)A cheap sensational novel.", "yuletide": " (countable and uncountable, plural yuletides)Alternative letter-case form of Yuletide (Christmas or the Christmas season).The flower Camellia sasanqua, native to Japan and nearby islands.", "yerba": " (usually uncountable, plural yerbas)Ilex paraguariensis, a species of holly native to southern South America; or the dried leaves and twigs of this plant, used to make the caffeine-rich beverage mate.1839,  Charles Darwin,  The Voyage of the Beagle[1]:The storehouses at Talcahuano had been burst open, and great bags of cotton, yerba, and other valuable merchandise were scattered on the shore.1854,  P. L. Simmonds,  The Commercial Products of the Vegetable Kingdom[2]:This was the place at which the leaves and small sprigs of the yerba tree, when brought from the woods, were first scorched--fire being set to the logs of wood within it.1910,  Various,  Argentina From A British Point Of View[3]:His preparations for breakfast are simple, and he is ready to start out after half an hour spent in imbibing a few mates full of yerba infusion.", "yeanlings": "plural of yeanling", "youthhead": " (uncountable)(obsolete) Youth; youthhood.", "yis": " (not comparable)Eye dialect spelling of yes.", "yarning": "present participle of yarn", "yob": " (plural yobs)(obsolete, costermongers) A boy.1897,  A. R. Marshall,  Pomes[sic] from the Pink \\'Un, page 76:And you bet that each gal, not to mention each yob, / Didn\\'t care how much ooftish it cost \\'em per nob.2010,  Wilson, Paul R.,  The Birthday of Eternity, page 209:As we left the cemetery, I heard an elderly gravedigger muttering back slang to himself before Lucien\\'s headstone. \"Bloody shame, ain\\'t it? Doubt the yob did much living by eighteen.\"I corrected the man, saying, No fear, that yob did plenty of living.(pejorative, chiefly Britain, Australia, New Zealand, slang) A person who engages in antisocial behaviour and/or drunkenness.2005 January 10,  Jackson, Melissa,  Music to deter yobs by, in  BBC News[1]:2009 August 8,  Daley, Janet,  The real reason for all those louts on holiday, in  The Telegraph[2]:Yes, it\\'s holiday time again for British yobs  and the rest of us can flee to those parts of Abroad which the louts ignore, or just cringe in shame at home.2017 March 27,  Southern, Keiran,  \\'We could have been killed\\': Fury at yobs who bricked windscreen with baby girl in car, in  Chronicle Live[3], retrieved 2017-03-28:But while doing 70mph on the A1, a hooded yob threw rock[sic, meaning a rock] from a grass verge onto the windscreen of the familys Jeep, causing it to swerve.", "yarrow": " (usually uncountable, plural yarrows)Any of several pungent Eurasian and North American herbs, of the genus Achillea, used in traditional herbal medicine.Synonyms: milfoil (plural yarrows)(Britain) The green woodpecker, Picus viridis.", "yokozuna": " (plural yokozunas or yokozuna)(sumo) The highest rank of sumo wrestler, above ozeki; a grand champion.1997, A yokozuna is the very highest rank in sumo  just like Mameha\\'s position in Gion, as Nobu explained it to me. I had no reason to doubt him; but if Mameha ever took half as much time entering a party as these yokozuna took entering the ring, she\\'d certainly never be invited back.  Arthur Golden, Memoirs of a Geisha (Vintage 1998, p. 202)", "yeech": "Alternative form of yeesh", "yawmeters": "plural of yawmeter", "yodellers": "plural of yodeller", "youngest": "superlative form of young: most youngMost recently begun or formed.I may be the youngest in my family but I still resent being referred to as the baby.(card games) Receiving dealt cards last, i.e. immediately before the next deal to the eldest. (plural youngests)The youngest child in a family, or individual in a group.", "youngs": "Third-person singular simple present indicative form of young", "yellowshanks": " (plural yellowshanks)A bird, the yellowlegs.1980, John Janovy, YellowlegsBesides, old man could always whistle just like a yellowshanks.", "yegg": " (plural yeggs)(cant, slang) A person who breaks open safes; a burglar.1904, Edwin S. Porter (director), Capture of the Yegg Bank Burglars1914, Louis Joseph Vance, Nobody, chapter III:She was frankly disappointed. For some reason she had thought to discover a burglar of one or another accepted typeeither a dashing cracksman in full-blown evening dress, lithe, polished, pantherish, or a common yegg, a red-eyed, unshaven burly brute in the rags and tatters of a tramp.1940, Raymond Chandler, Farewell, My Lovely, Penguin 2010, p. 265:These racketeers are a new type. We think about them the way we think about old time yeggs or needled-up punks.", "yet": " (third-person singular simple present yets, present participle yetting, simple past and past participle yetted)(dialectal) To melt; found; cast, as metal. (plural yets)(dialectal) A metal pan or boiler; yetling. (not comparable)(usually with negative) Thus far; up to the present; up to some specified time.He has never yet been late for an appointment; &#160; Im not yet wise enough to answer that; &#160; Have you finished yet?Continuously up to the current time; still.The workers went to the factory early and are striking yet.Addisonfacts they had heard while they were yet heathensAt some future time; eventually.The riddle will be solved yet.ShakespeareHe\\'ll be hanged yet.(after certain copulative verbs, followed by an infinitive) Not as of the time referenced.I\\'ve yet to see him.  I have not yet seen him.I had yet to go to a convention.  I had not yet gone to a convention.He seemed yet to be convinced.  He seemed not yet to have been convinced.In addition.1918,  W. B. Maxwell,  chapter 10, in  The Mirror and the Lamp:It was a joy to snatch some brief respite, and find himself in the rectory drawingroom. Listening here was as pleasant as talking; just to watch was pleasant. The young priests who lived here wore cassocks and birettas; their faces were fine and mild, yet really strong, like the rector\\'s face; and in their intercourse with him and his wife they seemed to be brothers.2011 September 18,  Ben Dirs,  Rugby World Cup 2011: England 41-10 Georgia, in  BBC Sport:After yet another missed penalty by Kvirikashvili from bang in front of the posts, England scored again, centre Tuilagi flying into the line and touching down under the bar.There are two hours yet to go until our destination.(degree) Even.K-2 is yet higher than this.Francis BaconMen may not too rashly believe the confessions of witches, nor yet the evidence against them.Nevertheless; however; but; despite that.I thought I knew you, yet how wrong I was.1915, Emerson Hough, The Purchase Price, chapterII:Carried somehow, somewhither, for some reason, on these surging floods, were these travelers, of errand not wholly obvious to their fellows, yet of such sort as to call into query alike the nature of their errand and their own relations. It is easily earned repetition to state that Josephine St. Auban\\'s was a presence not to be concealed.1913,  Mrs. [Marie] Belloc Lowndes,  chapter I, in  The Lodger, London: Methuen, OCLC 7780546; republished in  Novels of Mystery: The Lodger; The Story of Ivy; What Really Happened, New York, N.Y.: Longmans, Green and Co., 55 Fifth Avenue, [1933], OCLC 2666860, page 0016:Thus the red damask curtains which now shut out the fog-laden, drizzling atmosphere of the Marylebone Road, had cost a mere song, and yet they might have been warranted to last another thirty years. A great bargain also had been the excellent Axminster carpet which covered the floor;&#160;[].2013 May 25,  No hiding place, in  The Economist, volume 407, number 8837, page 74:In America alone, people spent $170 billion on direct marketingjunk mail of both the physical and electronic varietieslast year. Yet of those who received unsolicited adverts through the post, only 3% bought anything as a result.", "yeti": " (plural yeti or yetis)(cryptozoology) An unidentified humanoid animal said to live in the Himalayas.", "yttric": " (not comparable)Of or pertaining to yttrium.", "yerth": "(dialectal, dated) earth1875,  Various,  Lippincott\\'s Magazine of Popular Literature and Science Vol. XV., No. 85. January, 1875.[1]:Maybe the great anes o\\' the yerth get sic a forlethie (surfeit) o\\' grand\\'ur \\'at they\\'re for nae mair, an\\' wad perish like the brute beast.1902,  Ellen Glasgow,  The Battle Ground[2]:Den he drap right ter de yerth, en I des stop long enough ter put a tin bucket on my haid \\'fo\\' I began ter crawl atter Marse Dan.", "yeshiva": " (plural yeshivas or yeshivot)(Judaism) An academy for the advanced study of Jewish texts.2015, Will Self, Diary, London Review of Books, vol. 37 no.5:Shalom grew up in an Orthodox family in Stamford Hill. His father, who ran an office-furniture business, intended him for a synagogue cantor, and when Shalom finished school he was sent to the yeshiva.", "yapped": "simple past tense and past participle of yap (not comparable)Of a book: having a yapp.", "yaups": "plural of yaup", "yauper": " (plural yaupers)Alternative form of yawper", "yokewood": " (uncountable)The wood of Catalpa longissima, much used in carpentry.", "yammerers": "plural of yammerer", "yapping": "present participle of yap (plural yappings)A sound that yaps.", "yestereven": " (not comparable)(archaic) Yesterday evening.1820, Walter Scott, Ivanhoe, Chapter 15,[1]Wert thou not in presence yester-even, said De Bracy, when we heard the Prior Aymer tell us a tale in reply to the romance which was sung by the Minstrel? [] ", "ylem": " (uncountable)(astronomy, cosmology, physics, now  chiefly historical) In the Big Bang theory, the hot and dense plasma which made up the cosmos at the time of recombination in an early stage of its expansion and cooling, when the first atoms formed and photons decoupled. The ylem is regarded as the source of the cosmic microwave background. [from 1948.]1948 December 1,  R[alph] A[sher] Alpher,  A Neutron-capture Theory of the Formation and Relative Abundance of the Elements, in  Physical Review, volume 74, number 11, College Park, Md.: American Physical Society, DOI:10.1103/PhysRev.74.1577, OCLC 896770069, page 1581, column 1:Very shortly after the beginning of the universal expansion, the ylem was a gas of neutrons only. [Footnote: According to Webster\\'s New International Dictionary, 2nd Ed., the word ylem is an obsolete noun meaning The primordial substance from which the elements were formed. It seems highly desirable that a word of so appropriate a meaning be resurrected.]1952, George Gamow, The Creation of the Universe, New York, N.Y.: Viking Press, OCLC 999160; republished as New York, N.Y.: Viking Press, 1961, 2nd edition, OCLC 642243549, page 53:Let us now consider the state of matter during the first minutes of the expansion process, when the temperature of the universe was many billions of degrees high. [] [T]he state of matter must be visualized as a hot gas formed entirely by nuclear particles; that is, protons, neutrons, and electrons. [] We will call this primordial mixture of nuclear particles \"Ylem,\" [footnote: Pronounced: lm] reviving an obsolete noun which, according to Webster\\'s Dictionary, means \"the first substance from which the elements were supposed to be formed.\" Next we can ask what happened to the Ylem when its density and temperature began to drop as the result of the rapid expansion taking place in the young universe.1959,  James Blish,  chapter 7, in  A Clash of Cymbals [US title: The Triumph of Time] (Cities in Flight; 4), London: Faber and Faber, ISBN, page 171:The ylem was the primordial flux of neutrons out of which all else emerged.2008,  Piers Bizony,  Part Eight, Ylem, in  Atom, Thriplow, Cambridgeshire: Icon, ISBN, page 171:He [George Gamow] surmised that that the universe began as a super-condensed raging inferno of protons, neutrons and electrons, which he and his colleagues called the ylem [] The internal pressures of the ylem caused it to expand outward extremely rapidly. After a few minutes the ylem cooled down sufficiently to allow the strong force to bind neutrons and protons together into deuterium nuclei. [] Then there was just enough time for some of the deuterium to fuse into helium before temperatures and pressures of the ylem became too diffuse to allow more fusions.", "yammer": " (third-person singular simple present yammers, present participle yammering, simple past and past participle yammered)(intransitive) To complain peevishly.(intransitive) To talk loudly and persistently.(transitive) To repeat on and on, usually loudly or in complaint.(intransitive, rare) To make an outcry; to clamor.1951, Isaac Asimov, Foundation (1974 Panther Books Ltd publication), part V: The Merchant Princes, chapter 17, page 182,  1It was a ship, but a whale to the Dark Nebulas minnow; and on its side was the Spaceship-and-Sun of the Empire. Every alarm on the ship yammered hysterically. (uncountable)The act or noise of yammering.1999, J. M. Coetzee, Disgrace, Penguin, 2000, Chapter Eight, pp. 72-73,The house is just as he had imagined it would be: rubbishy furniture, a clutter of ornaments (porcelain shepherdesses, cowbells, an ostrich-feather flywhisk), the yammer of the radio, the cheeping of birds in cages, cats everywhere underfoot.A loud noise.1943, R. Sidney Bown, Dave Dawson with the Flying Tigers, Akron, Ohio: Saalfield Publishing Company, Chapter Twelve,[1]The ungodly scream of Jap wings in the wind, and the blood-chilling snarl and yammer of their aerial machine gun and aerial cannon fire was enough to make the very ground shake and tremble.One who yammers.", "yeomen": "plural of yeoman", "yabbie": " (plural yabbies)Alternative spelling of yabby", "yarpha": " (uncountable)(obsolete, Scotland, Orkney) Peat bog.", "yardbirds": "plural of yardbird", "yardbird": " (plural yardbirds)(chiefly US, slang) A chicken.(chiefly US, slang) A person who is imprisoned.1985, John P. Conrad, \"Charting a Course for Imprisonment Policy,\" Annals of the American Academy of Political and Social Science, vol. 478, p. 126:The working convict is a rare exception, sometimes envied because his time is occupied, sometimes derided for his deviance from the yardbird norm.(chiefly US, slang) A soldier who is required to perform menial work on the grounds of a military base.1943, \"In the Rough,\" Time, 5 Jul.:As the Marines expanded to war strength, Lou Diamond was the ideal liaison between crusty old-timers and impressionable recruits. He taught quick action by threats of yardbird detail.", "yellowness": " (usually uncountable, plural yellownesses)The state or quality of being yellow.c. 1390s, Geoffrey Chaucer, The Complaint of Chaucer to his Purse, lines 8-11,[1]Now voucheth sauf this day or hyt be nyghtThat I of yow the blisful soun may hereOr see your colour lyk the sonne bryghtThat of yelownesse hadde never pere.1872, George Eliot, Middlemarch, London: William Blackwood &amp; Sons, Volume III, Book V, Chapter 45, p. 25,[2][] at least there would be no harm in getting a few bottles of stuff from him, since if these proved useless it would still be possible to return to the Purifying Pills, which kept you alive, if they did not remove the yellowness.1924, Herbert Jenkins, The Bindles on the Rocks, London: Herbert Jenkins, Chapter VI, Part II,[3][] lemonade of a yellowness sufficient to convince the most inveterate pessimist of the presence of the lemon.(obsolete) Jealousy.c. 1600, William Shakespeare, The Merry Wives of Windsor, Act I, Scene 3,[4]My humour shall not cool: I will incense Page to deal with poison; I will possess him with yellowness, for the revolt of mine is dangerous: that is my true humour.1621, Robert Burton, The Anatomy of Melancholy, Oxford: Henry Cripps, The Third Partition: Love Melancholy, Section 3, Member 1, Subsection 2, p. 680,[5]The vndiscreet carriage of some lasciuious gallant [] by his often frequenting of an house, and bold vnseemly gestures, may make a breach, and by his ouer familiarity, if he be inclined to yellownesse, colour him quite out.", "yearningly": " (comparative more yearningly, superlative most yearningly)With yearning; with desire; longingly.1860, George Eliot, The Mill on the Floss, Book 6, Chapter 14,[1]He was silent a few moments, not looking at her; while her eyes were turned toward him yearningly, in alarm at this sudden change.1904, Henry James, The Golden Bowl, Part 2, Chapter 7,[2]Yet what was it she had in mind, what did she wish to make of him beyond what she had already made, a patient, punctilious host, mindful that she had originally arrived much as a stranger, arrived not at all deliberately or yearningly invited?so that one positively had her possible susceptibilities the MORE on ones conscience.1944, Emily Carr, The House of All Sorts, Life Loves Living, [3]The old maple stump shot sickly pink switches from her roots, new switches every year. They crept yearningly toward the little square of window.", "yarraman": " (plural yarramans or yarramen)(Australian Aboriginal) horse", "yokeless": " (not comparable)Without a yoke.", "you": " (second person, singular or plural, nominative or objective, possessive determiner your, possessive pronoun yours, singular reflexive yourself, plural reflexive yourselves)(object pronoun) The people spoken, or written to, as an object. [from 9th c.]1611, Bible, Authorized (King James) Version. Genesis XLII:And Joseph said unto them, That is it that I spake unto you, saying, Ye are spies [...].(reflexive, now US  colloquial) (To) yourselves, (to) yourself. [from 9th c.]c. 1591, William Shakespeare, Richard III:If I may counsaile you, some day or two / Your Highnesse shall repose you at the Tower [...].1611, Bible, Authorized (King James) Version. Genesis XIX:And Lot went out, and spake unto his sons in law, which married his daughters, and said, Up, get you out of this place; for the LORD will destroy this city.1970, Donald Harington, Lightning Bug:Pull you up a chair, she offered.1975, Joseph Nazel, Death for Hire:You\\'d better get you a gun and kill him before he kills you or somebody.(object pronoun) The person spoken to or written to, as an object. (Replacing thee; originally as a mark of respect.) [from 13th c.]c. 1485, Thomas Malory, Le Morte Darthur, Book VIII:I charge you, as ye woll have my love, that ye warne your kynnesmen that ye woll beare that day the slyve of golde uppon your helmet.(subject pronoun) The people spoken to or written to, as a subject. (Replacing ye.) [from 14th c.]Both of you should get ready now.You are all supposed to do as I tell you.(subject pronoun) The person spoken to or written to, as a subject. (Originally as a mark of respect.) [from 15th c.]c. 1395, Geoffrey Chaucer, \"The Clerk\\'s Tale\", Canterbury Tales, Ellesmere manuscript (c. 1410):certes lord / so wel vs liketh yow / And al youre werk / and euere han doon / at we / Ne koude nat vs self deuysen how / We myghte lyuen / in moore felicitee [...].1814 July,  [Jane Austen],  chapter IX, in  Mansfield Park: A Novel. In Three Volumes, volume II, London: Printed for T[homas] Egerton, Military Library, Whitehall, OCLC 39810224, page 208:You are right, Fanny, to protest against such an office, but you need not be afraid.(indefinite personal pronoun) Anyone, one; an unspecified individual or group of individuals (as subject or object). [from 16th c.]2001, Polly Vernon, The Guardian, 5 May 2001:You can\\'t choose your family, your lovers are difficult and volatile, but, oh, you can choose your friends - so doesn\\'t it make much more sense to live and holiday with them instead?The individual or group spoken or written to.Have you gentlemen come to see the lady who fell backwards off a bus?Used before epithets for emphasis.You idiot! (third-person singular simple present yous, present participle youing, simple past and past participle youed)(transitive) To address (a person) using the pronoun you, rather than thou, especially historically when you was more formal.", "yoghs": "plural of yogh", "yardgrass": " (uncountable)Grass in a lawn1998,  Tabor Evans,  Longarm and the Wyoming Wildwomen[1], page 150:Longarm followed the path in the yardgrass to a cellar door at the rear of the bigger frame church.Eleusine indica, a coarse annual grass often found as a weed1991,  David Moresby Moore,  Plant Life[2], page 34:The yardgrass (Eleusine indica) has similarly spread along roadside verges in western Africa and other tropical regions.", "yawns": "Third-person singular simple present indicative form of yawn", "yellowfin": " (plural yellowfin or yellowfins)Any of various fish with yellow fins.(countable) Thunnus albacares, a yellowfin tuna, an individual member of that species.yellowfin bream, a fish in the Sparidae familyyellowfin croaker, a fish in the Sciaenidae familyyellowfin cutthroat trout, a fish in the Salmonidae familyyellow fin fairy wrasse, a fish in the Labridae familyyellowfin grouper, a fish in the Serranidae familyyellowfin madtom, a fish in the Ictaluridae familyyellow-fin perchlet, a fish in the Ambassidae familyyellowfin pike, a fish in the Dinolestidae familyyellowfin seabream, a fish in the Sparidae familyyellowfin surgeon, a fish in the Acanthuridae familyyellowfin whiting, a fish in the Sillaginidae family", "yummier": "comparative form of yummy: more yummy", "yeaning": "present participle of yean", "yagger": " (plural yaggers)(obsolete) A fishing boat used to catch herring.", "yock": " (plural yocks)A laugh, especially a loud or hearty one. (third-person singular simple present yocks, present participle yocking, simple past and past participle yocked)To laugh, especially loudly or uproariously", "yodel": " (third-person singular simple present yodels, present participle (UK) yodelling or (US) yodeling, simple past and past participle (UK) yodelled or (US) yodeled)(transitive and intransitive) To sing (a song) in such a way that the voice fluctuates rapidly between the normal chest voice and falsetto. (plural yodels)A song incorporating yodelling.", "yaupons": "plural of yaupon", "yaourt": " (uncountable)A liquor fermented from milk, originally by the Turks.", "yang": " (uncountable)(philosophy) A principle in Chinese and related East Asian philosophies associated with bright, hot, masculine, etc. elements of the natural world. (plural yangs)The monetary unit of Korea from 1892 to 1902, divided into 100 pun. (third-person singular simple present yangs, present participle yanging, simple past and past participle yanged)(rare) To make the cry of the wild goose.1902, Eleanor Gates, The biography of a prairie girlAway they went, the colt in the lead and the pinto after, until they reached the bunch of cottonwoods far up the stream where the yanging wild geese had their nests.1957, Adelbert Ames, Chronicles from the Nineteenth Century: 1874-1899Last night we were awakened by the barking of dogs and yanging of a goose, and investigated to find that the man had neglected to house the geese and the dogs were killing them. (plural yangs)The cry of the wild goose; a honk.1867,  Gail Hamilton,  Wool-gathering[1], Boston: Ticknor and Fields, page 185:Hangs is a false word,  a Northern corruption of the negro dialect yang,  an onomatopian word, representing the \"far heard clang\" of the wild goose.", "ypsiloid": " (comparative more ypsiloid, superlative most ypsiloid)Shaped like the letter Y.", "yemen": "plural of yeman", "yolkless": " (not comparable)Without a yolk.a yolkless egg", "yelping": "present participle of yelp (plural yelpings)The act of producing a yelp.the frenzied yelpings of the huntsman\\'s dogs", "yearners": "plural of yearner", "yappy": " (comparative yappier, superlative yappiest)Of a dog, yapping in an annoying manner.Very talkative; talking foolishly or at length.", "yak": " (plural yak or yaks)An ox-like mammal native to the Himalayas and Tibet with dark, long, and silky hair, a horse-like tail, and a full, bushy mane.2008, Scott R. R. Haskell, Blackwell\\'s Five-Minute Veterinary Consult: Ruminant, John Wiley &amp; Sons (ISBN 9780781753258), page 619Utilization efficiency of dietary protein in the yak differs with diet composition and feeding level, age, sex, body condition score, and animal production level (e.g., growth, lactation). Researchers reported no difference between lactating and dry cows in crude protein digestibility, although lactating yak tend to consume more feed than dry yak.2004, Wilson G. Pond, Encyclopedia of Animal Science (Print), CRC Press (ISBN 9780824754969), page 899Attempts are now being made, by selection, to create a new breed of yak (the Datong yak) from such crosses. Hybridization of domestic yak with local cattle, at intermediate elevations, has been practiced for generations. The hybrids inherit some of the good characteristics from each species, but lack the adaptation of the yak to the harsh conditions at higher elevations. (third-person singular simple present yaks, present participle yakking, simple past and past participle yakked)(intransitive) To talk, particularly informally but persistently; to chatter or prattle.1960: You\\'ll like Poppet. Nice dog. Wears his ears inside out. Why do dachshunds wear their ears inside out? I could not say, sir. Nor me. I\\'ve often wondered. But this won\\'t do, Jeeves. Here we are, yakking about Jezebels and dachshunds, when we ought to be concentrating our minds [...] (P. G. Wodehouse, Jeeves in the Offing, chapter XI)(intransitive) To vomit, usually as a result of excessive alcohol consumption.1998,  Matthew Glave as Glenn Guglia,  The Wedding Singer, written by Tim Herlihy:She\\'ll feel better when she yaks. (plural yaks)A talk, particular an informal one such as chattering.1983, Nicolas Freeling, The Back of the North Wind (ISBN 9780140069532)The sudden head-down butt jabbed into someones face, is a highly effective way of putting a stop to his yack.(slang) A laughVomit. (plural yaks)(slang) A kayak.", "yanks": "plural of yankThird-person singular simple present indicative form of yank", "yurt": " (plural yurts)A large, round, semi-permanent tent with vertical walls and a conical roof, usually associated with Central Asia and Mongolia (where it is known as a ger).1880,  Henry H[oyle] Howorth,  The Nogais, Karakalpaks, and Siberian Tartars, in  History of the Mongols from the 9th to the 19th Century. Part II. The So-called Tartars of Russia and Central Asia, part II, division II, London: Longmans, Green, and Co., OCLC 34914125, page 1026:[T]heir [the Nogais\\'] cattle grazed on the Little Injik, only seven versts from the boundary line. In summer they kept them in the Black Mountains, and in winter at their auls. They lived in felt yurts, and often changed their place of abode.1994 February,  Andrew Stiny,  Yurts of the San Juans: Ski and Camp in the Colorado/New Mexico High Country, Mongolian Style, in  Backpacker: The Magazine of Wilderness Travel, volume 22, number 129(1), Emmaus, Pa.: Rodale, Inc., ISSN 0277-867X, OCLC 859045083, page 70:Who would have imagined that the circular, skin-covered, pole-framed tents used by Mongolian nomads would find another life in the Colorado backcountry? The Mongols might be surprised if they could see how their portable structures have been improved and put to use in the San Juan Mountains of southern Colorado and northern New Mexico. [] About halfway to the [Neff Mountain] yurt, the trail makes an uphill switchback and passes the bottom of a big, open bowl.2000,  Brian Litz,  San Juan Mountains, in  Colorado Hut to Hut. Volume 2: Southern Region, volume 2, Englewood, Colo.: Westcliffe Publishers, ISBN, page 55:Northeast of the center\\'s main group of yurts is a new neighborthe Spruce Hole Yurtoperated by Cumbres Nordic Adventures. This yurt is easy to get to, affords scenic views, and serves up classic touring terrain.2008 August,  Paul Brummell,  Background Information, in  Kazakhstan: The Bradt Travel Guide, Chalfont St Peter, Buckinghamshire: Bradt Travel Guides, ISBN, page 17:The principal dwelling of the nomadic Kazakhs, the circular, felt-covered yurt is a potent image of Kazakh culture. Few Kazakhs now live in yurts, although they are still used by some pastoralists who still move their herds into summer mountain pastures. [] But the imagery of the yurt remains central to Kazakh ethnic identity, and provides national cultural symbolism deployed by the authorities of independent Kazakhstan.2010,  Lydia Laube,  Slow Boat to Mongolia, Kent Town, South Australia: Wakefield Press, ISBN:I saw the first round white roofs of yurts, or gers as they are called in Mongolian. Yurt is Russian, and all that is Russian is now on the outer in Mongolia. If you said yurt, Mongolians looked at you as though you had uttered a dirty word.2013,  Robert F. Lee,  How to Build a (Semi) Solid Wall Yurt, [United States]: Published by CreateSpace for Robert F. Lee, ISBN, page 71:When designing any building (including a yurt), one should consider the trade-off between letting in more light and heat in the winter and blocking the intense rays of the sun in the summer. [] The first few months during which we lived in our yurt saw the sun burning into our south and southwest facing windows. Our only solution was to use blinds, which left the yurt darkened. A more viable solution was a mirrored portable awning that was built into a scaffold sitting just outside the window.", "yearlies": "plural of yearly", "yantras": "plural of yantra", "yauping": "present participle of yaup", "yttrium": " (usually uncountable, plural yttriums)A metallic chemical element (symbol Y) with an atomic number of 39.A single atom of this element.", "yelks": "plural of yelk", "yodeling": "present participle of yodel", "yente": " (plural yentes)Alternative spelling of yenta", "yukked": "simple past tense and past participle of yuk", "yeah": " (not comparable)(informal) Yes.Expressing joy, celebration, glee, etc.Yeah! We did it!", "yippee": "Used to express joy or elation.1994, Frasier (TV, episode 2.05)You\\'ll understand, though, if I don\\'t jump up and down and yell \"Yippee!\"", "yeans": "Third-person singular simple present indicative form of yean", "yeelins": "plural of yeelin", "yows": "plural of yow", "yearning": " (plural yearnings)A wistful or melancholy longing.She had a yearning to see her long-lost sister again.(archaic) rennetpresent participle of yearn", "yesterevening": " (uncountable)(archaic) yesterday evening", "yite": " (plural yites)(Britain, dialect) The yellowhammer.", "yawned": "simple past tense and past participle of yawn", "yor": "Eye dialect spelling of your.", "yfere": " (not comparable)(obsolete, poetic) Together. [13th-18th c.]c. 1385, Geoffrey Chaucer, Troilus and Criseyde, II:Of this and that they pleide and gonnen wade / In many an vnkouth, gladde, and depe matere, / As frendes doon whan thei ben mette y-fere [...].1590, Edmund Spenser, The Faerie Queene, III.1:So goodly all agreed they forth yfere did ryde.", "yearned": "simple past tense and past participle of yearn", "yapon": " (plural yapons)(now  less common than \"yaupon\") Alternative form of yaupon", "yatter": " (plural yatters)natter, prattle, mindless chatter. (third-person singular simple present yatters, present participle yattering, simple past and past participle yattered)To natter, prattle; to mindlessly chatter", "yeard": " (plural yeards)(archaic) Alternative form of yard(dialectal) Alternative form of heard", "yonker": " (plural yonkers)Obsolete spelling of younker", "yamulkas": "plural of yamulka", "yodeled": "simple past tense and past participle of yodel", "yieldable": " (comparative more yieldable, superlative most yieldable)(archaic) Disposed to yield or comply.(engineering) Capable of yielding under pressure, rather than being bent or snapped.", "yakin": " (plural yakin or yakins)A large Himalayan antelope, Budorcas taxicolor", "ytterbic": " (not comparable)Of or pertaining to ytterbium.", "yesterday": " (plural yesterdays)The day immediately before today; one day ago.Today is the child of yesterday and the parent of tomorrow.Yesterday was rainy, but by this morning it had begun to snow.1899,  Hughes Mearns,  Antigonish:Yesterday, upon the stair&#160;/ I met a man who wasnt there&#160;/ He wasnt there again today&#160;/ I wish, I wish hed go away&#160;The (recent) past, often disparaging.yesterday\\'s technology1606 William Shakespeare, Macbeth, 5.5All our yesterdays have lighted fools the way to dusty death.2013 June 22,  Snakes and ladders, in  The Economist, volume 407, number 8841, page 76:Risk is everywhere. From tabloid headlines insisting that coffee causes cancer (yesterday, of course, it cured it) to stern government warnings about alcohol and driving, the world is teeming with goblins. For each one there is a frighteningly precise measurement of just how likely it is to jump from the shadows and get you. (not comparable)On the day before todayI started to watch the video yesterday, but could only finish it this evening.As soon as possibleI want this done yesterday!", "yelloch": " (third-person singular simple present yellochs, present participle yelloching, simple past and past participle yelloched)(Scotland) To yell loudly", "yawp": " (third-person singular simple present yawps, present participle yawping, simple past and past participle yawped)(intransitive) to yelp, or utter a sharp cry, as in intense pain, or another raucous noise(intransitive) to talk loudly and coarsely(intransitive) clamor, utter loud complaints (plural yawps)a yelp or barkloud or coarse talkSound my barbaric yawps over the roofs of the world - Walt Whitman", "yep": " (not comparable)(informal) Yes. (plural yeps)(informal) Yes.I\\'ll take that as a yep, then.", "yeshivas": "plural of yeshiva", "yoyo": " (plural yoyos)Alternative spelling of yo-yo (third-person singular simple present yoyos, present participle yoyoing, simple past and past participle yoyoed)Alternative spelling of yo-yo", "yieldy": " (comparative more yieldy, superlative most yieldy)(archaic or dialect) yielding", "yaw": " (plural yaws)The rotation of an aircraft, ship, or missile about its vertical axis so as to cause the longitudinal axis of the aircraft, ship, or missile to deviate from the flight line or heading in its horizontal plane.The angle between the longitudinal axis of a projectile at any moment and the tangent to the trajectory in the corresponding point of flight of the projectile.An act of yawing.(nautical) A vessel\\'s motion rotating about the vertical axis, so the bow yaws from side to side; a characteristic of unsteadiness.The extent of yawing, the rotation angle about the vertical axisthe yaw of an aircraft (third-person singular simple present yaws, present participle yawing, simple past and past participle yawed)(intransitive, aviation) To turn about the vertical axis while maintaining course.(intransitive, nautical) To swerve off course to port or starboard.(intransitive, nautical) To steer badly, zigzagging back and forth across the intended course of a boat; to go out of the line of course.LowellJust as he would lay the ship\\'s course, all yawing being out of the question.(intransitive) To rise in blisters, breaking in white froth, as cane juice in the clarifiers in sugar works.", "yahrzeits": "plural of yahrzeit", "yett": " (plural yetts)(Scotland, Geordie) Gate.2015, Douglas Nicholas, Throne of Darkness, page 126,The outer yett was closed, and a torch burned in a socket set in the gatehouse wall beside the archway. A guard stepped up, peered through the yett at Guillaume, and nodded to someone off to the side. (not comparable)Obsolete spelling of yet1608, Kalenders of the Starre Chamber, extract republished 1840, J. Payne Collier (editor), Lord Bacon and the Star Chamber, in The Egerton papers: A collection of public and private documents, chiefly illustrative of the times of Elizabeth and James I, from the original documents, page 431,So when the L. Chauncellor or Keeper passeth anie patent by imediate warrant, yett the fees of the Clerke of the Seale and Signett are ordered to be awnswered, and yett theie doe noething for them.", "yardmasters": "plural of yardmaster", "yatters": "plural of yatterThird-person singular simple present indicative form of yatter", "yardwands": "plural of yardwand", "yeastlike": " (comparative more yeastlike, superlative most yeastlike)Resembling or having characteristics of yeast1988,  January 22,  Robert McClory, in  The Yeast of Our Problems[1]:Under certain conditions, it seems, candida can change from its yeastlike, noninvasive state into a parasitic fungus that spreads like wildfire through the gut.", "yeastless": " (not comparable)Without yeast.", "yenite": " (uncountable)Alternative form of jenite", "yuckier": "comparative form of yucky: more yucky", "yagers": "plural of yager", "yardwand": " (plural yardwands)(archaic) A yardstick.", "yuca": " (countable and uncountable, plural yucas)Cassava.cassava root", "yellowbellies": "plural of yellowbelly", "yarn": " (countable and uncountable, plural yarns)(uncountable) A twisted strand of fiber used for knitting or weaving.(nautical) Bundles of fibers twisted together, and which in turn are twisted in bundles to form strands, which in their turn are twisted or plaited to form rope.(countable) A story, a tale, especially one that is incredible.1913,  Joseph C. Lincoln,  chapter 4, in  Mr. Pratt\\'s Patients:I told him about everything I could think of; and what I couldn\\'t think of he did. He asked about six questions during my yarn, but every question had a point to it. At the end he bowed and thanked me once more. As a thanker he was main-truck high; I never see anybody so polite. (third-person singular simple present yarns, present participle yarning, simple past and past participle yarned)To tell a story or stories.1942, Neville Shute, Pied Piper, New York: William Morrow &amp; Co., Chapter 7,[1]They had stayed in some little pension and had gone for little, bored walks while the colonel went out in the boats with the fisherman, or sat yarning with them in the caf.", "yed": " (third-person singular simple present yeds, present participle yedding, simple past and past participle yedded)(intransitive, archaic) To speak; sing.(intransitive, Britain  dialectal) To magnify greatly in narration; exaggerate a tale; fib.(intransitive, Britain  dialectal) To contend; wrangle. (plural yeds)(archaic) A saying.(Britain  dialectal) A falsehood; leasing. (third-person singular simple present yeds, present participle yedding, simple past and past participle yedded)(Britain  dialectal) To burrow underground, as a rabbit or mole; also said of miners.(Britain  dialectal) To be associated with a place or locality. (Can we add an example for this sense?) (plural yeds)(Britain  dialectal) A burrow; a hole made by an animal in the ground. (plural yeds)(dated, fandom slang) A self-reference to the editor of a periodical; a substitution for the editor\\'s name or signature.1950 December,  Hoffman, Lee,  Chaos, in  Quandry[1], number 5, page 3:Fandom is a wonderful thing. We used to live in Florida ten years ago. Across the street lived a lad two years older than yed who had the most wonderful collection of comic books...all of a stf nature. At the ripe old age of eight yed was swept to Georgia and the lad with the comics was never heard from. Since entering fandom we thought much of him and wondered if he were not a slan. This morning we learned that he is a member of NFFF and TFSC. Naturally we got a letter off to him.1952 February,  Robinson, Fred J.,  Arose By Any Other Name, in  Straight Up[2], volume 1, number 1, page 1:All of which sprang (crawled?) from the fertile skull of yed, no doubt it is something in my Radius.1976 November,  Hoffman, Lee,  Editorial, in  Science-Fiction Five-Yearly[3], number 6, page 4:In preparation for this momentous occasion yed has been browsing past issues of this sterling journal, and it has come to our attention that previous articles by yhos have been devoted largely to bemoaning the multitude of technical problems encountered in production -- the difficulties of duplication, the miseries of mimeography.", "yellowest": "superlative form of yellow: most yellow", "yucky": " (comparative yuckier, superlative yuckiest)(colloquial, often childish) Of something highly offensive; causing aversion or disgust.2007, \"Queensland to drink waste water\", BBC Online:\"Don\\'t rule out desalination because it is expensive, or recycling because it sounds yucky, or building a dam,\" Mr Turnbull told Australian media.\"", "yobboes": "plural of yobbo1986 He stared at them with eyes dull with fatigue, and let out a long sigh. Trouble, trouble he replied wearily. Skinheads and yobboes fighting the coloureds - Emily Roberts - A Shiver of Fear Page 5", "yawn": " (third-person singular simple present yawns, present participle yawning, simple past and past participle yawned)To open the mouth widely and take a long, rather deep breath, often because one is tired and sometimes accompanied by pandiculation.I could see my students yawning, so I knew the lesson was boring them.TrumbullAnd while above he spends his breath, / The yawning audience nod beneath.To present a wide opening.The canyon yawns as it has done for millions of years, and we stand looking, dumbstruck.Death yawned before us, and I hit the brakes.Shakespeare\\'Tis now the very witching time of night, / When churchyards yawn.To open the mouth, or to gape, through surprise or bewilderment.(Can we find and add a quotation of Shakespeare to this entry?)To be eager; to desire to swallow anything; to express desire by yawning.to yawn for fat livingsLandorone long, yawning gaze (plural yawns)The action of yawning; opening the mouth widely and taking a long, rather deep breath, often because one is tired.A particularly boring event.The slideshow we sat through was such a yawn. I was glad when it finished.", "youngling": " (comparative more youngling, superlative most youngling)young; youthful (plural younglings)A young person, animal or plant; chit.Edmund SpenserMore dear [] than younglings to their dam.RidleyHe will not be so willing, I think, to join with you as with us younglings.", "yellers": "plural of yeller", "yardstick": " (plural yardsticks)Wikipedia has an article on:yardstickWikipediaA measuring rod thirty-six inches long.(figuratively) A standard to which other measurements or comparisons are judged.2008 April 8, Michael R. Gordon and Eric Schmitt, Attacks in Baghdad spiked in March, U.S. data show, in International Herald Tribune, 2008 April 8 edition, Africa &amp; Middle East section,Attacks against civilians in the capital remained relatively unchanged: 69 in March from 62 in February.  However, another yardstick, the number of civilian deaths tracked by the Iraqi government, shot up last month after several months of decline.2013 January 29,  European Court of Human Rights,  Rman v. Finland[1], number 13072/05, marginal 5253:While performing the balancing of interests test in the examination of cases concerning limitations on the institution of paternity claims, the Court has taken a number of factors into consideration. For instance, the particular point in time when an applicant becomes aware of the biological reality is pertinent. The Court will therefore examine whether the circumstances substantiating a particular paternity claim are met before or after the expiry of the applicable time-limit (see, for instance, the cases of Shofman v. Russia, cited above,  40 and 43; and Mizzi v. Malta, cited above,  109-111, concerning disavowal of paternity claims). Furthermore, the Court will examine whether or not an alternative means of redress exists in the event that the proceedings in question are time-barred. This would include, for example, the availability of effective domestic remedies to obtain the re-opening of the time-limit (see, for example, Mizzi v. Malta, cited above,  111) or exceptions to the application of a time-limit in situations where a person becomes aware of the biological reality after the time-limit has expired (see Shofman v. Russia, cited above,  43).The yardstick against which the above factors are measured is whether a legal presumption has been allowed to prevail over biological and social reality and if so whether, in the circumstances, this is compatible, having regard to the margin of appreciation left to the State, with the obligation to secure effective respect for private and family life, taking into account the established facts and the wishes of those concerned (see Kroon and Others v. the Netherlands, cited above,  40). For example, the Court has found that rigid limitation periods or other obstacles to actions contesting paternity that apply irrespective of a putative fathers awareness of the circumstances casting doubt on his paternity, without allowing for any exceptions, violated Article 8 of the Convention (see, Shofman v. Russia, cited above,  43-45; see also, mutatis mutandis, Mizzi v. Malta, cited above,  80 and 111-113; Paulk v. Slovakia, no. 10699/05,  45-47, ECHR 2006XI (extracts); and Tavl v. Turkey, no. 11449/02,  34-38, 9 November 2006).2017 October 3,  European Court of Human Rights,  Silva and Mondim Correia v. Portugal[2], number 72105/14 20415/15, marginal 58:The Court has taken a number of factors into consideration in performing the balancing of interests test while examining cases concerning limitations on the institution of paternity claims. For instance, the specific point in time when an applicant becomes aware of the biological reality is pertinent. The Court will therefore examine whether the factors substantiating a particular paternity claim were met before or after the expiry of the applicable time-limit. Furthermore, the Court will examine whether an alternative form of redress exists in the event that the proceedings in question are time-barred. This would include, for example, the availability of effective domestic remedies to obtain an extension of the time-limit or exceptions to the application of a time-limit in situations where a person becomes aware of the biological reality after the time-limit has expired (Phinikaridou, cited above,  54). The yardstick against which the above factors are measured is whether a legal presumption has been allowed to prevail over the biological and social reality and if so whether, in the circumstances, this is compatible with the obligation to secure effective respect for private and family life, taking into account the margin of appreciation left to the State and the established facts and the wishes of those concerned (ibid.  55).", "yeastiest": "superlative form of yeasty: most yeasty", "yurts": "plural of yurt", "yardages": "plural of yardage", "yabbered": "simple past tense and past participle of yabber", "yender": " (plural yenders)(North  Britain  dialect) Alternative form of yeender.", "yeasayers": "plural of yeasayer", "yaffingale": " (plural yaffingales)(archaic) the European green woodpecker, Picus viridis", "yerks": "Third-person singular simple present indicative form of yerk", "yellowly": " (comparative more yellowly, superlative most yellowly)In a yellow manner; with yellow colour.1864, Charles Dickens, Mrs. Lirripers Legacy in All the Year Round, Extra Christmas Number, 1 December, 1864, Part 4, p. 28,[1]After rice appeared the much-dreaded pie, glaring yellowly, with its coarse pretentious outsideprototype of many a living humbugveiling one knows not what of false and vile.1930, D. H. Lawrence, Love Among the Haystacks in Love Among the Haystacks and Other Stories, Part 4, p. 31,[2]The light of the bicycle lamp sheered yellowly across the dark, catching a glint of raindrops, a mist of darkness, shadow of leaves and strokes of long grass.1938, Graham Greene, Brighton Rock, London: Vintage, 2002, Chapter 1,He showed his tartar-coated teeth in a fatherly smile. [] when he crossed the room, yellowly smiling, he might have been about to kiss the bride.1958, Alfred Hayes, My Face for the World to See, New York Review of Books, 2013, Chapter 6, p. 19,[3]She had a black cat. It regarded me yellowly through the window screen when I rang her doorbell.", "yokemates": "plural of yokemate", "yelk": " (plural yelks)Obsolete form of yolk.", "yesteryear": " (plural yesteryears)(poetic) Past years; time gone by; yore.(rare) Last year.1928, D. H. Lawrence, Lady Chatterley\\'s Lover, ch. 5:Where are the snows of yesteryear?", "yardmaster": " (plural yardmasters)A railroad employer who is in charge of a railway yard.", "yestermorn": " (uncountable)(obsolete) Yesterday morning.1816,  Jane Austen,  Persuasion[1]:The sad accident at Lyme was soon the prevailing topic, and on comparing their latest accounts of the invalid, it appeared that each lady dated her intelligence from the same hour of yestermorn [] .1826,  Mary Shelley,  The Last Man[2]:\"That, Clara,\" I said, \"is the gate, that the street which yestermorn your father rode up.\"1900,  Rudyard Kipling,  The Seven Seas[3]:By the wisdom of the centuries I speak-- To the tune of yestermorn I set the truth-- I, the joy of life unquestioned--I, the Greek-- I, the everlasting Wonder Song of Youth!", "youngberries": "plural of youngberry", "yogh": " (plural yoghs)A letter of the Middle English alphabet (capital , small ), in form derived from the Old English shape of the letter g, and used to represent various palatal and velar sounds.", "youths": "plural of youth", "yeorling": " (plural yeorlings)(Scotland) The yellowhammer.1905,  Lady Catherine Henrietta Milnes Gaskell,  Spring in a Shropshire Abbey, page 179:I asked Thady a minute later what nests he knew of. \"Galore,\" he answered, grinning. And then proceeded to enumerate them&#160;: \" A lintie (a linnet), a green grosbeak (greenfinch), a Harry redcap (goldfinch), a yellow yeorling by the roadside, a scobby (chaffinch), a lavrock (skylark), a cushie-doo (a wood pigeon), a cutty wren (common wren), a nanny washtail (pied wagtail) in the rocks, and two tom-titers of sorts.1907,  Country Life - Volume 21, page 376:The brock, the toad, and the yellow yeorling Get a drap o\\' the de\\'il\\'s bluid ilka May morning.1962,  Henrietta Buckmaster,  All the Living: A Novel of One Year in the Life of William Shakespeare, page 360:Then they listened to a yeorling and Will taught the child its song, \"A little bit of bread and no che-e-ese.", "yawl": " (plural yawls)A small ship\\'s boat, usually rowed by four or six oars.A fore-and-aft rigged sailing vessel with two masts, main and mizzen, the mizzen stepped abaft the rudder post. (third-person singular simple present yawls, present participle yawling, simple past and past participle yawled)To cry out; to howl.", "yon": " (not comparable)(dated or dialectal) That (thing) over there; of something distant, but within sight.He went to climb yon hill.MiltonRead thy lot in yon celestial sign.2012 Spring,  Gerda Stevenson,  Federer versus Murray, in  Salmagundi:His head... his head... his face... it wisnae there. Nae black curly hair, nae eyes - I\\'ve never seen eyes sae blue as Joe\\'s. Irises blue as yon sky. Blown tae smithereens... his gorgeous, bonny head, no there. (not comparable)(dated or dialectal) Yonder.(dated or dialectal) That one or those over there.(knitting) Acronym of yarn over needle.2006, Heather Dixon, Not Your Mama\\'s Knitting (page 222)Buttonhole row: (K1, p1) 3 times, yon, k2tog, (k1,p1) 5 times, yon, k2tog, []", "yellowbelly": " (plural yellowbellies)A coward.(Britain, slang) Someone from Lincolnshire.", "yoick": "Alternative form of yoicks (hunting cry) (third-person singular simple present yoicks, present participle yoicking, simple past and past participle yoicked)(intransitive) To give the hunter\\'s cry of \"yoick\".", "yantra": " (plural yantras)A geometrical diagram used as a meditation aid in tantric worship.(religion) Any object used as a meditation aid in tantric worship.", "yams": "plural of yam", "yakshi": " (plural yakshis)A female yaksha.", "yukata": " (plural yukata or yukatas)a kind of light kimono.", "yachters": "plural of yachter", "yonis": "plural of yoni", "yobs": "plural of yob", "yas": "(often African American Vernacular) Nonstandard spelling of yes.1862,  Various,  The Continental Monthly, Vol. 2 No 4, October, 1862[1]:\\'Oh! yas, I smokes; but I durned sight d\\'ruther chaw.\\'1904,  O. Henry,  Cabbages and Kings[2]:\"Yas, yas!\" they cried, with broader grins and many nods.1913,  Horace Annesley Vachell,  Bunch Grass[3]:It\\'s nice, yas, and it\\'s paid for.Nonstandard spelling of yous.", "yammered": "simple past tense and past participle of yammer", "yowe": " (plural yowes)(archaic, dialect, Britain, Scotland) A ewe; a female sheep.1902, James Thomson, Recollections of a Speyside parishThe ram was marked wi\\' keel at the reet o\\' the tail an\\' the yowes upon their hips.Obsolete form of you.1440, Letter, 1841, Joseph Stevenson (editor), The Correspondence, Inventories, Account Rolls, and Law Proceedings of the Priory of Coldingham, page 116,Wirshipfull sir, I commend me to yowe; thankyng yowe of all tendirnesse and labour of lang time shewid to my brether and our cell of Coldyngham, prayand yowe of yowr goode continuance.", "ypsiliform": "In the shape of the letter ypsilon.2003, Andreas Aigner, Josef Stini, Hans Mortensen, Annals of geomorphology (page 351)The Baxter Hills, near Iron Knob, on northeastern Eyre Peninsula, South Australia, is an isolated ypsiliform fold mountain range developed on a north-pitching syncline []", "yourn": "(obsolete outside Britain and US  dialects, especially Appalachia) Yours.1914,  Edgar Rice Burrows,  The Mucker[1], HTML edition, The Gutenberg Project, published 2009:Your room\\'s in there, back of the office, an\\' you\\'ll find some clothes there that the last man forgot to take with him. You ken have \\'em, an\\' from the looks o\\' yourn you need \\'em.", "yods": "plural of yod", "yest": " (plural yests)Obsolete spelling of yeast", "yachty": " (plural yachties)(informal) A yachtsman or yachtswoman. (comparative yachtier, superlative yachtiest)Of or relating to yachts.", "yarmulke": " (plural yarmulkes)A skullcap worn by religious Jewish males (especially during prayer).2007, Patricia Cohen, \"The Frozen Dozen\", New York Times, April 29,But once Dr. Levenson, who works for the Indian Health Service and wears a colorful tapestry yarmulke, has alerted the tiny network, it almost seems as if we have stepped into Yiddishland.", "yolks": "plural of yolk", "youthful": " (comparative more youthful, superlative most youthful)Young or seeming young.a youthful butlerCharacteristic of young people.youthful vivacity", "yappers": "plural of yapper", "yazata": " (plural yazatas)(Zoroastrianism) A divinity.", "yarner": " (plural yarners)One who tells yarns or stories.(rare) A yarn spinner.", "yaffler": " (plural yafflers)(archaic) the European green woodpecker, Picus viridis", "yearlings": "plural of yearling", "yukking": "present participle of yuk", "yeoman": " (plural yeomen)(UK) An official providing honorable service in a royal or high noble household, ranking between a squire and a page. Especially, a Yeoman of the Guard, a member of a ceremonial bodyguard to the UK monarch (not to be confused with a Yeoman Warder).(US) A dependable, diligent, or loyal worker or someone who does a great service.(historical) A former class of small freeholders who farm their own land; a commoner of good standing.A subordinate, deputy, aide, or assistant.A Yeoman Warder.A clerk in the US Navy, and US Coast Guard.(nautical) In a vessel of war, the person in charge of the storeroom.A member of the Yeomanry Cavalry, officially chartered in 1794 originating around the 1760s.A member of the Imperial Yeomanry, officially created in 1890s and renamed in 1907.", "yellows": "plural of yellow(archaic) A kind of jaundice found in horses, cattle, and sheep, causing yellowness of the eyes.(archaic) A disease of plants, especially peach trees, in which the leaves turn a yellowish colour.Third-person singular simple present indicative form of yellowThis paper yellows with age and gets brittle.", "yeo": " (plural yeos)(Southwest  England) A stream or ditch(dialect) A ewe", "yupon": " (plural yupons)(now  uncommon) Alternative form of yaupon", "yokozunas": "plural of yokozuna", "yokel": " (plural yokels)(pejorative) An unsophisticated person.A person of rural background.", "yodhs": "plural of yodh", "yattered": "simple past tense and past participle of yatter", "yuans": "plural of yuan", "yuft": " (countable and uncountable, plural yufts)Russia leather1869, Great Britain. Parliament, Accounts and Papers of the House of Commons (page 295)About 250,000 poods of yuft are prepared annually, of which about 150,000 poods are red yuft, manufactured chiefly for foreign markets.", "yogasana": " (plural yogasanas)(yoga) A position or posture (asana).", "yappingly": " (comparative more yappingly, superlative most yappingly)With yapping sounds.", "yards": "plural of yard(nautical, plural only) The totality of the sailing rig.Her yards were bare and cockabill.Third-person singular simple present indicative form of yard", "yapons": "plural of yapon", "yellowroot": " (uncountable)Wikipedia has an article on:yellowrootWikipediaXanthorhiza simplicissima, syn. X. apiifolia, a North American subshrub whose roots were formerly used to produce a yellow dye.", "yammers": "Third-person singular simple present indicative form of yammer", "yogi": " (plural yogis)(yoga) A devotee or adherent of yoga. [from 17th c.]2009, Karen Armstrong, The Case for God, Vintage 2010, p. 30:To this day, yogins find that these disciplines, which have measurable physical and neurological effects, evoke a sense of calm, harmony and equanimity that is comparable to the effect of music.2012, Lisa Allardice, The Guardian, 30 Mar 2012:There is a special healthy menu, and the yogis can all eat together if they choose, but there\\'s none of the birdseed-and-bulgur-wheat diet of a typical retreat.Gurdjieff connects this type of breathing with yogi breathing.It\\'s a yogi trick of some sort.", "yoked": " (not comparable)Wearing a yoke.The yoked oxen stood ready.(bodybuilding) Having large and well-defined muscles.By the end of his fourth year of weight-lifting, Lee was yoked.(slang) Married.They got yoked four years ago.simple past tense and past participle of yoke", "yean": " (third-person singular simple present yeans, present participle yeaning, simple past and past participle yeaned)(transitive, archaic, of goats or sheep) To give birth to.", "yippies": "plural of yippie", "yan": "(Northumbria) One.(Cumbria) One in Cumbrian sheep counting rhyme.", "younkers": "plural of younker", "yelm": " (plural yelms)a bundle of straw used for thatch1952: The thatcher then laid the \\'yelms\\', or bunches of drawn straw, on the laths, beginning at the eaves and working up towards the ridge.  L.F. Salzman, Building in England, p. 224. (third-person singular simple present yelms, present participle yelming, simple past and past participle yelmed)to prepare straw for use as thatch1952: The preparation of straw for thatch, which was known as \\'yelming\\', consisted in damping it and \\'drawing\\' it with a thatching-fork, or great comb, so as to get the straws parallel.  L.F. Salzman, Building in England, p. 224.", "yestereve": " (plural yestereves)(archaic) yesterday evening1927,  Edgar Rice Burrows,  The Outlaw of Torn[1], HTML edition, The Gutenberg Project, published 2008:Only yestereve, you wot, one of Lord de Grey\\'s men-at-arms came limping to us with the news of the awful carnage the foul fiend had wrought on his master\\'s household. (not comparable)(during) yesterday evening", "yr": " (plural yrs)Abbreviation of year.Abbreviation of your.(Internet slang, text messaging) Abbreviation of you\\'re.", "yashmacs": "plural of yashmac", "yobbos": "plural of yobbo1992 We\\'re not catering to the yobbos. We\\'d rather have a smaller crowd of nice people that are really into the game than a whole mass of uncouth people - Brian Pronger - The Arena of Masculinity: Sports, Homosexuality, and the Meaning of Sex Page 191", "yelling": "present participle of yell (plural yellings)The act of producing a yell.", "yeowomen": "plural of yeowoman", "yummies": "&#160;pl (plural only)(colloquial) delicious foods", "yawny": " (comparative yawnier, superlative yawniest)Prone to yawning.1848, A Home for All by O.S. FowlerWaking up in the small room, you feel dull, stupid, gloomy, oppressed, yawny, lax, and all unstrung in body and mind....Sounding like a yawn.boring, uninteresting, causing yawns.", "yacking": "present participle of yack", "ya": "Eye dialect spelling of you.Yo homes, smell ya later!2011, Byron Douglas, A Journey Through the Life of an Anti-Social, Xlibris, ISBN, chapter 3, 6465:Lola got a shocked look on her face then said, Ya need to stop actin\\' jealous if ya aint, and ya can\\'t control what I do. Ya aint my daddy and ya aint my man. I\\'ll see ya tomorrah after work if ya want. Just give me a call, ya have my number.(informal) Yeah, yes.(informal) Go. (Spoken to horses and cattle.) (not comparable)(Britain  dialectal, Northern England, Scotland) yea; yes1806, Jamieson, Pop. Ballads:\\'Ya, wilt thou!\\' said Wallace, \\'then tak thee that, [...]\\'1894, W. G. Stevenson, Puddin\\' iii.:Ya, auld man, ye ken fine ye wad like me.1896, Ackworth, Clog Shop Chron.:Ya, bur \\'ee did, [...]Eye dialect spelling of your. (plural yas)A letter of the Cyrillic alphabet: , .", "yielding": "present participle of yield (comparative more yielding, superlative most yielding)Docile, or inclined to give way to pressure. (plural yieldings)A concession.", "yod": " (plural yods)Alternative form of yodh1856,  Nesta H. Webster,  Secret Societies And Subversive Movements[1]:In the Rite of Perfection as worked in France and America this Cabalistic influence is shown in those degrees known under the name of the \"Ineffable Degrees,\" derived from the Jewish belief in the mystery that surrounds the Ineflable Name of God. According to the custom of the Jews, the sacred name Jehovah or Jah-ve, composed of the four letters yod, he, vau, he, which formed the Tetragrammaton, was never to be pronounced by the profane, who were obliged to substitute for it the word \"Adonai.\"1882,  Albert G. Mackey,  The Symbolism of Freemasonry[2]:It is really a corruption of, or perhaps rather a substitution for, the Hebrew letter (yod), which is the initial of the ineffable name.(phonetics) A palatal approximant, /j/.1976, Michael L. Mazzola, Proto-Romance and Sicilian, Peter de Ridder Press, ISBN, page 104:A statement of consonantal changes for Sicilian is dependent on the development of two sets of clusters, consonant plus yod and consonant plus /l/.1984, Frederick B. Agard, A Course in Romance Linguistics, volume 2, Georgetown University Press, ISBN, page 75:Wherever in the West (including northern Italia) the fricative allophone [x] of coda /k/ before onsets /t/ and /s/ still remainsit now becomes semivocalized as yod, or more probably voiceless yod.2008, Philippe Sgral &amp; Tobias Scheer, \"Positional Factors in Lenition and Fortition\", in Joaquim Brando de Carvalho et al. (eds.), Lenition and Fortition, Mouton de Gruyter, ISBN, page 152:Word-initial yod, however, does not strengthen in either of the dialects considered, which respond to Polish jabko, jagoda, jeln, jutro (all [j-]) \"apple, berry, deer, tomorrow\" with unaltered initial yod.Eye dialect spelling of yard.1922,  Booth Tarkington,  Gentle Julia[3]:An\\' every blessed minute I stannin\\' there, can\\'t I hear that ole Miz Blatch nex\\' do\\', out in her back yod an\\' her front yod, an\\' plum out in the street, hollerin\\': \\'Kitty?", "yoncopin": " (plural yoncopins)(US, Mississippi, dialect) Nelumbo lutea, the American lotus, the water chinkapin.1910, Margaret Hill McCarter, The Price of the Prairie:[] she was as the wild yoncopin to the calla lily. Marjie knew how to dress. To-day, shaded by the buggy-top, in her dainty light blue lawn, with the soft pink of her cheeks and her clear white brow and throat, she was a most delicious thing []", "yowling": "present participle of yowl (plural yowlings)A sound that yowls.1996, Kenneth Roberts, Rabble in ArmsThey were dancing to the tune of incessant yowlings, the thudding of wooden drums and the monotonous dry rattling of pebbles in turtle-shell rattles.", "yirk": " (third-person singular simple present yirks, present participle yirking, simple past and past participle yirked)Alternative form of yerk (plural yirks)Alternative form of yerk", "yawy": " (comparative more yawy, superlative most yawy)(archaic, medicine) Pertaining to, or afflicted with, the disease yaws.", "yealings": "plural of yealing", "yielder": " (plural yielders)Someone or something that yields a crop or other product.1891, Thomas Hardy, Tess of the dUrbervilles, Phase the Third, Chapter 19,[1]Out of the whole ninety-five [cows] there were eight in particular [] who, though the teats of one or two were as hard as carrots, gave down to her with a readiness that made her work on them a mere touch of the fingers. Knowing, however, the dairymans wish, she endeavoured conscientiously to take the animals just as they came, excepting the very hard yielders which she could not yet manage.1903,  Charles William Burkett et al.,  Agriculture for Beginners[2]:Just as with the Irish potato, it is important to know how good a yielder you are planting.1915,  Australia Department of External Affairs,  Wheat Growing in Australia[3]:This variety is a very heavy yielder, has good drought-resistant qualities, and withstands wind and weather so well that it may be said to be storm-proof.Someone or something that yields, or gives way.c. 1595, William Shakespeare, A Midsummer Nights Dream, Act III, Scene 2,[4]Their sense thus weak, lost with their fears thus strong,Made senseless things begin to do them wrong;For briers and thorns at their apparel snatch;Some sleeves, some hats, from yielders all things catch.1909,  Robert Fitzgerald,  The Statesmen Snowbound[5]:I am a modest man, sir, and hesitate to talk about myself even among friends; but since you all insist, there is nothing for me to do but yield as gracefully as I may--and as a yielder I glitter in the front rank.", "yasht": " (plural yashts)(Zoroastrianism) One of a collection of hymns and prayers.", "ytterbium": " (usually uncountable, plural ytterbiums)A metallic chemical element (symbol Yb) with an atomic number of 70.1883,  H[enry] Carrington Bolton,  List of New Elements Announced since 1877, in  An Account of the Progress in Chemistry in the Year 1882. [...] From the Smithsonian Report for 1882, Washington, D.C.: Government Printing Office, OCLC 39628609, page 6:At a meeting of the Russian Chemical Society held October 20, 1881 (and reported in the Bulletin de la Socit Chimique de Paris, for August, 1882), Mendelejeff [Dmitri Mendeleev], the distinguished author of the periodic law, remarked that only two of the recently announced elementsscandium and ytterbiumhad been satisfactorily confirmed. These have been obtained in a pure state by [Lars Fredrik] Nilson, and neither of them has absorption spectra.1991,  John D. Corbett,  Coproportionation Routes to Reduced Lanthanide Halides, in G[erd] Meyer and L[ester] R. Morss, editor, Synthesis of Lanthanide and Actinide Compounds (Topics in F-element Chemistry; 2), Dordrecht: Kluwer Academic Publishers, ISBN, page 160:The lanthanides samarium, europium and ytterbium possess relatively stable and long-known dispositive states.2006,  Robert E. Krebs,  Guide to the Elements, in  The History and Use of Our Earth\\'s Chemical Elements: A Reference Guide, 2nd edition, Westport, Conn.: Greenwood Press, ISBN, page 301:Ytterbium is a silvery, soft, malleable, and ductile metal with a lustrous metallic shine. It is slightly reactive in air or water at room temperatures. Ytterbium is located next to last of the rare-earths in the lanthanide series.2015,  E. A. Abou Neel; V. Salih; J. C. Knowles,  Phosphate-based Glasses, in Paul Ducheyne, editor, Comprehensive Biomaterials, volume I (Metallic, Ceramic and Polymeric Biomaterials), Amsterdam: Elsevier, ISBN, page 289:Microstructural optical fibers have been developed that have utilized phosphate-based glasses due to their ability to solubilize rare earth components such as ytterbium, which give the fibers their high light absorption and amplification per unit length.A single atom of this element.", "yoop": " (plural yoops)(rare) A sobbing sound.1848, William Makepeace Thackeray, Vanity FairAll the servants were there in the hall  all the dear friends  all the young ladies  the dancing-master who had just arrived; and there was such a scuffling, and hugging, and kissing, and crying, with the hysterical yoops of Miss Swartz []1998, Mignon Good Eberhart, The Mystery of Hunting\\'s End (page 119)And Terice shrieked again and Helene gave a hysterical yoop. \"Stop that!\" ordered O\\'Leary sharply. As Terice, her mouth still open, stared at him and Helene nearly strangled on a sob, he added: \"See here, we are in a rather terrible situation. []", "yahoos": "plural of yahoo", "yodles": "Third-person singular simple present indicative form of yodle", "yonkers": "plural of yonker", "yard": " (plural yards)A small, usually uncultivated area adjoining or (now especially) within the precincts of a house or other building (Wikipedia).1913,  Joseph C. Lincoln,  chapter 1, in  Mr. Pratt\\'s Patients:\\'Twas early June, the new grass was flourishing everywheres, the posies in the yardpeonies and suchin full bloom, the sun was shining, and the water of the bay was blue, with light green streaks where the shoal showed.An enclosed area designated for a specific purpose, e.g. on farms, railways etc.1931,  Francis Beeding,  2/2, in  Death Walks in Eastrepps[1]:A little further on, to the right, was a large garage, where the charabancs stood, half in and half out of the yard.A place where moose or deer herd together in winter for pasture, protection, etc.(Jamaica) Ones house or home. (third-person singular simple present yards, present participle yarding, simple past and past participle yarded)(transitive) To confine to a yard.1893, Elijah Kellogg, Good old times, or, Grandfather\\'s struggles for a homesteadAs they reached the door, Bose, having yarded the cows, was stealing around the corner of the pig-sty, and making for the woods. (plural yards)A unit of length equal to 3 feet in the US customary and British imperial systems of measurement, equal to precisely 0.9144&#160;m since 1959 (US) or 1963 (UK).1913,  Joseph C. Lincoln,  chapter 1, in  Mr. Pratt\\'s Patients:Thinks I to myself, Sol, you\\'re run off your course again. This is a rich man\\'s summer cottage&#160;[]. So I started to back away again into the bushes. But I hadn\\'t backed more\\'n a couple of yards when I see something so amazing that I couldn\\'t help scooching down behind the bayberries and looking at it.Units of similar composition or length in other systems.(nautical) Any spar carried aloft.(nautical) A long tapered timber hung on a mast to which is bent a sail, and may be further qualified as a square, lateen, or lug yard. The first is hung at right angles to the mast, the latter two hang obliquely. (plural yards)(finance) 109, A short scale billion; a long scale thousand millions or milliard.I need to hedge a yard of yen.", "yamuns": "plural of yamun", "yokelish": " (comparative more yokelish, superlative most yokelish)Like a rustic or bumpkin; simple and ignorant.2002, Colin Jones, The Great Nation, Penguin 2003, p. 409:The exclusion of anoblis and the presence of large numbers of country gentry (around a quarter of the delegation as a whole) gave the meetings a very provincial and at time yokelish ethos.", "yarovization": " (uncountable)vernalization", "yeastier": "comparative form of yeasty: more yeasty", "yelpers": "plural of yelper", "yachtmanship": " (uncountable)Synonym of yachtsmanship", "yellowtails": "plural of yellowtail", "yperite": " (countable and uncountable, plural yperites)Synonym of mustard gas2012,  F.W. Holm,  Mobile Alternative Demilitarization Technologies, page 217:In the pre-war years the production of yperite was prepared at 6 plants in Moscow, Chapaevsk, Stalingrad, Dzerzhinsk, Berezniki and Stalinogorsk.", "yeasted": " (not comparable)Treated with yeast; fermented2009 January 24,  Vicky Sanderson,  Healthy cooking, healthy eating, in  Toronto Star[1]:I also made ridiculously delicious yeasted doughnut bits (and covered them with chocolate glaze).simple past tense and past participle of yeast", "yieldance": " (uncountable)(archaic) The act of producing; yield.the yieldance of the earth(archaic) The act of yielding; concession.", "youthsome": " (comparative more youthsome, superlative most youthsome)(archaic) youthful", "yeast": " (countable and uncountable, plural yeasts)An often humid, yellowish froth produced by fermenting malt worts, and used to brew beer, leaven bread, and also used in certain medicines.A single-celled fungus of a wide variety of taxonomic families.1903,  Alfred Peter Carlslund Jrgensen (R. Grey, translator),  Practical Management of Pure Yeast: The Application and Examination of Brewery, Distillery, and Wine, Yeasts, The Brewing trade review, page 17:A microscopical examination of the yeast taken from these rapid vigorous fermentations will only be able to give useful conclusions in one respect.A true yeast or budding yeast in order Saccharomycetales.baker\\'s yeast, Saccharomyces cerevisiaeA compressed cake or dried granules of this substance used for mixing with flour to make bread dough rise. (third-person singular simple present yeasts, present participle yeasting, simple past and past participle yeasted)To ferment.(of something prepared with a yeasted dough) To rise.(African American Vernacular, slang) To exaggerate[1]", "yttrious": " (not comparable)(archaic) yttric; of or pertaining to yttrium", "yulans": "plural of yulan", "yeat": " (plural yeats)(dialectal, Northern England) Alternative spelling of gate, obsolete except in place names.", "yolden": "(obsolete) past participle of yield", "yews": "plural of yew", "yawmeter": " (plural yawmeters)An instrument that measures an aircraft\\'s yaw.", "yelled": "simple past tense and past participle of yell", "yald": " (comparative yalder or more yald, superlative yaldest or most yald)Alternative form of yauld", "yodlers": "plural of yodler", "yeelin": " (plural yeelins)Alternative form of yealing", "yarovize": " (third-person singular simple present yarovizes, present participle yarovizing, simple past and past participle yarovized)vernalize", "yarmulka": " (plural yarmulkas)Alternative spelling of yarmulke", "yowl": " (plural yowls)A prolonged, loud cry, like the sound of an animal; a wail; a howl. (third-person singular simple present yowls, present participle yowling, simple past and past participle yowled)(intransitive) Utter a yowl.(transitive) Express by yowling; utter with a yowl.", "yaqona": " (usually uncountable, plural yaqonas)(Fiji) Alternative form of yagona", "yorkers": "plural of yorker", "yestreen": " (plural yestreens)(chiefly archaic, poetic or Scotland) The night before.1817, Walter Scott, Rob Roy, Chapter ,[1]It was the creature Dougal that extricated me, as he did yestreen []1960, P. G. Wodehouse, Jeeves in the Offing, chapter XI:You have not forgotten our telephone conversation of yestreen, Jeeves?", "yote": " (third-person singular simple present yotes, present participle yoting, simple past and past participle yoted)(Britain  dialectal) To pour water on; pour in.(archaic or dialectal) To steep.My fowls, which well enough / I, as before, found feeding at their trough / Their yoted wheat.  Chapman. (plural yotes)Abbreviation of coyote.", "yawped": "simple past tense and past participle of yawp", "yerb": " (plural yerbs)Eye dialect spelling of herb.1850,  William Cullen Bryant,  Letters of a Traveller[1]:\"At the same time we got a yerb\" (such was his pronunciation) \"on the hills, which some call lion-heart, and others snake-head.\"1895,  Charles Egbert Craddock,  The Phantoms Of The Foot-Bridge[2]:When he ventured to sneeze, Mrs. Roxby compounded and administered a \"yerb tea,\" a sovereign remedy against colds, which he tasted on compulsion and in great doubt, and swallowed with alacrity and confidence, finding its basis the easily recognizable \"toddy.\"1911,  Sir Arthur Thomas Quiller-Couch,  Brother Copas[3]:The ancients, by which I mean the Greeks, set amazin\\' store by the yerb.", "yarned": "simple past tense and past participle of yarn", "yardarm": " (plural yardarms)(nautical) The outer end of a yard, often equipped with blocks for reeving signal halyards.", "yarder": " (plural yarders)(forestry) A motor-driven logging machine which transports logs by means of a system of cables and winches.(in combination) Something that is a stated number of yards in some dimension - such as a ten-yarder.2014, Richard Gibson, \"West Hams Enner Valencia makes mark as points are shared with Hull\", The Guardian, 15 September 2014:His 25-yarder was sandwiched by classy finishes from Hulls debutants Abel Hernndez and Mohamed Diam before a howler from the goalkeeper Allan McGregor resulted in a Curtis Davies own goal.", "yucked": "simple past tense and past participle of yuck", "yataghans": "plural of yataghan", "yowies": "plural of yowie", "yus": "(dialectal) Alternative form of yes.1892, from Punch, or The London Charivari:Yus, to live in dirt, I feel is a `orrid degradation; but one thing I\\'d like to know, is it wus than living on it?1922, Edward J. O\\'Brien and John Cournos, compilers and editors, The Best British Short Stories of 1922:Wych Street? Yus, of course I knoo Wych Street. Used to go there with some of the boys -- when I was Covent Garden way. (plural yuses)Either of two letters, little yus () and big yus (), representing nasal vowel sounds in the Cyrillic alphabet. The only major Slavic language retaining these sounds is Polish, which is written in the Latin alphabet.", "yells": "plural of yellThird-person singular simple present indicative form of yell", "yclad": "(obsolete) past participle of clothe1590,  Edmund Spenser,  The Faerie Queene, London: William Ponsonbie, OCLC 960102938, book II, canto IX:At th\\'upper end there sate, yclad in red / Downe to the ground, a comely personage [] ", "yashmac": " (plural yashmacs)Alternative spelling of yashmak", "yockel": " (plural yockels)(rare, Britain, dialect) The yaffle or green woodpecker, Picus viridis.May 19, 1886,  W.B.,  Shropshire Birds, in  Salopian Shreds and Patches, page 114:Mr. F.C. Birkbeck Terry quoting from the Rev. C. Swainson\\'s Folklore of British Birds gives yockel as the local Salopian name for the green woodpecker.  Can any readers of Salopian Shreds and Patches give instances of localities for these names?", "yecch": "Alternative spelling of yech (plural yecchs)Alternative spelling of yech", "yenning": "present participle of yen", "yuckiest": "superlative form of yucky: most yucky", "yale": " (plural yales)A mythical beast in European mythology and heraldry, usually portrayed as an antelope- or goat-like four-legged creature with large horns that it can swivel in any direction.", "yeh": "(colloquial, informal) Alternative form of yeah; yes.(dialectal) Eye dialect spelling of you.1997, J.K. Rowling, Harry Potter and the Philosopher\\'s Stone, iv:Budge up, yeh great lump, said the stranger.", "yin": " (uncountable)(philosophy) A principle in Chinese and related East Asian philosophies associated with dark, cool, female, etc. elements of the natural world.The number one, primarily used in Scotland and Ulster", "yaird": " (plural yairds)(Scotland) Obsolete form of yard.1842, The Woodrow Society, Rows History of the Kirk of Scotland, Edinburgh Printing Company, page 434:On Tuesday, by the first break of day, he went over the street to his yaird barefooted and bareheaded, (as David did when he went up Mount Olivet, fleeing out of Jerusalem from his son Absolom,) he locked the yaird doore behinde him, haveing charged them that were in the house with Helen Gardener, the baillies wife, to attend her, sitting quyet besyde hir.1870, Sir Walter Scott, Old Mortality, A. &amp; C. Black, page 425:and in this equipage, with his little phizie (fusee) upon his shoulder, he marches to the church yaird, where the May-pole was sett up, and the solemnitie of that day was to be kept.1998, Leah Leneman, Alienated Affections: The Scottish Experience of Divorce and Separation, 1684-1830, Edinburgh University Press, page 30:A witness, Thomas Storie, said that Dalmahoy, with a young woman Iron coloured of a high stature [i.e. tall] in common habit, called at a neighbours house and asked for a drink of ale and enquired if there was a yaird or any place for him and her to walk in, and that they went to the yaird in question where Storie saw him kissing and Imbraceing the said woman.", "yanggona": " (plural yanggonas)Alternative spelling of yagona", "yttrialite": " (plural yttrialites)(mineralogy) A rare, highly radioactive yttrium thorium sorosilicate mineral with conchoidal fracture.", "yamalkas": "plural of yamalka", "yoga": " (countable and uncountable, plural yogas)Any of several Hindu disciplines aimed at training the consciousness for a state of perfect spiritual insight and tranquillity; especially a system of exercises practiced to promote control of the body and mind. (uncountable)The tree Elaeocarpus joga.Synonyms: yoga tree2002,  Pests of Elaeocarpus joga in Guam, in  Micronesica, volume 34, number 2, page 109:A mealybug, Pseudococcus nr. microadonidum Beardsley (Homoptera: Pseudococcidae) has been found feeding on the foliage of E. joga. This mealybug was sometimes found in the domatia of yoga leaves. It has been recorded on coconut, banana, and pandanus from Kiribati, Pohnpei, and Marshall Islands. This insect is a new record on yoga and for Guam.", "yap": " (plural yaps)The high-pitched bark of a small dog.Informal talk.1939, Philip George Chadwick, The Death Guard, page 59:Had I taken his accusations seriously I might have recommended a change in my under-managership, but I never could translate our jammy products into gas or explosives or even poison. Still yap, at least as concerned Beldite\\'s.1989, H. T. Willetts (translator), Aleksandr Solzhenitsyn (author), August 1914, Farrar, Straus and Giroux, ISBN, page 190:They couldnt rise above their calls for peace. Those who werent defenders of the fatherland were incapable of anything except yap and blather about stopping the war.The mouth, which produces speech.Shut your yap!(Geordie) A badly behaved child, a brat. (third-person singular simple present yaps, present participle yapping, simple past and past participle yapped)(intransitive) Of a small dog, to bark.(intransitive, slang) To talk, especially excessively.Youre always yapping - I wish youd shut up.(slang) To rob or steal from someone.2000,  M.O.P.,  Ante Up:Ante up! Yap that fool!", "yokefellow": " (plural yokefellows)(archaic) A companion; a fellow labourer, a person who works at the same task as another.c. 1605, William Shakespeare, King Lear, Act III, Scene 6,[1]Ill see their trial first. Bring in their evidence.[To Edgar] Thou, robed man of justice, take thy place.[To the Fool] And thou, his yokefellow of equity,Bench by his side.1849, Charlotte Bront, Shirley, Chapter 7,[2] [] If two people like each other, why shouldnt they consent to live together?They tire of each otherthey tire of each other in a month. A yokefellow is not a companion; he or she is a fellow-sufferer.1882, Edward Augustus Freeman, The Reign of William Rufus and the Accession of Henry the First...till new grounds of quarrel had arisen between the two unequal yokefellows who were at last fully coupled together.1922, James Ezra Darby, Jesus, an economic mediator: God\\'s remedy for industrial and international illsBrain and hand, and means and muscle, are true yokefellows in modern industrialism. Without the inventor, there could be no machinery...1999, David E Garland, Reading Matthew: A Literary and Theological Commentary on the First GospelJesus treats his disciples as yokefellows rather than as camels and donkeys to be loaded down (23:4).", "yellowshins": " (plural yellowshins)yellowlegs", "yauld": " (comparative yaulder or more yauld, superlative yauldest or most yauld)(Now  chiefly  dialectal, Scotland) Vigorous; strong; healthy.(Now  chiefly  dialectal, Scotland) Active; sprightly; alert.(Now  chiefly  dialectal, Scotland) Supple; active; athletic; nimble.", "yaguarundi": " (plural yaguarundis)Alternative form of jaguarundi", "yogism": " (uncountable)The practice of yoga.", "yearends": "plural of yearend", "yds": "plural of yd; yards", "yuccas": "plural of yucca", "yode": "(obsolete) simple past tense of go; went.", "yelek": " (plural yeleks)Alternative form of jelick", "yardarms": "plural of yardarm", "yipped": "simple past tense and past participle of yip", "yakalo": " (plural yakalos)A hybrid cross of a yak (Bos grunniens) and an American bison (Bison bison).1924 July 8, Breed Yaks with Bison: New Animal Called Yakalo Good Beef Producer, Ogden Standard-Examiner (Ogden, Utah), page 8 [1]:Yakalos breed true to type, are sturdy and able to forage for themselves, he said.1926 December 23, Yakalos, New Stock Breed, May Solve Meat Problem, Indiana Weekly Messenger (Indiana, Pennsylvania), page 7 [2]:The meat of yakalos is said to be almost identical with beef aside from being finer-grained.1975 November 2, D.K. Woodman, The Case of the Reluctant Tibetan Yak, Mansfield News-Journal (Mansfield, Ohio), page 4C [3]:Instead of beefalo, he would have yakalo.", "yeomanry": " (plural yeomanries)(historical) A class of small freeholders who cultivated their own land.BancroftThe enfranchised yeomanry began to feel an instinct for dominion.A British volunteer cavalry force organized in 1761 for home defense and later incorporated into the Territorial Army.", "yeuk": " (plural yeuks)(Scotland) itch, a prickly feeling (third-person singular simple present yeuks, present participle yeuking, simple past and past participle yeuked)(Scotland) to itch, irritate the skin", "yeshivah": " (plural yeshivahs or yeshivoth)Alternative spelling of yeshiva", "years": "plural of year.1981, May 5 1718-PDT, Jim McGrath, Earliest Usenet use via Google Groups: fa.sf-lovers, said with a smile at an awards ceremony in the Pennsylvania state CapitolIt will be a shorter book and it will not start four million years ago.2013 September-October,  Katie L. Burke,  In the News, in  American Scientist:Oxygen levels on Earth skyrocketed 2.4 billion years ago, when cyanobacteria evolved photosynthesis: the ability to convert water and carbon dioxide into carbohydrates and waste oxygen using solar energy.(colloquial, hyperbolic) A very long time.It took years for the bus to come.", "yeshivahs": "plural of yeshivah", "yautias": "plural of yautia", "yawps": "plural of yawpThird-person singular simple present indicative form of yawp", "yerk": " (third-person singular simple present yerks, present participle yerking, simple past and past participle yerked)(archaic) to stab.circa 1603, William Shakespeare, The Tragedy of Othello, The Moor of Venice:I lack iniquity / Sometimes to do me service: nine or ten times / I had thought to have yerkd him here, under the ribs.To throw or thrust with a sudden, smart movement; to kick or strike suddenly; to jerk.DraytonThey flirt, they yerk, they backward [] fling.ShakespeareTheir wounded steeds [] / Yerk out their armed heels at their dead masters.(obsolete, Scotland) To strike or lash with a whip or stick.(obsolete, Scotland) To rouse or excite.To bind or tie with a jerk. (plural yerks)(archaic) A sudden or quick thrust or motion; a jerk.", "yawey": " (comparative more yawey, superlative most yawey)(archaic, medicine) Alternative form of yawy", "yagi": " (plural yagis)Yagi-Uda antenna", "yapock": " (plural yapocks)Alternative spelling of yapok", "yodels": "plural of yodelThird-person singular simple present indicative form of yodel", "yarwhelp": " (plural yarwhelps)(England, archaic) godwit, a type of bird.", "yealing": " (plural yealings)Someone who is the same age as oneself.1786, Robert Burns, The Brigs of Ayr:O ye, my dear-remember\\'d, ancient yealings,Were ye but here to share my wounded feelings!", "young": " (comparative younger, superlative youngest)In the early part of growth or life; born not long ago.1813,  Jane Austen,  Pride and Prejudice:\"What a charming amusement for young people this is, Mr. Darcy! There is nothing like dancing after all. I consider it as one of the first refinements of polished society.\"1913,  Joseph C. Lincoln,  chapter 1, in  Mr. Pratt\\'s Patients:I stumbled along through the young pines and huckleberry bushes. Pretty soon I struck into a sort of path that, I cal\\'lated, might lead to the road I was hunting for. It twisted and turned, and, the first thing I knew, made a sudden bend around a bunch of bayberry scrub and opened out into a big clear space like a lawn.2013 July 19,  Ian Sample,  Irregular bedtimes may affect children\\'s brains, in  The Guardian Weekly, volume 189, number 6, page 34:Irregular bedtimes may disrupt healthy brain development in young children, according to a study of intelligence and sleeping habits.&#160; &#160;Going to bed at a different time each night affected girls more than boys, but both fared worse on mental tasks than children who had a set bedtime, researchers found.a lamb is a young sheep;&#160; these picture books are for young readersAt an early stage of existence or development; having recently come into existence.the age of space travel is still young; &#160; a young business1722, Daniel Defoe, A Journal of the Plague Year, London: E. Nutt et al., p. 23,[1][] while the Fears of the People were young, they were encreasd strangely by several odd Accidents [](Not) advanced in age; (far towards or) at a specified stage of existence or age.Robertson Nicoll, Tis Forty Years Since, quoted in 1906, T. P.\\'s Weekly, volume 8, page 462:And thou, our Mother, twice two centuries young,Bend with bright shafts of truth thy bow fresh-strung.How young is your dog? &#160; Her grandmother turned 70 years young last month.Junior (of two related people with the same name).1841, The Museum of Foreign Literature, Science, and Art:The young Mr. Chester must be in the wrong, and the old Mr. Chester must be in the right.(of a decade of life) Early.1922, E. Barrington, The Mystery of Stella in The Ladies! A Shining Constellation of Wit and Beauty, Boston: Atlantic Monthly Press, pp. 40-41,[2][] Miss Hessy is as pretty a girl as eye can see, in her young twenties and a bit of a fortune to boot.1965, Muriel Spark, The Mandelbaum Gate, London: Macmillan, Part One, Chapter 1,Ephraim would be in his young thirties.2008, Alice Fisher, Grown-up chic is back as high street goes upmarket, The Guardian, 20 January, 2008,[3][] while this may appeal to older, better-off shoppers, vast numbers, especially those in their teens and young twenties, still want fast, cheap fashion.Youthful; having the look or qualities of a young person.2013 August 3,  Revenge of the nerds, in  The Economist, volume 408, number 8847:Think of banking today and the image is of grey-suited men in towering skyscrapers. Its future, however, is being shaped in converted warehouses and funky offices in San Francisco, New York and London, where bright young things in jeans and T-shirts huddle around laptops, sipping lattes or munching on free food.My grandmother is a very active woman and is quite young for her age.Of or belonging to the early part of life.The cynical world soon shattered my young dreams.(obsolete) Having little experience; inexperienced; unpracticed; ignorant; weak.c. 1599, William Shakespeare, As You Like It, Act I, Scene 1,[4]Come, come, elder brother, you are too young in this. (uncountable)People who are young; young people, collectively; youth.The young of today are well-educated.Young or immature offspring (especially of an animal).The lion caught a gnu to feed its young.The lion\\'s young are curious.(rare, possibly nonstandard) An individual offspring; a single recently born or hatched organism.2010, Mammal Anatomy: An Illustrated Guide, page 21:There is a logic in this behavior: a mother will not come into breeding condition again unless her young is ready to be weaned or has died, so killing a baby may hasten [] (third-person singular simple present youngs, present participle younging, simple past and past participle younged)(informal or demography) To become or seem to become younger.1993,  Jacob S. Siegel,  A Generation of Change, page 5:The aging (or younging) of a population refers to the fact that a population, as a unit of observation, is getting older (or younger).(informal or demography) To cause to appear younger.1984,  US Bureau of the Census,  Current Population Reports[5], page 74:Medicare data was \"younged\" by a month to achieve conformity with the conventional completed ages recorded in the census.(geology) To exhibit younging.1994,  R. Kerrich &amp; D.A. Wyman,  The mesothermal gold-lamprophyre association, in  Mineralogy and Petrology, DOI:10.1007/BF01159725:Shoshonitic magmatism younged southwards in the Superior Province, commensurate with the southwardly diachronous accretion of allochthonous subprovinces.2001 November 23,  Paul Tapponnier et al.,  Oblique Stepwise Rise and Growth of the Tibet Plateau, in  Science[6], volume 294, number 5547, DOI:10.1126/science.105978, pages 1671-1677:The existence of magmatic belts younging northward implies that slabs of Asian mantle subducted one after another under ranges north of the Himalayas.", "yarest": "superlative form of yare: most yare", "yperites": "plural of yperite", "yangs": "plural of yang", "yedding": " (plural yeddings)(obsolete) A song, especially the song of a minstrel.(obsolete or historical) A popular tale or romance, or a song embodying a popular tale or romance.2013, Marcelle Theibaux, The Writings of Medieval Women, 2nd Edition: An Anthology:By the fifteenth century a yedding is glossed as a romance.present participle of yed (plural yeddings)(Britain  dialectal) A burrow; a mole or rabbit hole.", "yerking": "present participle of yerk", "yawed": "simple past tense and past participle of yaw", "yachter": " (plural yachters)A person who sails in yachts.", "yattering": "present participle of yatter (plural yatterings)trivial talk; prattle2002, Laurence-Khantipalo Mills, Noble Friendship: Travels of a Buddhist Monk (page 118)I felt a strong inclination to find a cave or hermitage and retire there from the mad world, hoping no doubt to find some peace from the yatterings of the mind crazy with greed, hatred, and delusion.", "yanking": "present participle of yank", "yearly": " (not comparable)Happening once every year.a yearly incomeChristmas is a yearly celebration. (not comparable)Once a year.Every year. (plural yearlies)Something that is published once a year.", "yuk": "(onomatopoeia) An exuberant laugh. (plural yuks)(slang) Something, such as a joke, that causes such a laugh.1992, Alan S. Blinder in Business Week (issues 3268-3272)The latest yuk from Congress is called the balanced-budget amendment. It could wind up making slumps deeper and recoveries more difficult  and that\\'s no joke. (third-person singular simple present yuks, present participle yukking, simple past and past participle yukked)To laugh exuberantly.", "yank": " (plural yanks)A sudden, vigorous pull (sometimes defined as mass times jerk, or rate of change of force).(slang) A masturbation session.2012, Bonnie Dee, Summer Devon, Serious Play (page 81)He rested his hand on his bare chest, an innocent enough spot, but soon it drifted of its own accord down his stomach to slide beneath the waistband of his briefs. Fine. A quick yank would relieve the sexual tension that simmered in him. (third-person singular simple present yanks, present participle yanking, simple past and past participle yanked)(transitive) To pull something with a quick, strong action.2015, Elizabeth Royte, Vultures Are Revolting. Heres Why We Need to Save Them., National Geographic (December 2015)[1]Now a white-backed rams its head down the wildebeests throat and yanks out an eight-inch length of trachea, ribbed like a vacuum hose.(transitive) To remove from distribution.They yanked the product as soon as they learned it was unsafe. (plural yanks)(often derogatory) A yankee.", "yummy": " (comparative yummier, superlative yummiest)(colloquial, lighthearted, often childish) delicious. (plural yummies)(slang) A yummy mummy.2009, Leah McLaren, The Continuity GirlThe Yummies were the women who, next to the Starlets and Professional Have-It-Alls, Meredith envied most, and therefore half-despised. You could see them at the latte bars, drinking green tea smoothies, hoisting their fat-cheeked offspring from one hip to the other, comparing notes on washable diapers and baby-friendly resorts.", "yogini": " (plural yoginis)a female yogi", "yardman": " (plural yardmen)A worker in a railway yard.(Canada, US) A laborer hired to do outdoor work.", "yo": "(slang) A greeting similar to hi.Yo Paulie! How\\'s it going?(slang) An interjection similar to hey.Yo, check this out!(military slang) Present! Here!Sergeant: Smith? Private Smith: Yo!(African American Vernacular) contraction of you and areYo a fool.(colloquial) Eye dialect spelling of your.Yo sandwich has only bacon in it. Want some ketchup on that?(Baltimore) third-person singular, familiarYo was tuckin\\' in his shirt! (Stotko and Troyer 2007)Abbreviation of year/years a href=\"/wiki", "yecchs": "plural of yecch", "yeshivot": "plural of yeshiva", "yearnfully": " (comparative more yearnfully, superlative most yearnfully)In a yearnful manner.", "yeomanlike": " (comparative more yeomanlike, superlative most yeomanlike)Resembling a yeoman or yeoman\\'s work: brave and stout1995 March 31,  Sarah Bryan Miller,  Despot Measures, in  Chicago Reader[1]:The small orchestra played superbly under Wikman\\'s direction; of special note is David Schrader\\'s yeomanlike service on the harpsichord. (comparative more yeomanlike, superlative most yeomanlike)In the manner of a yeoman; bravely and stoutly1819,  Walter Scott,  chapter 13, in  Ivanhoe[2]:One by one the archers, stepping forward, delivered their shafts yeomanlike and bravely.", "yeldrin": " (plural yeldrins)(archaic, dialect, Britain, Scotland) The yellowhammer.", "yuh": "(chiefly Jamaica) you", "yugas": "plural of yuga", "yeasts": "plural of yeastThird-person singular simple present indicative form of yeast", "yourselves": " (second person, the plural of yourself, the reflexive case of you)You (plural), used as the object of a verb or preposition, referring to the people being spoken to, previously mentioned.You shouldn\\'t blame yourselves.", "yoker": " (plural yokers)One who yokes.1871, Ernst Curtius, William Alfred Packard, The History of Greece (volume 2, page 481)His father Xanthippus (who on the shores of Ionia had obtained the first victory with Attic vessels of war) belonged to the clan of the Buzyg (yokers of oxen), whose duty it was to watch over a sacred figure of Athene, the Palladium, and to perform primitive ceremonies relating to the introduction of agriculture.", "yauped": "simple past tense and past participle of yaup", "yamulka": " (plural yamulkas)Alternative form of yarmulke", "yodled": "simple past tense and past participle of yodle", "yarely": " (comparative more yarely, superlative most yarely)In a yare manner.1606, Antony and Cleopatra, by ShakespeareThe silken tackle / Swell with the touches of those flower-soft hands / That yarely frame the office.", "yachtsman": " (plural yachtsmen)A man who sails a yacht.", "yakker": " (plural yakkers)(slang) One who yaks; a chatterbox or motormouth.(baseball, slang) A curveball or slider.", "yarmelke": " (plural yarmelkes)Alternative spelling of yarmulke", "ys": "plural of y", "yearner": " (plural yearners)someone who yearns", "yakkers": "plural of yakker", "yellowing": "present participle of yellow (plural yellowings)The process of turning yellow.2013, Robert F. Nyvall, Field Crop Diseases Handbook (page 419)Rusty spotting and yellowings occur on the lower basal leaves.", "yestermorning": " (uncountable)Yesterday morning.1897, Robert S. Littell, The living age: Volume 212:Where do the favourites delay? Nay, where is yestermorning\\'s rose?", "yam": " (plural yams)Any climbing vine of the genus Dioscorea in the Eastern and Western hemispheres, usually cultivated.The edible, starchy, tuberous root of that plant, a tropical staple food.(US) A sweet potato; a tuber from the species Ipomoea batatas.(Scotland) Potato.(New Zealand) A oca; a tuber from the species Oxalis tuberosa.(Malaysia, Singapore) Taro. (plural yams)(regional, Cumberland) home", "yarrows": "plural of yarrow", "yammerer": " (plural yammerers)One who complains or whines peevishly or whimperingly.", "yabbers": "Third-person singular simple present indicative form of yabber", "yodh": " (plural yodhs)The tenth letter of many Semitic alphabets/abjads (Phoenician, Aramaic, Hebrew, Syriac, Arabic and others).A tool used to read a torah.", "yawningly": " (comparative more yawningly, superlative most yawningly)In a yawning way; accompanied by yawns.She stumbled downstairs and yawningly prepared breakfast.So as to open wide; gapingly.A chasm opened yawningly before them.", "yawpings": "plural of yawping", "yew": " (countable and uncountable, plural yews)(countable) A species of coniferous tree, Taxus baccata, with dark-green flat needle-like leaves and seeds bearing red arils, native to western, central and southern Europe, northwest Africa, northern Iran and southwest Asia.(countable, by extension) Any tree or shrub of the genus Taxus.Other conifers resembling plants in genus Taxusin family Podocarpaceaein family Cephalotaxaceae (not comparable)Made from the wood of the yew tree.", "yauds": "plural of yaud", "yeas": "plural of yea", "yucca": " (plural yuccas)Any of several evergreen plants of the genus Yucca, having long, pointed, and rigid leaves at the top of a woody stem, and bearing a large panicle of showy white blossoms.[1735,  Philip Miller,  YUCCA, in  The Gardeners Dictionary: Containing the Methods of Cultivating and Improving the Kitchen, Fruit and Flower Garden, as also the Physick Garden, Wilderness, Conservatory, and Vineyard. [...] In Two Volumes, volume II, abridged edition, London: Printed for the author, and sold by C[harles] Rivington, at the Bible and Crown, in St. Paul\\'s Church-Yard, OCLC 508713730:YUCCA; The Indian Yucca; vulg. / The Characters are; / It hath the Appearance of an Aloe, the Leaves ending in a harp Point, but will grow in the Habit of a Tree; [] The Species are; / 1. Yucca; foliis Aloes. C. B. P. The common Yucca. / 2. Yucca; foliis filamentois. Moris. Yucca with Threads growing from the Leaves.]1987,  Rita Buchanan,  Plant Fibers for Spinning and Stuffing, in  A Weaver\\'s Garden, Loveland, Colo.: Interweave Press, ISBN, page 51:Yuccas are large, impressive plants with tough, leathery swordlike leaves and towering stalks of white cupshaped flowers. Although they are most abundant in the arid Southwest and on into Mexico, yuccas also grow in dry sandy spots throughout the East and Midwest. There are about forty species of yuccas. All have fibers in their leaves, and many serve as soap plants also&#160;[].2000,  Margaret Roberts,  Yucca: Yucca gloriosa, in  Edible &amp; Medicinal Flowers, Claremont, Cape Town: The Spearhead Press, New Africa Books, ISBN, page 85:The strange yet appealing yucca is native to the United States, Mexico and the West Indies and is part of the Agavaceae family, many species of which have tough, sword-like leaves.2013,  George Oxford Miller,  Native Plant Profiles, in  Landscaping with Native Plants of Texas, 2nd edition, Minneapolis, Minn.: Voyageur Press, ISBN, page 132:Small, shrubby yuccas give your landscape a characteristic Southwest flavor. Their size adapts them to limited areas, such as patio and pool gardens or corner plantings. The blade-like leaves add variety to a cactus or xeriscape garden. Small yuccas make ideal accent plants, and when they send up their stalk of flowers, they become the center of attention.(now proscribed, obsolete) The yuca (cassava).[1677,  Thomas Holyoke [i.e., Thomas Holyoake],  Jucca, in  A Large Dictionary: In Three Parts: I. The English before the Latin, [...] II. The Latin before the English, [...] III. The Proper Names of Persons, Places, and Other Things Necessary to the Understanding of Historians and Poets. [...], London: Printed by W[illiam] Rawlins, for G[eorge] Sawbridge, W[illiam] Place, T[homas] Basset, T[homas] Dring, J[ohn] Leigh, and J[ohn] Place, OCLC 78213826:Jucca, ive Yucca Peruana. The root whereof the bread Caua, or Cazava is made.]1824,  Francis Hall,  Colombia: Its Present State, in Respect of Climate, Soil, Productions, Population, Government, Commerce, Revenue, Manufactures, Arts, Literature, Manners, Education, and Inducements to Emigration: With an Original Map: And Itineraries, Partly from Spanish Surveys, Partly from Actual Observation, London: Printed for Baldwin, Cradock and Joy, OCLC 6390118, page 69:[A] second kind of bread is made of the root, called Yucca, which is bruised, and the juice, which is poisonous, expressed; it is then spread into broad thin cakes, and dried for use. In this shape it is called cassava, and though much esteemed by the natives, to a European palate (except perhaps a Scotch one) seems harsh, insipid, and little nutritious.1866,  [Thomas] Mayne Reid,  The Cinchona Trees, in  The Forest Exiles; or, The Perils of a Peruvian Family Amid the Wilds of the Amazon, Boston, Mass.: Ticknor and Fields, OCLC 5177479, page 162:There are two kinds of the yucca, or manioc root,the yucca dulce and the yucca amarga,the sweet and bitter. One may be eaten raw without danger. The other, which closely resembles it, if eaten raw, would produce almost instant death, as its juice is one of the deadliest of vegetable poisons.2002,  Jos de Acosta; Walter D. Mignolo; Frances Lpez-Morillas, transl.,  Of Yucca and Cassava, and Potatoes and Chuo and Rice, in Jane E. Mangan, editor, Natural and Moral History of the Indies (Chronicles of the New World Order), Durham, N.C.: Duke University Press, ISBN, book IV, page 200:In some parts of the Indies they use a kind of bread called cassava, which is made from a certain root called yucca. The yucca root is large and thick. It is cut into small pieces and grated and squeezed in a sort of press, and what is left resembles a thin cake that is very long and broad, almost like a shield. Dried, this is the bread that they eat; it has no taste and is perfectly insipid but is wholesome and nourishing.2006,  Maria Fiallos,  The Northeast Corridor, in  Adventure Guide: Honduras &amp; the Bay Islands (Hunter Travel Guides), Edison, N.J.: Hunter Publishing, ISBN, page 85:Cassava is a typical Garfuna food made from yucca, a semi-permanent crop found in tropical and subtropical regions. A basic food crop, yucca grows in poor soil where other crops will not.", "yielded": "simple past tense and past participle of yield", "yeggs": "plural of yegg", "yarmalke": " (plural yarmalkes)Alternative spelling of yarmulke", "yakka": " (uncountable)(Australia) Work.1986, Quadrant, Volume 30, page 42,The demand for work and abortion shows that feminists have been coopted by the wimps, whose ideal is the single mother yoked to tough yakka; for it frees them to drift between bedrooms and bathhouses.1991 July 3,  Michael Barlow,  PURDITORY: Harridans [Harsoc], in  aus.games.roleplay, Usenet[1]:The slaves who do all the yakka could be another species, small and easily bullied. Failing that, enslaved humans will do.2018 October 22,  MPD,  Drivetrain component upgrade, in  aus.bicycle, Usenet[2]:I have seen way too many cheap cranksets go to the pack after a small amount of x-country and minor technical yakka off-road.(Australia) To work.", "yoking": "present participle of yoke (plural yokings)The act or period of something being yoked.1807, The Complete Farmer[] five hours, or five hours and a half, in short days, is considered to be as much as horses are capable of sustaining, and yokings of this duration require no refreshment on the ground.", "younker": " (plural younkers)a young man; a lad, youngster(obsolete) a young gentleman or knight(Can we find and add a quotation of Edmund Spenser to this entry?)(obsolete) a novice; a simpleton; a dupe(Can we find and add a quotation of Shakespeare to this entry?)junker", "yearend": " (plural yearends)The end of a year, especially a financial year.", "yenta": " (plural yentas)A woman who meddles in the business of others; a busybody; a female gossipmonger.Please don\\'t tell your girlfriend what I said; she\\'s a yenta!(Jewish) A matchmaker; a woman who specializes in finding spouses.", "yoky": " (comparative more yoky, superlative most yoky)(rare) pertaining to or consisting of a yoke1857,  Homer,  The Iliads of Homer:Of endless youth allotted them, fell through the yoky sphere, [] (rare) yoked1907,  Christopher Marlowe, F. J. Cox,  The Tragical History of Doctor Faustus:Drawn by the strength of yoky dragons\\' necks, [] ", "yeasting": "present participle of yeast", "yellow": " (comparative yellower, superlative yellowest)Having yellow as its colour.Milton:A sweaty reaper from his tillage brought / First fruits, the green ear and the yellow sheaf.Keble:The line of yellow light dies fast away.1911, J. Milton Hayes, \"The green eye of the little yellow god,\"There\\'s a one-eyed yellow idol / To the north of Kathmandu; / There\\'s a little marble cross below the town; / And a brokenhearted woman / Tends the grave of \\'Mad\\' Carew, / While the yellow god for ever gazes down.1962 (quoting c. 1398 text), Hans Kurath &amp; Sherman M. Kuhn, editors, Middle English Dictionary, Ann Arbor, Mich.: University of Michigan Press, ISBN 978-0-472-01044-8, page 1242:dorr, dr adj. &amp; n. [] Golden or reddish-yellow [] (a. 1398) *Trev. Barth. 59b/a: elou colour [of urine] [] tokene febleness of hete [] dorrey &amp; citrine &amp; lit red tokene mene.(informal) Lacking courage.1951, J.D. Salinger, The Catcher in the Rye, Chapter 13:What you should be is not yellow at all. If you\\'re supposed to sock somebody in the jaw, and you sort of feel like doing it, you should do it.Monty PythonYou yellow bastards! Come back here and take what\\'s coming to you!(publishing, journalism) Characterized by sensationalism, lurid content, and doubtful accuracy.2004, Doreen Carvajal, \"Photo edict muffles gossipy press,\" International Herald Tribune, 4 Oct. (retrieved 29 July 2008),The denizens of the gossipy world of the pink press, purple prose and yellow tabloids are shivering over disputed photographs of Princess Caroline of Monaco.(chiefly derogatory, offensive) Far East Asian (relating to Asian people).(dated, Australia, offensive) Of mixed Aboriginal and Caucasian ancestry1938, Xavier Herbert, Capricornia, Chapter VI, p. 64, [1]\"Eh, Oscaryou hear about your yeller nephew?\".(dated, US) High yellow.1933 September 9, James Thurber, My Life and Hard TimesVI. A Sequence of Servants, in The New Yorker:Charley threw her over for a yellow gal named Nancy: he never forgave Vashti for the vanishing from his life of a menace that had come to mean more to him than Vashti herself.(Britain, politics) Related to the Liberal Democrats.2012 March 2, Andrew Grice, \"Yellow rebels take on Clegg over NHS \\'betrayal\\'\", The Independentyellow constituencies(politics) Related to the Free Democratic Party of Germany.the black-yellow coalition (plural yellows)The colour of gold, butter, or a lemon; the colour obtained by mixing green and red light, or by subtracting blue from white light.1892, Charlotte Perkins Gilman, The Yellow WallpaperIt is the strangest yellow, that wall-paper! It makes me think of all the yellow things I ever sawnot beautiful ones like buttercups, but old foul, bad yellow things.(US) The intermediate light in a set of three traffic lights, the illumination of which indicates that drivers should stop short of the intersection if it is safe to do so.(snooker) One of the colour balls used in snooker, with a value of 2 points.(pocket billiards) One of two groups of object balls, or a ball from that group, as used in the principally British version of pool that makes use of unnumbered balls (the (yellow(s) and red(s)); contrast stripes and solids in the originally American version with numbered balls).(sports) A yellow card.2011 April 15,  Saj Chowdhury,  Norwich 2 - 1 Nott\\'m Forest, in  BBC Sport[2]:Andrew Surman fired in what proved to be a 37th-minute winner before Forest\\'s Paul Konchesky saw red late on. That second yellow for the loan signing came in stoppage time and did not affect the outcome of a game which Norwich dominated. (third-person singular simple present yellows, present participle yellowing, simple past and past participle yellowed)(intransitive) To become yellow or more yellow.1977, Alistair Horne, A Savage War of Peace, New York Review Books 2006, page 47:Then suddenly, with the least warning, the sky yellows and the Chergui blows in from the Sahara, stinging the eyes and choking with its sandy, sticky breath.(transitive) To make (something) yellow or more yellow.", "yttria": " (usually uncountable, plural yttrias)(chemistry) yttrium oxide", "yot": " (plural yots)The letter , an uncommon variant of Jj used in Greek linguistics. (third-person singular simple present yots, present participle yotting, simple past and past participle yotted)(dialectal) To unite closely; fasten; rivet.", "yager": " (plural yagers)(US, obsolete) A heavy, muzzle-loading hunting rifle1857,  Mayne Reid,  The War Trail[1]:There are fourscore of them; and but that each carries a yager rifle in his hand, a knife in his belt, and a Colt\\'s pistol on his thigh, you could not discover the slightest point of resemblance between any two of them.1874,  Mayne Reid,  The Death Shot[2]:Many present identify it as the yager usually carried by Clancy.1879,  William F. Cody,  The Life of Hon. William F. Cody[3]:We were each armed with a Mississippi yager and two Colt\\'s revolvers.A Jger, an elite soldier of the Austrian army1863,  Arthur J. L. (Lieut.-Col.) Fremantle,  Three Months in the Southern States, April-June 1863[4]:Most of the officers were dressed in [] a bluish-grey frock-coat of a colour similar to Austrian yagers.1901,  Maurus Jokai,  Manasseh[5]:A battalion of yagers, the pride of the Austrian army, charged up the fatal hill and succeeded in taking it, after which the rattle of musketry beyond announced that the fight was being continued on the farther side.1926,  John Marshall,  The Life of George Washington, Vol. 3 (of 5)[6]:Three days after this affair, Colonel Richard Butler, with a detachment of infantry, assisted by Major Lee with a part of his cavalry, fell in with a small party of chasseurs and yagers under Captain Donop, which he instantly charged, and, without the loss of a man, killed ten on the spot, and took the officer commanding the chasseur, and eighteen of the yagers, prisoners.", "yanked": "simple past tense and past participle of yank", "yearns": "Third-person singular simple present indicative form of yearn", "yester": " (not comparable)(archaic) Yesterday. (not comparable)(archaic) Last; former; of or pertaining to yesterday. (plural yesters)(archaic) Yesterday.", "yarding": "present participle of yard", "youthfulness": " (usually uncountable, plural youthfulnesses)The vitality characteristic of youth.", "yellowtop": " (plural yellowtops)Any of the genus Flaveria of plants with yellow flowers, related to the sunflower.", "yeuks": "plural of yeukThird-person singular simple present indicative form of yeuk", "youngish": " (not comparable)Somewhat young.In spite of his youngish appearance, he had much experience.1935,  George Goodchild,  chapter 5, in  Death on the Centre Court:By one o\\'clock the place was choc-a-bloc. [] The restaurant was packed, and the promenade between the two main courts and the subsidiary courts was thronged with healthy-looking youngish people, drawn to the Mecca of tennis from all parts of the country.", "yolkiest": "superlative form of yolky: most yolky", "yarran": " (plural yarrans)Acacia omalophylla, a species of acacia tree found commonly in Australia.", "youthened": "simple past tense and past participle of youthen", "yellowhammer": " (plural yellowhammers)A passerine bird, Emberiza citrinella, of western Eurasia, which is mainly yellow in colour.(US) The northern flicker, Colaptes auratus.A native or resident of the American state of Alabama.", "yeggmen": "plural of yeggman", "yearlong": " (not comparable)Lasting one year, or approximately so; of or relating to a timespan of one year.1976,  Jean-Paul Dumont,  Under the rainbow: nature and supernature among the Panare Indians, page 81:Both are congruent with a yearlong periodicity, which is apparently neutralized in the main settlement.2003,  Richard A. Simon; James F. Newman,  Making time to lead: how principals can stay on top of it all, page 3:By saving your entire file of daily and weekly lists, you will create your yearlong list.Which lasts throughout every year; which is not seasonal1957, United States. Congress. House. Committee on Interior and Insular Affairs:Yearlong manning is needed, although at a somewhat reduced level from the peak periods in the fall.2002, Barbara Taylor and P. David Pearson, Teaching reading: effective schools, accomplished teachers, page 37:During interviews, teachers and/or principals in three of the four most effective schools cited a yearlong staff development effort. (not comparable)Per year (mostly used to discuss animal farming)1939,  Hugh Hammond Bennett,  Soil conservation, page 807:The estimate of the number of sheep and cattle now using this range is equivalent to 250000 cattle units yearlong1946,  U.S. Committee on Public Lands and Surveys,  Administration and use of public lands: Parts 5-9:The carrying capacity of this area is 46 cattle yearlong.Throughout every year; not seasonally1979,  Marion Clawson,  The western range livestock industry, page 73:Over much of the Great Plains, water was not available yearlong for units of land as small as the customary ownership units1989,  United States. Congress. House. Committee on Interior and Insular Affairs. Subcommittee on National Parks and Public Lands,  Additions to the national wilderness preservation system, volume 2, page 898:Black bear and mountain goats occur in the area yearlong.", "yt": "(obsolete) Abbreviation of that.The King appear\\'d to be much hurt at this, told me he did not credit what he told him, as he knew yt. you &amp; I had never had any dispute together, &amp; yt. William &amp; you had had some misunderstanding in Germany...", "yowie": " (plural yowies)(Australia, cryptozoology) An unidentified yeti-like animal said to exist in parts of Australia.", "yodle": " (third-person singular simple present yodles, present participle yodling, simple past and past participle yodled)Archaic form of yodel. (plural yodles)Archaic form of yodel.", "yearbooks": "plural of yearbook", "yahoo": " (plural yahoos)(pejorative) A rough, coarse, loud or uncouth person; yokel; lout.(cryptozoology) A humanoid cryptid said to exist in parts of eastern Australia, and also reported in the Bahamas.1835, James Holman, Travels, quoted by Malcolm Smith, Bunyips and Bigfoots (Millennium Books, 1996, ISBN, who notes that the Australian sense almost certainly derives from Gulliver\\'s Travels, despite Holman\\'s reportThe natives are greatly terrrified by the sight of a person in a mask calling him \"devil\" or Yah-hoo, which signifies evil spirit.1985, Michael Raynal, Yahoos in the Bahamas, Cryptozoology, volume 4:An exclamation of joy.A battle cry.", "yens": " (second person plural)(colloquial, chiefly Appalachia, also  western  Pennsylvania and Midwestern US) You, you all; used in referring to a group that includes one\\'s audience.", "yojana": " (plural yojanas)A Vedic unit of distance used in ancient India, believed to be approximately 6 to 15 kilometers (4 to 9 miles).", "yellowfish": " (plural yellowfishes or yellowfish)Any of the genus Labeobarbus of mid-sized ray-finned fish.", "yahooisms": "plural of yahooism", "yieldingness": " (uncountable)Tendency to yield; submissiveness.", "yclept": " (not comparable)(archaic, poetic) Called, named.1645, John Milton, L\\'Allegro, line 13,But come, thou Goddess fair and free/ In heaven yclept Euphrosyne []1749, Henry Fielding, Tom Jones, Folio Society 1973, page 410,those sounds which [] issue from the mouths, and sometimes from the nostrils, of those fair river nymphs, ycleped of old the Naades []1922, James Joyce, Ulysses, Dover Publications (2002), ISBN, page 369,And there came against the place as they stood a young learning knight yclept Dixon.1937, Rex Stout, The Red Box, chapter 8,Boyden McNair, with his right elbow on his knee and his bent head resting on the hand which covered his eyes, sat near Wolfe\\'s desk in the dunce\\'s chair, yclept that by me on the day that District Attorney Anderson of Westchester sat in it while Wolfe made a dunce of him.1967, Roy Thomas, Avengers 42, Marvel (1967), page 6,In sooth, I care but little for the glory of closing in combat with the one yclept Dragon Man.1987, Kurt Vonnegut, Bluebeard: The Autobiography of Rabo Karabekian (1916-1988), page 229,The second puzzle was this: why were the vast rectangles between the encircling columns at ground level blank? How could any art patron have left them bare? When I saw them, they were painted the palest rose-orange, not unlike the Sateen Dura-Luxe shade yclept Maui Eventide.2001, Glen David Gold, Carter Beats the Devil, Hyperion (2002), ISBN, page 174,World traveling sorcerer supreme Charles Carter, yclept Carter the Mysterious, has made a startling discovery that makes the news from Europe seem mild indeed.past participle of clepe", "yardland": " (plural yardlands)(historical) Synonym of virgate.", "yechy": " (comparative yechier, superlative yechiest)(informal) Highly offensive; causing aversion or disgust.", "yardage": " (plural yardages)An amount or length measured in yards.The use of a yard, or the fee charged for it.", "yipping": "present participle of yip (plural yippings)A sound that yips.", "yentas": "plural of yenta", "yetts": "plural of yett", "yore": " (uncountable)(poetic) time long pastThis word comes from the days of yore. (not comparable)(obsolete) In time long past; long ago.SpenserWhich though he hath polluted oft and yore, / Yet I to them for judgment just do fly.", "ycleped": "Alternative spelling of yclept: called, named1687,  Aphra Behn,  The Emperor of the Moon, in  The Works of Aphra Behn, Vol. III[1]:Upon a winged Horse, ycleped Pegasus, Swift as the fiery Racers of the Sun,--I fly--I fly--See how I mount, and cut the liquid Sky.1820,  Dawson Turner,  Account of a Tour in Normandy, Vol. I. (of 2)[2]:The event is described in the metrical history of Rouen, composed by a minstrel ycleped Poirier, the limper.1863,  Frances Anne Kemble,  Journal of a Residence on a Georgian Plantation[3]:The damsel, ycleped Louisa, made rather a shame-faced obeisance, and her old grandmother went on to inform me that she had only lately been forgiven by the overseer for an attempt to run away from the plantation.", "yucch": "Alternative spelling of yech", "youngness": " (usually uncountable, plural youngnesses)The state or qualities of being young or youthful; youth.1944, Emily Carr, The House of All Sorts, Puppy Room,[1]The puppy room in the basement brimmed with youngness, with suckings, cuddlings, lickings, squirmingspuppies whose eyes were sealed against seeing, puppies whose ears were sealed against hearing for the first ten days of life []1988, Alan Hollinghurst, The Swimming-Pool Library, Vintage, 1989, Chapter 2,I was eight years older than Arthur, and our affair had started as a crazy fling with all the beauty for me of his youngness and blackness.", "yupons": "plural of yupon", "yapok": " (plural yapoks)The water opossum (Chironectes minimus)", "yips": " (uncountable)(informal) A nervous condition which prevents a sportsman from playing properly; especially a condition which causes a golfer to miss an easy putt, or a tennis player to serve a double fault.2013, William Fotheringham, The Guardian, Monday 13 May 2013:Defining precisely why a professional cyclist might lose his touch on descents is as difficult as explaining a golfer\\'s yips or a striker\\'s sudden inability to find the net. It happens rarely, most famously in the early 1990s; the double world champion Gianni Bugno suffered from it and only rediscovered his \"flow\" after being made to listen to Mozart to calm his nerves.plural of yipThird-person singular simple present indicative form of yip", "yabber": " (third-person singular simple present yabbers, present participle yabbering, simple past and past participle yabbered)(Australia, New Zealand) To talk, jabber.Fair dinkum! Will you stop yabbering at me?", "yttrotantalite": " (usually uncountable, plural yttrotantalites)(mineralogy) A brown or black tantalate of uranium, yttrium, and calcium.", "yum": "Indicating delight at the flavor of food.Yum! This apple pie is delicious! (not comparable)(Australia, New Zealand, Britain, informal) Delicious.This apple pie is yum!Wikipedia has an article on:Yellowdog Updater, ModifiedWikipedia(computing) Yellowdog Updater, Modified, a popular package manager in LinuxPlease run yum in non-caching mode to correct this header.", "yodelled": "(Britain) simple past tense and past participle of yodel", "yogas": "plural of yoga", "yawing": "present participle of yaw", "yana": "(Buddhism) Any of the vehicles of Buddhist or Tantric practice.2013, Chgyam Trungpa, edited by Judith L. Lief, The Bodhisattva Path of Wisdom and Compassion, volume 2, chapter 1The Tibetan word for yana is thekpa, which means \"that which lifts you up.\" Anything that lifts you up and takes you to your destination is a yana.", "yamp": " (uncountable)An umbelliferous plant, Perideridia gairdneri, native to California, whose tubers were used as food by Native Americans.", "yuan": " (plural yuan or yuans)The basic unit of money in China.", "yogee": " (plural yogees)Archaic form of yogi.1871, The Ladies\\' Repository (volume 31, page 265)The Yogee of a subdued mind thus employed in the exercise of his devotions is compared to a lamp, standing in a place without wind, which waveth not.", "yucking": "present participle of yuck", "yabby": " (plural yabbies)(Australia) A freshwater Australian crayfish of the genus Cherax, especially Cherax destructor.1985, Peter Carey, Illywhacker, Faber and Faber 2003, p. 386:Having arrived at night I can speak with some authority on the desolate feeling the road produces: the white fire-scarred trunks, the unsettling vision of yabbies moving from one side of the road to the other.(Australia) A type of ghost shrimp of the infraorder Thalassinidea. (third-person singular simple present yabbies, present participle yabbying, simple past and past participle yabbied)(intransitive) To search for yabbies.", "yate": " (plural yates)Obsolete form of gate.c.1420, Thomas Hoccleve, DialogueSyn he of helthe hath opned me the yate(Can we find and add a quotation of Edmund Spenser to this entry?)", "yawpers": "plural of yawper", "yesternoon": " (plural yesternoons)(archaic) Yesterday at noon.1838, James Gregor Grant, Rufus, Or, The Red King: A Romance, p. 84:I say, that certain of your Grace\\'s liegemen, but yesternoon, beheld him in the forest, backed with armed followers, six archers at the least", "yoghurt": " (countable and uncountable, plural yoghurts)Alternative spelling of yogurt", "yaboo": " (plural yaboos)(archaic) An Afghan pony used as a beast of burden.", "yammering": "present participle of yammer (plural yammerings)Loud, incoherent, repetitive speech.Edgar Rice Burroughs, Lost on VenusNearer and nearer sounded the hurrying footsteps and the incoherent yammerings of the corpses.", "yogist": " (not comparable)Pertaining to yogism.1939, Wilfred Byron Shaw, Quarterly Review: A Journal of University PerspectivesThere he is today, spending eighteen hours a day reciting sacred words, studying, and practicing yogist disciplines; he eats only uncooked seeds. (plural yogists)A practitioner of yoga.", "yee": " (personal pronoun)(archaic and Geordie) you (the people being addressed); Alternative spelling of yeobsolete emphatic of ye1667, John Milton, Paradise Lost Book VSpeak yee who best can tell, ye sons of light,Angels, for yee behold him, and with songsAnd choral symphonies, Day without Night,Circle his Throne, rejoycing, yee in Heav\\'n,On Earth joyn all yee Creatures to extoll.(slang, chiefly Northern California) yes", "yarners": "plural of yarner", "yellowed": " (comparative more yellowed, superlative most yellowed)Having a yellow color (or discoloration), especially when due to age; having been made yellow.simple past tense and past participle of yellow", "yardful": " (plural yardfuls)Enough to fill a yard.1931, September, Muggles, TIME magazineTen cents\\' worth of a certain bird seed, planted in any back yard, will grow into a yardful of marijuana.", "yerd": " (third-person singular simple present yerds, present participle yerding, simple past and past participle yerded)(rare) To beat with a stick", "yokes": "plural of yokeThird-person singular simple present indicative form of yoke", "yodeller": " (plural yodellers)(Britain) Alternative spelling of yodeler", "yuppie": " (plural yuppies)(informal) a young upwardly mobile urban professional person with an affluent lifestyle.", "yurta": " (plural yurtas)Synonym of yurt", "yachtsmen": "plural form of yachtsman", "yairds": "plural of yaird", "yikes": "(humorous, slang) Expression of shock and alarm.Yikes! A monster!\"Then she told me I was \\'beautiful, for a black girl\\'.\" \"Yikes!\"(humorous, slang) Expression of empathy with unpleasant or undesirable circumstances.John has lost his job and can\\'t pay his mortgage; yikes!", "yesses": "plural of yes", "yapp": " (plural yapps)In bookbinding, the edge of the binding that extends beyond the edges of the pages, and may protect the gilding.", "yellowy": " (comparative yellowier, superlative yellowiest)Somewhat yellow; yellowish.1816, John Hamilton Reynolds, The Fairies in The Naiad: a Tale, with Other Poems, London: Taylor &amp; Hessey, p. 62,[1]Let the daisy, yellow-hearted,With its white leaves starry-parted,And the cowslips, yellowy pale,Serve her as a flowery veil1904, Joseph Conrad, Nostromo, Part 1, Chapter Eight,[2][] the worn-out antiquity of Sulaco, so characteristic with its stuccoed houses and barred windows, with the great yellowy-white walls of abandoned convents behind the rows of sombre green cypresses []1977, Breece DJ Pancake, Trilobites in The Stories of Breece DJ Pancake, New York: Holt, Rinehart &amp; Winston, p. 24,[3]I start the truck, drive west along the highway built on the dry bed of the Teays. Theres wide bottoms, and the hills on either side have yellowy billows the sun cant burn off.", "yarl": " (plural yarls)A deep, guttural vocal style with affected pronunciation, characteristic of male grunge and postgrunge singers of the 1990s and early 2000s.2002, Patrick Berkery, \"Record Review\", Creative Loafing (Atlanta), 9 January 2002:So pontificating on how Weathered\\'s earnest morass of block-headed rage, grunge-lite mega-riffs and singer Scott Stapp\\'s machismo yarl amounts to little more than Pearl Jam circa \\'91 for dummies is like shooting fish in a barrel.2008, Michael J. Vaughn, Outro, iUniverse (2008), ISBN, page 10:One of my college kids informed me that the latest acoustic grinder hunk had covered it for a soundtrack  probably with that grungy yarl that everybody ripped off from Eddie Vedder.For more examples of usage of this term, see Citations:yarl. (third-person singular simple present yarls, present participle yarling, simple past and past participle yarled)To sing in this manner.2009, Andrew Matson, \"Is there any reason to listen to the new Alice in Chains album, \"Black Gives Way to Blue\"?\", The Seattle Times, 21 October 2009:On \"All Secrets Known,\" he yarls \"fingers\" into \"fingerrrrrrrraaaaaaughhhhhzzzzzzz.\"For more examples of usage of this term, see Citations:yarl.", "yeared": " (not comparable)(in combination) Of a specified number of years.(poetic) That has lasted many years; a href=\"/wiki", "yellower": "comparative form of yellow: more yellow", "yowler": " (plural yowlers)Someone who, or something which yowls.", "yatagan": " (plural yatagans)Alternative spelling of yataghan", "yerked": "simple past tense and past participle of yerk", "yaup": " (plural yaups)Obsolete spelling of yawp (third-person singular simple present yaups, present participle yauping, simple past and past participle yauped)Obsolete spelling of yawp(Scotland) hungry (third-person singular simple present yaups, present participle yauping, simple past and past participle yauped)(Scotland, intransitive) To be hungry.", "yogees": "plural of yogee", "yttriums": "plural of yttrium", "yearbook": " (plural yearbooks)a reference book, published annually(US, education) A publication compiled by the graduating class of a high school or college, recording the year\\'s events and containing photographs of students and faculty", "younglings": "plural of youngling", "yttrias": "plural of yttria", "yonic": " (comparative more yonic, superlative most yonic)In the shape of a vulva; in the shape of a yoni.1999, Perry Bathous, Clarissa Flanders, Swell-Wimp, page 107:Many orchids are yonic.2011, Manly P. Hall, The Secret Teachings of All Ages, page 226:The Garden of Eden, the Ark, the Gate of the Temple, the Veil of the Mysteries, the vesica piscis or oval nimbus, and the Holy Grail are important yonic symbols []2012, Debora Cordeiro Rosa, Trauma, Memory and Identity in Five Jewish Novels:Porzecanski employs two recurrent phallic and yonic symbols in the narrative.", "yarke": "The saki, Pithecia leucocephala", "yous": "(dialectal, chiefly Australia, New Zealand, South Africa, New York City, New Jersey, Philadelphia, Boston, New England, Northeastern United States, Chicago, Liverpudlian, Cape Breton, Ireland, Scotland) You (plural). [from 19th c.](dialectal) You (singular).1909, PG Wodehouse, The Gem Collector:Dere ain\\'t no use for me dis side, Mr. Chames, he said. New York\\'s de spot. Youse don\\'t want none of me, now you\\'re married.1938, Patrick Kavanagh, The Green Fool:Yous will meet us here outside this pub, Harry Curniskey said.1988, Kathy Lette, Girls\\' Night Out:But what I also seen is that youse have never had a real man before, datin\\' all them boys. Youse have never had anyone who\\'d stand up to youse.1992, Edward Bond, In the Company of Men:You think yous can live wi\\'oot money! Few months doon this hell, you\\'ll murder for money!plural of you1992, Robert Dubin, Central Life Interests: Creative Individualism in a Complex World, page 10:Most of your life after babyhood has been played out by the several yous.2010, Patrick M Morley, The Man in the Mirror: Solving the 24 Problems Men Face, page 36:There are two yous  the visible you and the real you. The visible you is the you that is known by others.", "yes": "A word used to show agreement or acceptance.Yes, you are correct.Yes, you may go play outside now.Yes, sir, we have your package right here.A word used to indicate disagreement or dissent in reply to a negative statement.It was not my fault we lost the race.Oh, yes, it was!!Used to express pleasure, joy, or great excitement.Our second goal of the match! Yes!Antonyms: noResponse that confirms that the user is paying attention. (plural yeses or yesses)An affirmative expression; an answer that shows agreement or acceptance.Was that a yes?Synonyms: aye, yea, nodAntonyms: no, nayA vote of support or in favor/favour of something.The workers voted on whether to strike, and there were thirty \"yeses\" and one \"no\".Synonyms: aye, yeaAntonyms: nay (third-person singular simple present yeses, present participle yessing, simple past and past participle yessed)(colloquial, transitive) to agree with, affirm, approve.Did he yes the veto?1972 Oct,  Barth, John,  Perseid, in  Harper\\'s Magazine, page 79:\"That\\'s really what you wanted?\" I yessed both; ...Synonyms: agree, consent, nod(slang) to attempt to flatter someone by habitually agreeing", "yacks": "plural of yackThird-person singular simple present indicative form of yack", "yarringle": " (plural yarringles)(obsolete) A historic instrument for winding yarn, no longer used.", "yeomanette": " (plural yeomanettes)(dated) A yeowoman.", "yentes": "plural of yente", "yogurt": " (countable and uncountable, plural yogurts)A milk-based product thickened by a bacterium-aided curdling process, and sometimes mixed with fruit or other flavoring.(especially in compounds) Any similar product based on other substances (e.g. soy yogurt).", "yolked": " (not comparable)Having a specified type of yolk.Although it is rare, you may occasionally find a double-yolked egg.", "yellowberry": " (plural yellowberries)The cloudberry.", "yetis": "plural of yeti", "yours": "That which belongs to you (singular); the possessive second-person singular pronoun used without a following noun.If this edit is mine, the other must be yours. Their encyclopedia is good, but yours is even better. Its all yours.That which belongs to you (plural); the possessive second-person plural pronoun used without a following noun.1907,  Robert William Chambers,  chapter IX, in  The Younger Set (Project Gutenberg; EBook #14852), New York, N.Y.: D. Appleton &amp; Company, published 1 February 2005 (Project Gutenberg version), OCLC 24962326:Heavens! exclaimed Nina, the blue-stocking and the fogy!and yours are pale blue, Eileen!youre about as self-conscious as Drinaslumping there with your hair tumbling  la Mrode! Oh, it\\'s very picturesque, of course, but a straight spine and good grooming is better.&#160;[]Written at the end of a letter, before the signature.Yours sincerely, Yours faithfully, Yours, Sincerely yours,", "youthy": " (comparative more youthy, superlative most youthy)(obsolete) young (plural youthies)(Britain, slang) youth centre2004, \"The Grate Denini\", No Persian Punch on BBC (on newsgroup uk.sport.horseracing)I carried a 4x12 cab into the youthy for Thin Lizzy back in 1970 []2009, Mandasue Heller, The Game\\'If he\\'s owt like the lads at the youthy, yeah,\\' Mary told her blithely.", "yamstchik": " (plural yamstchiks)(historical) In 19th-century Russia, someone who delivered post by means of a horse-drawn carriage.", "yarmulkes": "plural of yarmulke", "yea": " (not comparable)(dated) Yes.Bishop Joseph HallYea, have not too many amongst us added to their unreformation an impudence in sinning?Thus, so (now often accompanied by a hand gesture).The pony was yea high.(archaic) Or even, or more like, nay. Introduces a stronger and more appropriate expression than the preceding one.c. 1633, The Flea, by John DonneO stay, three lives in one flea spare,Where we almost, yea, more than married are.(in some dialects of American English, including Southern, Western, and African American Vernacular) Yeah, right, yes.Misspelling of yay.Misspelling of yeah. [1] (plural yeas)An affirmative vote, usually but not always spoken2009,  January 6,  Still Broken After All These Years[2]:Recently senators could fax in their yeas or nays to the committee chairman.", "yessing": "present participle of yes", "yack": " (plural yacks)chatterAlternative form of yak (Can we add an example for this sense?) (third-person singular simple present yacks, present participle yacking, simple past and past participle yacked)(slang) to vomit, usually because of intoxication(colloquial) to talk incessantlyI moved to another carriage on the train because the first one was full of people yacking on mobile phones.", "yarded": "simple past tense and past participle of yard", "yeply": " (comparative more yeply, superlative most yeply)(obsolete) Promptly; quickly; at once.", "yaghourt": " (uncountable)Archaic spelling of yogurt.", "yowls": "plural of yowlThird-person singular simple present indicative form of yowl", "ynambu": " (plural ynambus)A bird of South America, Rhynchotus rufescens, the red-winged tinamou.", "yolkier": "comparative form of yolky: more yolky", "yarwhip": " (plural yarwhips)The bar-tailed godwit, Limosa lapponica", "yawls": "plural of yawl", "yachtswoman": " (plural yachtswomen)A woman who sails a yacht.", "youthfully": " (comparative more youthfully, superlative most youthfully)In a youthful manner.1980, Daisaku Ikeda, Yasushi Inoue, Letters of Four Seasons, Harper &amp; Row, page 76 [1]Nonetheless, it would be wonderful if, in the face of inevitable fate, all people could live youthfully and vitally until the end.", "yarovized": "simple past tense and past participle of yarovize", "yogis": "plural of yogi", "yourself": " (referring to the person being spoken to, previously mentioned, the reflexive case of you)(reflexive) Your own self (singular).Be careful with that fire or you\\'ll burn yourself.You (singular); used emphatically, especially to indicate exclusiveness of the referent\\'s participation in the predicate, i.e., that no one else is involved.You yourself know that what you wrote was wrong.After a good night\\'s sleep you\\'ll feel like yourself again.", "yacare": " (plural yacares)A caiman; a kind of alligator.1859, Cassell\\'s popular natural history (page 24)The yacare is not found farther south than the 32nd degree of south latitude. In its habit completely aquatic; and is never found excepting in the water or on the bank.", "yacht": " (plural yachts)A slick and light ship for making pleasure trips or racing on water, having sails but often motor-powered. At times used as a residence offshore on a dock.Would you like to go sailing on my uncles yacht?You are a true yachtsman! Are you a member of the local yacht club?1898,  Winston Churchill,  chapter 10, in  The Celebrity:The skipper Mr. Cooke had hired at Far Harbor was a God-fearing man with a luke warm interest in his new billet and employer, and had only been prevailed upon to take charge of the yacht after the offer of an emolument equal to half a year\\'s sea pay of an ensign in the navy.Any vessel used for private, noncommercial purposes.1907,  Robert William Chambers,  chapter VI, in  The Younger Set (Project Gutenberg; EBook #14852), New York, N.Y.: D. Appleton &amp; Company, published 1 February 2005 (Project Gutenberg version), OCLC 24962326:I dont mean all of your friendsonly a small proportionwhich, however, connects your circle with that deadly, idle, brainless bunchthe insolent chatterers at the opera,&#160;[], the chlorotic squatters on huge yachts,&#160;[], the neurotic victims of mental cirrhosis, the jewelled animals whose moral code is the code of the barnyard!\" (third-person singular simple present yachts, present participle yachting, simple past and past participle yachted)(intransitive) To sail, voyage, or race in a yacht.", "yrs": "Abbreviation of years; plural of yrAbbreviation of yours (when signing a letter)", "yoke": " (plural yokes)Frame around the neck, and related senses.A bar or frame of wood by which two oxen or other draught animals are joined at the heads or necks enabling them to pull a plough, cart etc. [from 8th c.]Alexander PopeA yearling bullock to thy name shall smoke, / Untamed, unconscious of the galling yoke.(now US) A frame or convex crosspiece from which a bell is hung. [from 10th c.]Any of various linking or supporting objects that resemble a yoke; a crosspiece, a curved bar etc. [from 12th c.]A frame worn on the neck of an animal, such as a cow, pig, or goose, to prevent passage through a fence. [from 16th c.]A pole carried on the neck and shoulders of a person, used for carrying a pair of buckets, etc., one at each end of the pole. [from 17th c.](nautical) A fitting placed across the head of the rudder with a line attached at each end by which a boat may be steered. In modern use it is primarily found in sailing canoes and kayaks. [from 18th c.](electronics) The electromagnetic coil that deflects the electron beam in a cathode ray tube. [from 19th c.]The part of an item of clothing which fits around the shoulders, or the hips, from which the rest of the garment hangs, and which is often distinguished by having a double thickness of material, or decorative flourishes. [from 19th c.]1913, Willa Cather, O Pioneers![...] this city child was dressed in what was then called the \"Kate Greenaway\" manner, and her red cashmere frock, gathered full from the yoke, came almost to the floor.1952, Doris Lessing, Martha Quest, Panther 1974, p. 23:The dresses her mother made looked ugly, even obscene, for her breasts were well grown, and the yokes emphasized them, showing flattened bulges under the tight band of material [].(aviation) Any of various devices with crosspieces used to control an aircraft; now specifically, the control column. [from 20th c.](glassblowing) A Y-shaped stand used to support a blowpipe or punty while reheating in the glory hole.(bodybuilding) Well-developed muscles of the neck and shoulders.2010, Jim Wendler, \"Build an NFL Neck\", Men\\'s Fitness (April), page 73.Nothing says you\\'re a dedicated lifter and true athlete more than a massive yokethat is, the muscles of the neck, traps, and rear delts. (third-person singular simple present yokes, present participle yoking, simple past and past participle yoked)To link or to join.1945 August 17,  George Orwell,  chapter 6, in  Animal Farm: A Fairy Story, London: Secker &amp; Warburg, OCLC 3655473:[] Muriel and Benjamin yoked themselves into an old governess-cart and did their share.To unite, to connect.Bible, 2 Corinthians vi. 14Be ye not unequally yoked with unbelievers.To enslave; to bring into bondage; to restrain; to confine.MiltonThen were they yoked with garrisons.HudibrasThe words and promises that yoke / The conqueror are quickly broke.Misspelling of yolk.", "yaws": " (uncountable)(medicine) A contagious tropical disease, caused by the spirochete Treponema pertenue, characterized by yellowish or reddish tumors, which often resemble currants, strawberries, or raspberries.1997, Roy Porter, The Greatest Benefit to Mankind, Folio Society 2016, p. 16:Other threats came from organisms co-evolving with humans, including tapeworms and such spirochaetes as Treponema, the agent of syphilis, and the similar skin infection, yaws.Third-person singular simple present indicative form of yawplural of yaw", "yanquis": "plural of yanqui", "yojan": " (plural yojans)Alternative form of yojana", "yesterdays": "plural of yesterday.c. 1606,  William Shakespeare,  The Tragedie of Macbeth, in  Mr. William Shakespeares Comedies, Histories, &amp; Tragedies: Published According to the True Originall Copies (First Folio), London: Printed by Isaac Iaggard, and Ed[ward] Blount, published 1623, OCLC 606515358, [Act V, (please specify the scene number in lowercase Roman numerals)]:And all our yesterdays have lighted fools / The way to dusty death.", "youse": "Alternative form of yousAlternative form of you\\'se", "yachted": "simple past tense and past participle of yacht", "yeowoman": " (plural yeowomen)A female yeoman.", "yander": " (not comparable)Eye dialect spelling of yonder.", "yahooism": " (usually uncountable, plural yahooisms)The behaviour or attitudes of yahoos; ignorant boorishness.2007 April 29,  James Traub,  Who Put the Cold in Cold War?, in  New York Times[1]:The yahooism he had always despised was suddenly yoked to an ideology he viewed as reckless.", "yer": "(Britain, slang or dialectal, uncommon) Eye dialect spelling of you.1992, Mary Jane Staples, Sergeant Joe\\'Still, yer got nice looks,\\' said Ella.(Britain, slang or dialectal) Eye dialect spelling of yeah, yes.(Britain, slang or dialectal) Eye dialect spelling of you\\'re, you are.1991, Kathleen Dayus, Where There\\'s Life, London: Virago Press LtdYer a lotta nosey parkers.1997, J.K. Rowling, Harry Potter and the Philosopher\\'s Stone, iv:Ah, go boil yer heads, both of yeh, said Hagrid. Harry  yer a wizard.(Britain or Southern US, slang or dialectal) Eye dialect spelling of your.1991, Thomas Hayden, The Killing Frost, London: Random Century Group\\'Make yer way down to the station,\\' he said.1997, J.K. Rowling, Harry Potter and the Philosopher\\'s Stone, iv:Las time I saw you, you was only a baby, said the giant. Yeh look a lot like yer dad, but yehve got yer mums eyes. (plural yers)Either of the letters  and  in Cyrillic alphabets, which originally represented phonemically the ultra-short vowels in Slavic languages.", "yeuky": " (comparative more yeuky, superlative most yeuky)(Scotland) itchy", "yardmen": "plural of yardman", "yawnily": " (comparative more yawnily, superlative most yawnily)In a yawny manner.", "yelped": "simple past tense and past participle of yelp", "yesty": " (comparative more yesty, superlative most yesty)Obsolete spelling of yeasty (foamy, frothy)", "yoicks": "A hunting cry used to urge hounds after a fox or other quarry.", "yanker": " (plural yankers)Someone who yanks, or gives a sudden hard pull1991,  Lindsley,  The Prospect of Detachment, page 62:He\\'s a yanker of braids, a tousler of bangs [] (Scotland) A brazen lie1822,  James Hogg,  The Three Perils of Man, page 330:\"Ay, billy, that is a yanker&#160;!\" said Tam aside&#160;: \" When ane is gaun to tell a lie, there\\'s naething like telling a plumper at aince, and being done wi\\'tsomeone who pranks someone, who yanks chains, such as with crank callsw:Crank Yankers", "yampee": " (plural yampees)(Jamaica) A variety of yam, Dioscorea trifida, smaller than a regular yam.", "yashmaks": "plural of yashmak", "yellowish": " (not comparable)Somewhat yellow (in colour).", "yechs": "plural of yech", "yellowbill": " (plural yellowbills)Ceuthmochares aereus, an African cuckoo with a heavy yellow bill.", "yesteryears": "plural of yesteryear", "yell": " (third-person singular simple present yells, present participle yelling, simple past and past participle yelled)(intransitive) shout; holler; make a loud sound with the voice.(transitive) to convey by shoutingHe yelled directions to the party from the car. (plural yells)A shout.A phrase to be shouted.1912, The Michigan Alumnus (volume 18, page 152)After the dinner a general reception was held in the spacious parlors of the hotel during which the occasion was very much enlivened with the old college songs and old college yells, which transported us all in mind and feelings [] (not comparable)(Ulster) dry (of cow)", "yawping": "present participle of yawp (plural yawpings)loud or coarse talk", "yees": "(dialectal) you1873,  Various,  Lippincott\\'s Magazine of Popular Literature and Science, Vol. XII. No. 30. September, 1873[1]:\"Oh, Mr. Munro, shure here\\'s a card for yees,\" handing me a lady\\'s card.1911,  Edward S. Ellis,  The Lost Trail[2]:\"Where does yees get the jug?\"1912,  Irene Elliott Benson,  Ethel Hollister\\'s Second Summer as a Campfire Girl[3]:Yere Granddaughter will marry and this house will be too big for the three of yees.", "yawner": " (plural yawners)A person who yawns. (plural yawners)(entertainment, sports, informal) Something unexciting or boring that causes yawns, as a book, sporting event, or performance.1997, Mark Coatney, \"Football: The Big Sleep,\" Time, 21 Oct:The game\\'s over, and the Bills are winners in a 9-6 yawner that saw no touchdowns and sent the nation to bed early.", "yoginis": "plural of yogini", "yern": "(obsolete) Willing, eager, covetous, swift, nimble, earnest.He was yern to go, for nought could he be stayed.ChaucerBut of her song, it was as loud and yern / As any swallow sitting on a bern.(obsolete) eagerly, heartily, gladly, willingly, earnestly.I am not afraid of death, and when my time comes I\\'ll go yern.A Royal Historie of the Excellent Knight GeneridesWho was so hardie and so stern? Tel me now, I pray you yernThe Buke of the Sevyne Sagis (a1500)All the people cried yern God Master, now defend thy bairn.Dunbar (1508)He trowis that oung folk I ern eild.Gavin Douglas (1513)The black swarm (of ants) over the fields walks yern. (third-person singular simple present yerns, present participle yerning, simple past and past participle yerned)Obsolete form of yearn.", "yamen": " (plural yamens)A residence of an official of the Chinese Empire.", "yoghurts": "plural of yoghurt", "yoni": " (plural yonis)The female sexual organs, or a symbol of them, especially as an object of veneration within certain types of Hinduism, Buddhism, and other cultures.2004, Johanna Wikoff, Deborah Romaine, The Complete Idiot\\'s Guide to the Kama Sutra, Alpha Books 2004, p. 242:Stroke your partner\\'s thighs and caress her breasts as you make love to her yoni with your mouth and tongue.2001, David Adams Leeming, A Dictionary of Asian Mythology, Oxford 2001, p. 205:In Hinduism [...] and Tantrism [...], the yoni is the generative organ of the Goddess.1997, David R Kinsley, Tantric Visions of the Divine Feminine, University of California 1997, p. 235:The goddess blesses him by placing his ligam in her yoni.", "yohimbe": " (countable and uncountable, plural yohimbes)An African tree Pausinystalia johimbeThe bark of this tree used as an aphrodisiac", "yeara": " (uncountable)Toxicodendron diversilobum, western poison oak.", "yearth": " (countable and uncountable, plural yearths)Obsolete spelling of earth", "yestern": " (not comparable)(archaic, rare) Of or pertaining to yesterday.1868, John Conington (translator), The Iliad of HomerArgos, I fear, will pay us soon againHer yestern debt []1970,  Trumbull Stickney,  Dramatic Verses[1], Ardent Media, ISBN, page 35:For men born of yesterday are yestern (not comparable)yesterday1949,  Lionel Trilling,  Matthew Arnold[2], Taylor &amp; Francis, ISBN, page 169:\"F. Newman\\'s book I saw yestern at our ouse,\" Arnold writes to Clough. \"He seems to have written himself down an hass. (plural yesterns)yesterday1839,  Johann Christoph Friedrich von Schiller,  Knight Toggenburg, in Montagu Montagu, editor, The Song of the Bell, and other Poems[3], Digitized edition, published 2006, page 85:Yestern was the day of hail, 1840,  Amelia Lane,  The Fortress: An Historical Tale of the Fifteenth Century[4], Digitized edition, published 2012, page 305:Yestern, who was there could compete with me in strength?1977,  Bill Reed,  Dogod[5], Digitized edition, published 2009, ISBN, page 76:For this day ought to promise not so much mulch as yesterday or all the other yesterns all back in a row of boredowndom.2011,  Glenn P. Wolfe,  Mneme\\'s Place: Book One[6]  (fiction), iUniverse, ISBN, page 22:Jestern, was Joyce\\'s yestern.", "yerbas": "plural of yerba", "yills": "plural of yill", "youze": "Alternative spelling of yous2008, Cathi Unsworth, The Singer, page 108:\\'Ach Eddie,\\' he tilted his head to one side, \\'are youze gonna start throwin\\' yer toys outta yer pram now?\\'", "yardsticks": "plural of yardstick", "yip": " (plural yips)a sharp, high-pitched bark1960,  P[elham] G[renville] Wodehouse,  chapter XII, in  Jeeves in the Offing, London: Herbert Jenkins, OCLC 1227855:I\\'ve never hunted myself, but I understand that half the battle is being able to make noises like some jungle animal with dyspepsia, and I believe that Aunt Dahlia in her prime could lift fellow-members of the Quorn and Pytchley out of their saddles with a single yip, though separated from them by two ploughed fields and a spinney. (third-person singular simple present yips, present participle yipping, simple past and past participle yipped)to bark with a sharp, high-pitched voice", "yonder": " (not comparable)(informal, dialect) In a distant, indicated place; over there.Whose home is that yonder?1915, Emerson Hough, The Purchase Price, chapterI:\"A fine man, that Dunwody, yonder,\" commented the young captain, as they parted, and as he turned to his prisoner. \"We\\'ll see him on in Washington some day. He is strengthening his forces now against Mr. Benton out there.&#160;[].\"1826, Mary Shelley, The Last Man, part 2, chapter 2Fire, the Sword, and Plague They may all be found in the yonder city; on my head alone may they fallDistant but within sightYonder peasant - who is he?2006,  Ccile Corbel (lyrics and music),  Siil a ruin, in  Songbook 1[1]  (CD, in English and Irish), Brittany: Keltia Musique, performed by Ccile Corbel:I wish I were on yonder hilland there Id sit and Id cry my fill,and evry tear would turn a mill,And a blessing walk with you, my love (plural yonders)Something that is distant but within sight.Off we go, into the wild blue yonder, riding high into the sky.", "yagis": "plural of yagi", "yelp": " (plural yelps)An abrupt, high-pitched noise or utterance.The puppy let out a yelp when I stepped on her tail.A type of emergency vehicle siren sounding quicker and more intense than the wail. (third-person singular simple present yelps, present participle yelping, simple past and past participle yelped)To utter an abrupt, high-pitched noise.The children yelped with delight as they played in the cold water.", "yocking": "present participle of yock", "youngers": "plural of younger", "youthhood": " (usually uncountable, plural youthhoods)The state of being young, either in age or in spirit; youth.", "yocked": "simple past tense and past participle of yock", "yellowtail": " (not comparable)Having a yellow tail. (plural yellowtails)Yellowtail amberjack (Seriola lalandi).A fish native to the northwest Pacific, often used in sushi, the Japanese amberjack (Seriola quinqueradiata).Any of various fish with yellow tails, including:Atlantic bumper (Chloroscombrus chrysurus).yellowtail flounder (Limanda ferruginea).yellowtail snapper (Ocyurus chrysurus).whitespotted devil (Plectroglyphidodon lacrymatus).yellowtail horse mackerel (Trachurus novaezelandiae).", "youpon": " (plural youpons)Archaic form of yaupon.", "yellowammer": " (plural yellowammers)Archaic spelling of yellowhammer.", "yellowhead": " (plural yellowheads)Wikipedia has an article on:yellowheadWikipediaChaetodon xanthocephalus, the yellowhead butterflyfish.Opistognathus aurifrons, the yellowheaded jawfish.A plant in genus Inula of the daisy family.A plant in genus Trichoptilium, in the daisy family.Zanthoxylum flavum, a plant related to citrus.(informal) A pimple or pustule without a blackhead.2007, Tim Mitchell, Alison Dudley, Acne: The At Your Fingertips Guide (page 5)A pustule is the typical pus spot or yellowhead.A New Zealand bird, Mohoua ochrocephala, the mohua.", "yah": " (not comparable)(Britain, India, South Africa, Australia, New Zealand) Yes.Yah, we did go along but it turned out the wedding was a load of nonsense. (plural yahs)(Britain, informal) An upper-class person, especially a Sloane Ranger.", "yatagans": "plural of yatagan", "yestreens": "plural of yestreen", "yodeler": " (plural yodelers)One who sings so that their voice fluctuates rapidly between their normal chest voice and a falsetto, one who yodels.", "yen": " (plural yen)The unit of Japanese currency (symbol: ) since 1871, divided into 100 sen.1872 February 24,  The Export of Rice, in  The Japan Weekly Mail: A Political, Commercial, and Literary Journal, volume III, number 8, Yokohama:  = Japan Meru Shinbunsha, OCLC 931924335, page 95, column 1:Passing by those clauses of it which demand no notice, we arrive at that which provides that \"each proposal (for purchase) must state the price per picul of rice in gold yen.\" But why in gold yen, a coin as yet so scarce as to be almost beyond the ken of the foreign merchant?1906 March 28,  G[opal] K[rishna] Gokhale,  Budget Speech, 1906, in  Speeches of the Honourable Mr. G. K. Gokhale, C.I.E., Madras: Published by G[anapathi] A[graharam] Natesan &amp; Co., Esplanade, published [1908], OCLC 19902031, pages 171172:Does any one however believe that Japan\\'s glorious achievements would have been possible, if the Government of that country had merely poured money like water on its standing battalions, unaugmented by reserves, and the magnificent spirit of every man, woman and child in that country had not been behind the Army to support it? Japan\\'s ordinary budget for the Army is only about 37.3 millions yen, or a little under six crores of rupees.2011,  Rei Kimura,  chapter 7, in  Japanese Orchid, [Bangkok?]: Bangkok Books, ISBN, page 38:Taking the cue from his neighbours, Paul fed three 1000 yen notes into a machine beside the TV screen and the silent screen immediately exploded into a kaleidoscope of colours and instructions in Japanese below at least twenty pictures of sexy girls. [] Paul hesitated staring intently at the screen and the waiting girl while the 3,000 yen he had fed into the machine steadily dwindled at the rate of 50 yen a minute.A coin or note worth one yen.2003,  Richard Werner,  Preface, in  Princes of the Yen: Japans Central Bankers and the Transformation of the Economy, Armonk, N.Y.: M. E. Sharpe, ISBN:When banks lend, they create money out of nothing, without withdrawing it from other parts of the economy. This way, fiscal policy would not have crowded out private-sector activity yen by yen, as actually happened. (plural yens)A strong desire, urge, or yearning.humankind\\'s yen for knowledge1934, Lew Levenson, chapter XX, in Butterfly Man, New York, N.Y.: Castle Books, OCLC&#160;917633074; republished New York, N.Y.: Castle Books, [1960?], OCLC&#160;6191025, page 208:She repeated the words: \"You for me and me for you,\" then hummed: \"Two for tea and tea for two&#160;\" Her voice trailed off&#160; \"All I got is a yen for Diana and my sweet little cute little Zigzag.\"1999,  Natalie Angier,  Of Hoggamus and Hogwash: Putting Evolutionary Psychology on the Couch, in  Woman: An Intimate Biography, New York, N.Y.: Houghton Mifflin Company, ISBN, page 382:If a fellow chooses to tell himself that his yen for the fetching young intern in his office and his concomitant disgruntlement with his aging wife\\'s housekeeping lacunae make perfect Darwinian sense, who am I to argue with him? (third-person singular simple present yens, present participle yenning, simple past and past participle yenned)(transitive) To have a strong desire for.[1876,  F[rancis] K[ildale] Robinson,  A Glossary of Words Used in the Neighbourhood of Whitby (Series C. Original Glossaries, and Glossaries with Fresh Additions; IV), London: Published for the English Dialect Society by Trbner &amp; Co., 57 &amp; 59, Ludgate Hill, OCLC 24890139, page 227:Yenning, groaning, longing after.]1953,  Alfred Bester,  Who He?, New York, N.Y.: Dial Press, OCLC 1509090, page 205:\"Listen, I\\'m in Tom Bleutcher\\'s suite at The Brompton House. Been here the whole Almighty morning. Olga wants you to have lunch with us.\" / \"Olga? Who\\'s she?\" / \"His daughter. You made a big hit with her last time they was in town. Come on down.\" / \"Get the new writer.\" / \"I got no new writer. Anyway she yens for you. Come on down.\"1992,  Peter Jordan,  Acknowledgements, in  Re-Entry: Making the Transition from Missions to Life at Home, Seattle, Wash.: YWAM Publishing, ISBN:C. S. Lewis warned, \"The yen to publish is spiritually dangerous.\" The \"yen\" in this case is spread around, so perhaps the danger is diminished! This book has been \"yenned\" into existence by many, and is a two-team effort&#160;. (plural yens)Opium.", "yeanling": " (plural yeanlings)The newly born offspring of a goat or sheep.1886, Anna Swanwick (translator), The Dramas of Aeschylus, 4th edition, Eumenides, page 183, lines 903904But in due season here may flocks of worthTwin yeanlings bear;", "yeldrock": " (plural yeldrocks)Alternative form of yeldrin", "yapoks": "plural of yapok", "yodelers": "plural of yodeler", "yogic": " (comparative more yogic, superlative most yogic)Of or pertaining to yoga", "ytterbite": " (uncountable)(obsolete) Gadolinite: a black, vitreous mineral consisting primarily of silicates of various rare earths including ytterbium", "your": "Belonging to you; of you; related to you (singular; one owner).Let\\'s meet tomorrow at your convenience.Is this your cat?Belonging to you; of you; related to you (plural; more owners).A determiner that conveys familiarity and mutual knowledge of the modified noun.Not your average Tom, Dick and Harry.Your Show of ShowsYour World with Neil CavutoNot Your Average Travel GuideGlanvillLike your heroes of antiquity, he charges in iron.(Ireland) That; the specified (usually used with a human referent)Your man just bought a new car.Have you seen what your one over there is doing?Misspelling of you\\'re.", "yellowbird": " (plural yellowbirds)The yellow warblerthe American goldfinch", "yuruk": "A kind of Turkish rug from Konya and Karaman regions.", "yolkiness": " (uncountable)The quality of being yolky.", "yellowwood": " (countable and uncountable, plural yellowwoods)Any of the tree genus Cladrastis.Flindersia xanthoxyla, a tall rainforest tree of Australia.The osage orange tree.Any of the conifer genus Podocarpus.Sarcomelicope simplicifolia, a small rainforest tree of Australia.Zanthoxylum brachyacanthum, thorny yellowwood, of Australia", "yuck": "Uttered to indicate disgust usually toward an objectionable taste or odour.Yuck! This peanut butter is disgusting! (plural yucks)(uncountable) something disgusting2003, The New Yorker, 8 Dec 2003I fetched an orange from a basket and peeled it [] Make sure you peel as much of the yuck off as possible, she said. I hate the yuck.\"(countable) the sound made by a laugh2000, The New Yorker, 13 March 2000Given this insecurity, the creators of The Simpsons took an extraordinary risk: they decided not to use a laugh track. On almost all other sitcoms, dialogue was interrupted repeatedly by crescendos of phony guffaws (or by the electronically enhanced laughter of live audiences), creating the unreal ebb and flow of sitcom conversation, in which a typical characters initial reaction to an ostensibly humorous remark could only be to smile archly or look around while waiting for the yucks to die down. (third-person singular simple present yucks, present participle yucking, simple past and past participle yucked)(obsolete) To itch.(Can we find and add a quotation of Grose to this entry?)", "yids": "plural of yid", "yamens": "plural of yamen", "yeses": "plural of yesThird-person singular simple present indicative form of yes", "youngberry": " (plural youngberries)A hybrid between a blackberry and a dewberry of the rose family, first cultivated in the western United States.", "yocks": "plural of yockThird-person singular simple present indicative form of yock", "yacked": "simple past tense and past participle of yack", "yummiest": "superlative form of yummy: most yummy", "youngsters": "plural of youngster", "youpons": "plural of youpon", "yowley": " (plural yowleys)(dated, Britain, dialect) The European yellowhammer.1863, Edward Corvan, A choice collection of Tyneside songs (page 56)They\\'re just as feerce as untyem\\'d goats, / An\\' all liked sowlgers dress\\'d; / They\\'ve a bunch ov hair upon their jaws / Just like a yowley\\'s nest.", "yarb": " (plural yarbs)(Britain, dialect, archaic) herb1857, Herman Melville, The Confidence-man: His Masquerade (page 165)The medicine is nat\\'ral yarbs, pure yarbs; yarbs must cure me.1906, George Banghart Henry Swayze, Yarb and Cretine (page 60)He was then generally known by the soubriquet of Yarb, or Yarb Man, as he preferred to be hailed, for the reason that he always carried with him a collection of yarrow, tansy, snake root, squaw root, choice buds and barks []1939, Flora Thompson, Lark RiseYarrow, or milleflower, was an exception; everybody still gathered that in large quantities to make \\'yarb beer\\'.", "yearful": " (plural yearfuls)The amount that occurs in a year.1924, H. G. WellsThis is what I have been saying in these eight and twenty volumes of collected works and in this yearful of newspaper articles, and after a rest it is quite possible I shall go on saying it some more.", "yasmak": " (plural yasmaks)Alternative form of yashmak", "younger": "comparative form of young: more youngOur neighbor spent his younger years in England.Reading this book takes me back to my younger days. (plural youngers)(rare) One who is younger than another.1882, L. H. Apaque, A baker\\'s dozen (page 102)Hugh and Charlie also played fairly well, so perhaps it was not wonderful that James, who had always regarded cricket as a childish waste of time, felt rather at a loss, and did not care to display his inferiority to his youngers.", "yule": " (uncountable)Alternative letter-case form of Yule", "yellowware": " (countable and uncountable, plural yellowwares)A type of earthenware made from yellow clay.", "youthening": "present participle of youthen", "yamalka": " (plural yamalkas)Alternative form of yarmulke", "ytterbia": " (uncountable)(inorganic chemistry) Ytterbium oxide.", "yodelling": "(Britain) present participle of yodel", "ye": " (personal pronoun)(archaic outside Northern England, Cornwall, Ireland) You (the people being addressed). (present participle yeyn)(obsolete) Address a single person by the use of the pronoun ye instead of thou.1483, Catholicon Anglicum: An EnglishLatin Wordbook (Monson 168), page 426To e, vosare jn plurali numero vos vestrum vel tibi [perh. read vobis].1511, Promptorium Parvulorum (de Worde), sig. M.iii/2Yeyn or sey ye with worshyp, viso.(archaic, definite) the1647, The old deluder, Satan, Act. (cited in American Public School Law, K. Alexander, M. Alexander, 1995)It being one cheife proiect of ye ould deluder, Satan, to keepe men from the knowledge of Scriptures, as in formr times by keeping ym in an unknowne tongue, so in these lattr times by perswading from ye use of tongues, yt so at least ye true sence &amp; meaning of ye originall might be clouded by false glosses of saint seeming deceivers, yt learning may not be buried in ye church and commonwealth, the Lord assisting or endeavors,Ye Olde Medicine Shoppe.(slang) Yes.", "yarer": "comparative form of yare: more yare", "yippie": " (plural yippies)A member of the Youth International Party, a group of politically active hippies.Alternative form of yippee", "yat": " (plural yats)A vowel letter of the Cyrillic and Glagolitic alphabet (Cyrillic capital , Cyrillic small , Glagolitic ), no longer in current useThe Late Proto-Slavic (Common Slavic) vowel that was represented by this letter, usually transcribed as //. This vowel underwent various alterations in the later Slavic dialects and is no longer distinguished (except in Ijekavian).", "yellowwort": " (uncountable)Blackstonia perfoliata, a gentianaceous plant with bright yellow flowers.", "yare": " (comparative yarer, superlative yarest)(archaic) Ready; prepared.(Britain  dialectal) Ready, alert, prepared, prompt.ShakespeareBe yare in thy preparation.Eager, keen, lively, handy; agile, nimble.(nautical, of a ship) Easily manageable and answering readily to the helm; yar.Sir Walter RaleighThe lesser [ship] will come and go, leave or take, and is yare; whereas the greater is slow.", "yawning": "present participle of yawn (plural yawnings)The action of the verb yawn. (comparative more yawning, superlative most yawning)That yawns or yawn.yawning commuters;&#160; travelers yawning in the queue(figuratively) Wide open.2013 August 3,  The machine of a new soul, in  The Economist, volume 408, number 8847:The yawning gap in neuroscientists understanding of their topic is in the intermediate scale of the brains anatomy. Science has a passable knowledge of how individual nerve cells, known as neurons, work. It also knows which visible lobes and ganglia of the brain do what.a yawning chasm;&#160; the shark\\'s yawning jaws", "ywis": " (not comparable)Obsolete spelling of iwis", "yessed": "simple past tense and past participle of yes", "yaffle": " (plural yaffles)(Britain, dialectal) The European green woodpecker, Picus viridis.1924, Ford Madox Ford, Some Do Not, Penguin 2012 (Parade\\'s End), p. 119:Punched that rotton strap, he goes on saying, like a gret ol\\' yaffle punchin\\' a \\'ollow log!", "yabbering": "present participle of yabber", "yolk": " (countable and uncountable, plural yolks)yolk of an eggThe yellow, spherical part of an egg that is surrounded by the white albumen, and serves as nutriment for the growing young.To make meringue, you have to separate the white from the yolk.The grease in a sheep\\'s fleece.1846, The Cultivator (page 270)Wool-growers appear to entertain different opinions in regard to the effect which yolk has on the value of the fleece. Some seem to suppose that the aggregate amount which they receive for their wool is increased from the greater weight which it possesses by being charged with this substance []", "yeomanly": " (comparative more yeomanly, superlative most yeomanly)Like a yeoman: stout and true.1820, Walter Scott, Ivanhoe, Chapter 40,[1]Say as thou list, Wamba, replied the Knight, these yeomen did thy master Cedric yeomanly service at Torquilstone.1914,  William Morris,  The Sundering Flood[2]:[] it was almost as if he were back at Wethermel, so yeomanly and free seemed all about him.Of or proper to the class of yeomen in British history1884,  Various,  Bay State Monthly, Vol. I, No. 3, March, 1884[3]:Judge Abbott is, therefore, of good yeomanly pedigree.1893,  Thomas De Quincey,  The Posthumous Works of Thomas De Quincey, Vol. II (2 vols)[4]:Her name was Anne Bowden; and she was of a respectable family, that had been long stationary in Devonshire, but of a yeomanly rank [] . (comparative more yeomanly, superlative most yeomanly)Like a yeoman: stoutly and bravely1819,  Walter Scott,  chapter 11, in  Ivanhoe[5]:\"Well and yeomanly done!\" shouted the robbers; \"fair play and Old England for ever!\"1875,  Harriet Beecher Stowe,  Betty\\'s Bright Idea; Deacon Pitkin\\'s Farm; and The First Christmas[6]:[] the men were working yeomanly to build a new nation [] ", "yakked": "simple past tense and past participle of yak", "yachtman": " (plural yachtmen)(dated) A yachtsman.", "yoe": " (plural yoes)(dialect) A ewe; a female sheep.", "yakking": "present participle of yak", "yblent": "(archaic) past participle of blend1748,  Thomson, James,  The Castle of Indolence:Yet all these sounds yblent inclind all to sleep. (comparative more yblent, superlative most yblent)(archaic or poetic) Confused1579,  Spenser, Edmund,  April, in  The Shepheardes Calender, lines 154155:And was thilk same song of Colins owne making? / Ah! foolish Boy! that is with love yblent;c. 1753,  Warton, Thomas,  A Pastoral in the manner of Spenser, in Richard Mant, editor, The Poetical Works of the Late Thomas Waton, B.D.[1], volume 1, University Press, published 1802, lines 912, page 113:She bragly turned her ungentle face, / And all disdaining ey\\'d my shape askaunce: / But I did blush, with grief and shame yblent, / Like morning-rose with hoary dewe besprent.", "yarmelkes": "plural of yarmelke", "yogin": " (plural yogins)Alternative spelling of yogi", "yardang": " (plural yardangs)A large wind-eroded mass of soft or poorly consolidated rock in a desert region which lies parallel to the prevailing winds, often with an unusual shape.", "yeshivoth": "plural of yeshivah", "yuga": " (plural yugas)(religion, Hinduism) In Hindu theology, an epoch or era within a cycle of four ages: the Satya Yuga (or Krita Yuga), the Dvapara Yuga, the Treta Yuga and finally the Kali Yuga, with lengths ranging from 432,000 to 1,728,000 years.1991, Deborah A. Soifer, The Myths of Narasimha and Vamana: Two Avatars in Cosmological Perspective, page 147,To Biardeau the linear nature of the declining dharma and the cyclical nature of the yugas make an unhappy marriage, and she ultimately rejects the idea of a true correspondence or rapport between the appearance of Viu as avatra and the yuga cycle.1998, Sean M. O\\'Shea, Meryl A. Walker, The Millennium Myth: The Ever-Ending Story, page 39,There is, you will note, a pattern of decreased duration in the yugas. Moving from the Krta Yuga, the yuga closest to primordial perfection, each progressive yuga grows shorter and shorter, as chaos and decrepitude increase in prominence.2005, Stephen Knapp, The Heart of Hinduism: The Eastern Path to Freedom, Empowerment and Illumination, page 386,To explain further, there are four ages or millenniums called yugas. The duration of Treta-yuga is 1,296,000 years. The duration of Dvapara-yuga is 864,000 years. The duration of Kali-yuga, the present age, is 432,000 years, and began 5,000 years ago. These four yugas make one cycle, and one thousand cycles equal one day of Brahma, after which there is a partial annihilation of the universe during Brahma\\'s night. Lord Brahma lives for 100 years, 365 days in each year.", "yodling": "present participle of yodle", "yokels": "plural of yokel", "yachts": "plural of yachtThird-person singular simple present indicative form of yacht", "yourt": " (plural yourts)Archaic form of yurt.", "yellowishness": " (uncountable)The property of having a slight or moderate shade of yellow, usually tinged with other colours.", "yid": " (plural yidden or yids)Alternative letter-case form of Yid", "youthless": " (not comparable)Devoid of youth; a href=\"/wiki", "yellowlegs": "plural of yellowleg", "yields": "plural of yieldThe agricultural yields were lower this year.Third-person singular simple present indicative form of yield", "yipes": "Alternative form of yikes2003, Diane Muldrow, Barbara Pollak, Sweet-and-sour summerYipes! she exclaimed suddenly. I forgot to take the ice cream out of the freezer to soften it!1998, Karen Kijewski, Stray Kat WaltzTheir clothes were mostly uninteresting and unflattering. Her eyes lingered on a putrid floral number in fuchsia, hot pink, and turquoise. Yipes.", "yow": " (plural yows)(dialect) A ewe; a female sheep.Expression of pain; ouch.Yow! I dropped it on my toe!Expression of humorous surprise or emphasis.You\\'ve been divorced four times? Yow!", "yogins": "plural of yogin", "youngun": " (plural younguns)Alternative form of young\\'un", "yakitoris": "plural of yakitori", "yellowcake": " (countable and uncountable, plural yellowcakes)A concentrated form of uranium ore containing a mixture of oxides.Synonyms: urania", "yellowseed": " (countable and uncountable, plural yellowseeds)A form of peppergrass or pepperwort (Lepidium campestre)", "yeastily": " (comparative more yeastily, superlative most yeastily)In a yeasty manner.", "yuks": "plural of yuk (uncountable)laughter, amusement1988 July 22,  Lawrence Bommer,  Sybils Playhouse, in  Chicago Reader[1]:For instance, the five improv artists in Sybils Playhouse nearly broke their funny bones trying to dig yuks from the response to Whats making you blue this summer?2010, Danielle Corsetto, Girls With SlingshotsHAZEL: Please tell me that mask is removable.DOCTOR: Oh! Yes, of course  its just for yuks, see!", "yaks": "plural of yak", "yelps": "plural of yelpThird-person singular simple present indicative form of yelp", "yoks": "plural of yok", "yearn": " (third-person singular simple present yearns, present participle yearning, simple past and past participle yearned)(intransitive, construed with for) To long, have a strong desire (for something).All I yearn for is a simple life.(intransitive, construed with for) To long for something in the past with melancholy, nostalgically(intransitive) To be pained or distressed; to grieve; to mourn.ShakespeareFalstaff he is dead, and we must yearn therefore.(transitive) To pain; to grieve; to vex.ShakespeareIt would yearn your heart to see it.ShakespeareIt yearns me not if men my garments wear. (third-person singular simple present yearns, present participle yearning, simple past and past participle yearned)(Scotland) To curdle, as milk. (plural yearns)(nonstandard) yen; yearning1917 August 12, \"A YEARN FOR PEACE; Pan-Germanism Denounced\" Sunday Times (Perth, WA) p.11979 Norman Mailer, The Executioner\\'s SongGibbs now said he wasn\\'t going to pull any punches with Gary when he knew how jealous a man could get, so he also wanted to tell him that Phil Hansen was reputed to have a yearn for attractive ladies.2010 Frank Buchmann-Moller Someone to Watch Over Me: The Life and Music of Ben Webster (University of Michigan Press) ISBN p.57\"After he had made a record date with us in 1935, I always had a yearn for Ben,\" he said years later.2014 February 13, AFP, \"Why internet adultery numbers are soaring\" New Zealand Herald\"My guess, however, is that it has because there are many people who have a yearn for sex outside their relationship but wouldn\\'t have the slightest idea about how to do it or do it safely,\" Prof Schwartz added.", "yoghourt": " (countable and uncountable, plural yoghourts)Alternative spelling of yogurt", "yponomeutid": " (plural yponomeutids)(zoology) Any member of the Yponomeutidae.2000, R. L. Kitching, Food Webs and Container HabitatsThe yponomeutids, in general, feed on leaf tissues, often spinning silken webs over their host plants and skeletonising the leaves beneath.", "yttrofluorite": " (plural yttrofluorites)(mineralogy) A form of fluorite that is rich in yttrium", "yeastiness": " (uncountable)The state or condition of being yeasty.2009 July 19,  Frank Bruni,  Foie Gras Palates, Hot Dog Pocketbooks, in  New York Times[1]:You, no doubt, will come to your own conclusion, based on yeastiness and maybe crumb factor and possibly hole-to-dough ratio.", "yoldring": " (plural yoldrings)(obsolete, dialect) A bird, the yellowhammer.Sir Walter ScottBut you heed me no more than a goss-hawk minds a yellow yoldring.", "yachtmen": "plural of yachtman", "youthly": " (comparative more youthly, superlative most youthly)(archaic) Youthful.1590, Edmund Spenser, The Faerie Queene, I.xi:he hath left his plumes all hoary gray, / And deckt himselfe with feathers youthly gay [...].", "yolky": " (comparative yolkier, superlative yolkiest)Of, pertaining to, or having the characteristics of yolk.2008, Tracey Irene Smart, Reproductive and Larval Biology of the Northeastern Pacific Polychaete Owenia collaris (Family Oweniidae) in Coos Bay, OR (page 8)Eggs can either be very yolky and produce stereoblastulae or have little to no yolk and produce coeloblastulae."}