{"zigzagging": "present participle of zigzagwinding, twisting, turning or sinuousI walked down the zigzagging path. (plural zigzaggings)The movement or layout of something that zigzags.the many zigzaggings of the staircase", "zygapophyses": "plural of zygapophysis", "zanjero": " (plural zanjeros)An official in charge of water supplies in Latin America.", "zonelet": " (plural zonelets)A small zone.", "zetas": "plural of zeta", "zoogeology": " (uncountable)(rare) The study of fossil animal remains.1969,  Peter John Cattermole,  The world of geology, page 6:Today new fields are opening up; in the realms of geophysics, geochemistry and zoogeology great modern advances are being made.", "zigged": "simple past tense and past participle of zig", "zamboorak": " (plural zambooraks)A light swivelling gun, traditionally mounted on, and fired from, the the back of a camel", "zocalo": " (plural zocalos)A town square or marketplace, especially in Mexico.", "zealotical": " (comparative more zealotical, superlative most zealotical)Zealotic.", "zeins": "plural of zein", "ziamet": " (plural ziamets)A form of land tenure in the Ottoman Empire.", "zananas": "plural of zanana", "zoologer": " (plural zoologers)(rare) a zoologist", "zaddick": " (plural zaddicks)Alternative form of tzaddik", "zubr": " (plural zubrs)(obsolete) One of several species of European bison or aurochs, which were unclearly delineated in the 1800s when this sense was in use. [from the 1820s onwards]1829-1831, James Wilson, \"Essays on the Origin and Natural History of the Domestic Animals.\", \"Essay III: On the origin and natural history of the domestic ox, and its allied species\", The Quarterly Journal of Agriculture, Volume II, page 191Herberstein and Martin Cronner assert that the name of Bison is always bestowed on the animal called Zubr or Zumbr by the Poles that the name of Aurochs or Urus is improperly bestowed upon it by the Germans; that these last mentioned names apply solely to the urus or Thur of the Polish nation and they add, that the thur was at that period found only in Massovia, near Warsaw; and they even name the particular villages the inhabitants of which were charged with its conservation. During their days, the thur or wild bull appears to have been kept as a curiosity, as the zubr or modern aurochs is at this day, Anthony Schneebergen designates by the name of Thur a species of wild bull, differing from the domestic breed in few particulars, except its greater size, the uniformly black colour of the males, and the beauty of its coat; its horns were always directed forwards. This last character excludes the identity of the thur and buffalo presumed by Pallas. The forward direction of the horns, the greater size, the similarity of form to that of the domestic bull, all established and described by observers who were at the same time sufficiently familiar with the zubr or modern aurochs, prove it to have been a diiferent animal from that last named.1832, Dr. von Jarocki, translator and abridger unknown, Arcana of Science and Art, Fifth Year, page 228It is not improbable that the Bison mentioned by Seneca and Pliny was the Bonasus of Aristotle, and the Zubr and Auerochs of the moderns, while the Urus of these writers seems to be now extinct as a wild animal, but was perhaps the original of our present domestic cattle.* * Bojanus, however, is of a different opinion.1838-05, W. Weissenborn, \"On the Influence of Man in modifying the Zoological Featurs of the Globe; with Statistical Accounts respecting a few of the more important Species\", The Magazine of Natural History(page 239) The Zubr,* (Pr. Zhubr), Bos urus. * I give the preference to this name of the animal, because it is so called in the country where it now exists, and because many of its other synonyms are subject to controversy.(page 251-252) In addition to what Bojanus alleges, as being favorable to the opinion that the turs of Masovia were a few individuals of the original wild ox, (Bos taurus), which had escaped death or domestication, such as, he says, are still found in a few parks of Scotland and England; or what Jarocki states to prove that the tur was the same animal as the zubr which he thinks was called tur in Muscovia and Samogitia, and zubr in Lithuania, I shall say, in corroboration of the latter opinion, that nearly all that Herberstein knew about the tur from hearsay, is fabulous; (for instance, that it breeds with tame cows, but that the progeny does not come to perfection, \"vituli qui nascuntur non sunt vitales;\" that the turs which have mixed with tame cows, are expelled from their herd, as infamous, &amp;c.) the report which he makes respecting the carcass of a tur, given to him by King Sigismundus Augustus, bears strong evidence of his having received a zubr, which the men who delivered it called tur, whereas he himself allows that he was absent at the time the present was received.1840, James Rennie, The Menageries: Quadrapeds, Volume 3, page 352As an appendix to our history of the bison, it will not be out of place, if we here proceed to give a short sketch of the history of its Old World relative, the little known and almost extinct aurochs or zubr, our information respecting which is derived from a valuable paper by Dr. Weissenborn of Weimar, published in the \\'Magazine of Natural History for May and June 1838.\\'1841, James H. Fennell, A Natural History of British and Foreign Quadrupeds, page 520The Zubr, or European Bison.*(Bison zubris.)* The bonasos, or monapos, described by Aristotle as inhabiting Ponia (the modern province of Bulgaria, in Turkey), and the bison, which Pausanias and Oppian describe as existing in the same locality, appear to be the present species, although no longer found there; and it is, no doubt, the animal called zimbr in Moldavia, about the time of Demetrius Cantemir. It has also been called wisen, wisant, visant, ure, our, auer, auerocks, urochs, and tur; evidently originating in the more classic terms bison, urus, and taurus. There is a third species of bison (Bison Caucasica), inhabiting Mount Caucasus, and probably some districts of India and other parts of Asia.The wisent, the European bison (Bison bonasus).1959-11-19, \"Market in European Bison\", The New Scientist, page 981THE European bison, wisent or zubr (Bison bonasus) seems to be coming back into circulation again, at least among menagerie keepers. The London Zoo has a pair of them...1994, Don McKay, Our Global Village - Poland: A Cultural Resource Guide, Lorenz Educational Press, page 3Near it is Bialowieza, the remainder of the European primeval forest. Bialowieza is home to the zubr, or Polish bison, which is a cousin of the American buffalo. In addition to the zubr, the Polish forests are also home to the wild boar, eagles, falcons, and many other animals.1999, Douglas R. Weiner, A Little Corner of Freedom: Russian Nature Protection from Stalin to Gorbachv, University of California Press, page 65The zubr, or European bison (Bison bonasus bonasus), had been the Russian Empire\\'s largest land mammal, its range limited to two widely separated, and geographically disparate, protected preserves: ...2002-02-10, Alex, \"Bison hair found in Greenland\", sci.archeology, [1]A notriceable[sic] population of \"zubr\" (european[sic] bison) still exists in Poland and Belorus[sic].2003-10-14, Peter H.M. Brooks, \"Aurocks, hares and warthog\", uk.food+drink.misc, [2]The aurocks (Bos Urus or Bos primigenius) existed in Europe until fairly recently - Caesar called them Urus and Charlemagne hunted them. The Lithuanian Zubr (Bos Bison) is sometimes, incorrectly, called an aurock.2004-06-01, Brian M. Scott, \"Re: Plot-noodling! (following on from \"Twisting the Cliche\")\", rec.arts.sf.composition, [3]Aurochs? (Of which the last is thought to have died in Poland in 1627.) Probably not, since they simply were wild, but I haven\\'t found anything else besides the wisent (zubr, European bison).", "zinkenite": " (usually uncountable, plural zinkenites)(mineralogy) A grey mineral with hexagonal crystals, Pb9Sb22S42.", "zwiebacks": "plural of zwieback", "zingaro": " (plural zingaros or zingari)(archaic) a Gypsy1969,  Georges Perec, Gilbert Adair (translator),  A Void:Sporting a woolly cardigan with four buttons on top of an Oxford smock without a collar, our man has a faintly folksy look about him, calling to mind a zingaro or a gypsy, a carny or a Mongol, but also (switching to a wholly distinct mythology and iconography) a hippy strumming his guitar in a barroom in Haight-Ashbury or at Big Sur or in Katmandu.", "zooecial": " (not comparable)Of or pertaining to zooecia; having the character of a zooecium.", "zoospores": "plural of zoospore", "zomotherapy": " (uncountable)(medicine) a regimen of medical treatment that involves prescribing a diet of raw meat in order to fight a disease.", "zenographic": " (comparative more zenographic, superlative most zenographic)(astronomy) Measured with reference to the surface of the planet Jupiter.", "zoothecia": "plural of zoothecium", "zimocca": " (plural zimoccas)The marine sponge Spongia zimocca.1928, Sir James Hopwood Jeans, The physics of the universeWe are shown the fine Turkey-cup or Levantine sponges, the African Zimoccas, the West-Indian grass-sponges and wire-sponges, the great elephants\\' ears from the Philippines, and many more []1948, World Trade in SpongesAll types of Mediterranean sponges are found off the coast of Libya, but zimoccas and honeycombs are more common, especially on the Tripoli grounds.", "zircalloy": " (plural zircalloys)Alternative form of zircaloy", "zoopathy": " (countable and uncountable, plural zoopathies)A delusional condition in which the sufferer believes he/she is infested with animals.", "zoosporous": " (not comparable)Relating to zoospores.", "zoochemical": " (not comparable)Of or pertaining to zoochemistry.", "zoiatria": " (uncountable)(archaic) veterinary medicine", "zarzuelas": "plural of zarzuela", "zymoses": "plural of zymosis", "zoogloeic": " (not comparable)Relating to the zoogloea.", "zymologist": " (plural zymologists)(zymurgy) One who is skilled in zymology, or in the fermentation of liquors.", "zincy": " (comparative more zincy, superlative most zincy)Containing zinc.", "zen": " (uncountable)(religion) A denomination of Buddhism(religion) Profound meditation within that denomination of BuddhismAn approach to an activity, skill, or subject that emphasizes simplicity and intuition rather than conventional thinking or fixation on goalsthe zen of cooking; the zen of passing the bar exam; the zen of C++ (comparative more zen, superlative most zen)(religion) Pertaining to this denomination of Buddhism(colloquial) enlightened, unburdened and free of worries; chill, extremely relaxed and collected", "zygoses": "plural of zygosis", "zechins": "plural of zechin", "zemstvos": "plural of zemstvo", "zincographer": " (plural zincographers)a practitioner of zincography", "zebrule": " (plural zebrules)A cross between a male zebra and a female horse.", "zincographical": " (not comparable)Of or pertaining to zincography.", "zeolite": " (plural zeolites)(mineralogy) Any of several minerals, aluminosilicates of sodium, potassium, calcium or magnesium, that have a porous structure; they are used in water softeners and in ion exchange chromatography.", "zippeite": " (countable and uncountable, plural zippeites)(mineralogy) A hydrous potassium uranium sulfate mineral with chemical formula K4(UO2)6(SO4)3(OH)104(H2O), forming yellow to reddish-brown monoclinic-prismatic crystals with perfect cleavage and formerly used in the manufacture of paint.", "zoocytium": " (plural zoocytia)Alternative form of zocytium", "z": " (lower case, upper case Z, plural z\\'s)The twenty-sixth letter of the English alphabet, called zed or zee and written in the Latin script.", "zircon": " (countable and uncountable, plural zircons)Wikipedia has an article on:zirconWikipedia(uncountable) A mineral occurring in tetragonal crystals, usually of a brown or grey colour and consisting of silica and zirconia.2012 March 1,  Lee A. Groat,  Gemstones, in  American Scientist[1], volume 100, number 2, page 128:Although there are dozens of different types of gems, among the best known and most important are&#160;[]. (Common gem materials not addressed in this article include amber, amethyst, chalcedony, garnet, lazurite, malachite, opals, peridot, rhodonite, spinel, tourmaline, turquoise and zircon.)(countable) A crystal of zircon, sometimes used as a false gemstone.", "zootechnical": " (not comparable)Of or pertaining to zootechny.", "zygophore": " (plural zygophores)(mycology) A specialized hyphal branch giving rise to isogametes that unite to produce a zygospore", "zoobenthos": " (uncountable)(biology) benthic organisms that are animals or zoomorphic protists", "zeroeth": " (not comparable)Alternative spelling of zeroth", "zerda": " (plural zerdas)(archaic) The fennec (Vulpes zerda).", "zestfully": " (comparative more zestfully, superlative most zestfully)With zest or enthusiasm.", "zillion": " (plural zillions)(slang, hyperbolic) An unspecified large number (of).2008, \"Brain tests show child wealth gap\", BBC News, 6 December 2008:\"We are certainly not blaming lower socioeconomic families for not talking to their kids - there are probably a zillion reasons why that happens.\"", "zori": " (plural zori or zoris)Japanese sandals made from rice straw or lacquered wood, worn with a kimono for formal occasions.1983 July, Tony Annesi, Dogu: Tools For the Way, Black Belt, page 70,Zori should be left at the edge of the training area so they can easily be stepped into. In Western dojo, this is sometimes impractical, but zori should at least be put on as soon as possible after leaving the training area.1984, Morgan Yamanaka, Morgan Yamanaka: Tule Lake, John Tateishi (editor), And Justice for All: An Oral History of the Japanese American Detention Camps, page 117,[] and they had a machine gun aimed at us, and we stood in the snow for three, four, five hours in our underwear and zoris.1997, Arthur Golden, Memoirs of a Geisha, 1998, Vintage, p. 25:She took a while getting her crooked feet into her zori, but finally turned toward Mr. Tanaka and gave him a look he seemed to understand at once, because he left the room, closing the door behind him.2008, Roy Inman, The Judo Handbook, page 14,Traditionally, zori are worn to and from the place of practice. Zori are similar to flip-flops and used to be made from straw.(regional, especially Southeast US) A sandal, usually of rubber, secured to the foot by two straps mounted between the big toe and its neighbour, a flip-flop", "zariba": " (plural zaribas)Alternative spelling of zeriba", "zanyism": " (countable and uncountable, plural zanyisms)(archaic) clownishness; buffoonery", "zandmole": "The sand mole or coast rat (Bathyergus suillus)", "zoophagous": " (not comparable)carnivorous", "zack": " (plural zacks)(Australia) Sixpence.2014, Frank E. Burdett, The Purple Tree: The Queensland Outback in the 1860s:\"Strewth, Dad! It\\'s not worth a zack!\" said Barry.(Australia, rare) Five cents.(Australia) A six-month or six-year prison sentence.", "zelkovas": "plural of zelkova", "zaptiahs": "plural of zaptiah", "zincode": " (plural zincodes)(dated) The positive electrode of an electrolytic cell; the anode.", "zoophiles": "plural of zoophile", "zooidal": " (not comparable)Of or pertaining to a zooid.", "zamindari": " (plural zamindaris)(historical) In British India, a system used to collect revenues from the ryots (cultivators of agricultural land) indirectly through the zamindars, as opposed to ryotwari, where revenues were collected directly.(historical) The office or jurisdiction of a zamindar.(historical) The land possessed by a zamindar.", "zoophile": " (plural zoophiles)A person sexually attracted to animals.", "zoomagnetism": " (uncountable)(historical) animal magnetism", "zombi": " (plural zombis)Alternative form of zombie2010, Wade Davis, The Serpent and the Rainbow (page 186)The spirit zombi, or the zombi of the ti bon ange alone, is carefully stored in a jar and may later be magically transmuted into insects, animals, or humans in order to accomplish the particular work of the bokor.", "zincic": " (comparative more zincic, superlative most zincic)(chemistry) Containing, resembling or pertaining to zinc.1877, Henry Augustus Mott, The chemist\\'s manualZincic salts are colorless; part of them are soluble in water, and the rest in acids.", "zoogenic": " (not comparable)originating in, or produced by, animals rather than plants", "zenick": " (plural zenicks)Alternative form of zenik", "zymogenic": " (not comparable)(biology) pertaining to, or formed by, a zymogene(biology) capable of producing a definite zymogen or ferment", "zaninesses": "plural of zaniness", "zebub": " (plural zebubs)(archaic) Synonym of zimb", "zoogenous": " (not comparable)zoogenic", "zeugmatic": " (not comparable)Involving zeugma.", "zero": "(cardinal) The cardinal number occurring before one and that denotes no quantity or amount at all, represented in Arabic numerals as 0.The conductor waited until the passenger count was zero.A cheque for zero dollars and zero cents crashed the computers on division by zero. (countable and uncountable, plural zeroes or zeros)The numeric symbol that represents the cardinal number zero.In unary and k-adic notation in general, zero is the empty string.Write 0.0 to indicate a floating point number rather than the integer zero.The zero sign in American Sign Language is considered rude in some cultures.The digit 0 in the decimal, binary, and all other base numbering systems.One million has six zeroes.(informal, uncountable) Nothing, or none.The shipment was lost, so they had zero in stock.He knows zero about humour.In the end, all of our hard work amounted to zero.The value of a magnitude corresponding to the cardinal number zero.2013 July 6,  The rise of smart beta, in  The Economist, volume 408, number 8843, page 68:Investors face a quandary. Cash offers a return of virtually zero in many developed countries; government-bond yields may have risen in recent weeks but they are still unattractive. Equities have suffered two big bear markets since 2000 and are wobbling again. It is hardly surprising that pension funds, insurers and endowments are searching for new sources of return.The electromagnetic field does not drop all of the way to zero before a reversal.The point on a scale at which numbering or measurement originates.The temperature outside is ten degrees below zero.(mathematics) A value of the independent variables of a function, for which the function is equal to zero.The zeroes of a polynomial are its roots by the fundamental theorem of algebra.The derivative of a continuous, differentiable function that twice crosses the axis must have a zero.The nontrivial zeros of the Riemann zeta function may all lie on the critical line.(mathematics, algebra) The additive identity element of a monoid or greater algebraic structure, particularly a group or ring.Since a commutative zero is the inverse of any additive identity, it must be unique when it exists.The zero (of a ring or field) has the property that the product of the zero with any element yields the zero.The quotient ring over a maximal ideal is a field with a single zero element.(slang) A person of little or no importance.They rudely treated him like a zero.(military) A Mitsubishi A6M Zero, a long range fighter aircraft operated by the Japanese Navy Air Service from 1940 to 1945.A setting of calibrated instruments such as a firearm.(finance) A security which has a zero coupon (paying no periodic interest).The takeovers were financed by issuing zeroes. (not comparable)(informal) no, not anyShe showed zero respect.(meteorology) Of a cloud ceiling, limiting vision to 50 feet (15 meters) or less.(meteorology) Of horizontal visibility, limited to 165 feet (50.3 meters) or less.(linguistics) Present at an abstract level, but not realized in the data.The stem of \"kobieta\" with the zero ending is \"kobiet\". (third-person singular simple present zeroes, present participle zeroing, simple past and past participle zeroed)(transitive) To set a measuring instrument to zero; to calibrate instrument scale to valid zero.Zero the fluorometer with the same solvent used in extraction.(transitive, computing) To change a memory location or range to values of zero; to set a variable in a computer program to zero.Results were inconsistent because an array wasnt zeroed during initialization.(transitive) To cause or set some value or amount to be zero.They tried to zero the budget by the end of the quarter.(transitive) To eliminate; to delete; to overwrite with zeros.2001,  Mark Pesce,  True Magic, in James Frenkel, editor, True Names by Vernor Vinge and the Opening of the Cyberspace Frontier:They discovered the object code for the simulator that was DON, and zeroed it. DON  or his creator  was clever and had planted many copies,2004,  Anna Maxted,  Being Committed, page 358:If I zeroed Jack, I\\'d get by So I\\'d erased him, pretended the last few months had never happened.(intransitive) To disappear1997,  Tom Clancy,  Executive Orders, page 340:Traffic on the encrypted channels used by senior Iraqi generals had peaked and zeroed, then peaked again, and zeroed again.", "zygaenid": " (plural zygaenids)(zoology) Any member of the moth family Zygaenidae.", "zindiq": " (plural zindiqs)(Islam, historical) In medieval times, a person whose views or practices were considered contrary to Islamic dogma; a heretic or unbeliever, or one who practised heretical magic.", "zaire": " (plural zaires)(historical) The unit of currency of Zaire.", "zippiest": "superlative form of zippy: most zippy", "zoeas": "plural of zoea", "zigzaggedly": " (comparative more zigzaggedly, superlative most zigzaggedly)In a zigzagged manner.", "zoning": "present participle of zone (plural zonings)Wikipedia has an article on:zoningWikipedia(law) Legislative action for the purpose of regulating the use of property and the construction of buildings within the area under the jurisdiction of the legislative body concerned.", "zymogene": " (plural zymogenes)(biology) One of a physiological group of globular bacteria which produces fermentations of diverse nature;  distinguished from pathogene.", "zincograph": " (plural zincographs)An engraved zinc plate used in zincography.An engraving made with such a plate.", "zealful": " (comparative more zealful, superlative most zealful)(rare) Full of zeal.", "zibeths": "plural of zibeth", "zeolitic": " (comparative more zeolitic, superlative most zeolitic)Of, pertaining to, containing, or produced using a zeolite.", "zelatrix": " (plural zelatrices or zelatrixes)(ecclesiastical) A nun who oversees the behaviour of young nuns.1871, Jean Lyonnard, Perpetual Intercession to the Agonizing Heart of Jesus, Thomas Richardson and Son, Chapter XVIII, page 171:A intelligent and active zelatrix should be at the head of each circle, or one zelatrix may have several circles under her care.2000, Ruth Burrows, Carmel: Interpreting A Great Tradition ISBN, page 88:But, we still have to ask what benefits Teresa herself perceived in the chapter of faults and other similar corrective measures: the role of the zelatrix or monitor for instance?", "zazens": "plural of zazen", "zookers": "(obsolete) An expression of mild annoyance, surprise etc.1817, Walter Scott, Rob Roy, VIII:Zookers, lass, I never envy these young fellows their rides and scampers, unless when you come across me.", "zootheistic": " (comparative more zootheistic, superlative most zootheistic)Of or pertaining to zootheism.", "zebrawood": " (countable and uncountable, plural zebrawoods)Wikipedia has an article on:zebrawoodWikipediaAny wood with a figure (grain pattern) like the striping of a zebra, most often wood of the genus Microberlinia.", "zoogeny": " (uncountable)(zoology) The doctrine of the formation of living beings.", "zymosterol": " (countable and uncountable, plural zymosterols)Wikipedia has an article on:zymosterolWikipedia(biochemistry) A cholesterol intermediate.", "zarebas": "plural of zareba", "zoozoo": " (plural zoozoos)(obsolete) The wood pigeon.", "zanily": " (comparative more zanily, superlative most zanily)In a zany manner.", "zaffree": " (uncountable)Archaic form of zaffre.", "zax": " (plural zaxes)A tool, similar to a hatchet, used to prepare slate for roofing.", "zygosphene": " (plural zygosphenes)(anatomy) A median process on the front part of the neural arch of the vertebrae of most snakes and some lizards, which fits into a fossa called the zygantrum on the back part of the arch in front.", "zoeal": " (not comparable)Of or pertaining to zoeae.", "zygosporic": " (not comparable)Relating to a zygospore.", "zoographic": " (not comparable)Of or pertaining to zoography.", "zooplastic": "of, or relating to zooplasty", "zoonotic": " (not comparable)Of or relating to zoonosis.2013 May-June,  Katie L. Burke,  In the News, in  American Scientist, volume 101, number 3, page 193:Bats host many high-profile viruses that can infect humans, including severe acute respiratory syndrome and Ebola. A recent study explored the ecological variables that may contribute to bats propensity to harbor such zoonotic diseases by comparing them with another order of common reservoir hosts: rodents.", "zounds": "(chiefly  dated) Expressing anger, surprise, assertion etc.\\'Zounds, a dog, a rat, a mouse, a cat, to scratch a man to death!  Shakespeare, \"Romeo and Juliet\", 1597Bounds, mounds, lounds, founds, kounds, downds, rounds, pounds, zounds!  hounds  ha! hounds  I have it.  R.M. Ballantyne, \"The Floating Light of the Goodwin Sands\", 1870\"Zounds!\" he exclaimed. \"What the dickens is that?\"  J.C. Hutcheson, \"Bob Strong\\'s Holidays\", 1900", "zoogamete": " (plural zoogametes)planogamete", "zoosporangia": "plural of zoosporangium", "zoologically": " (not comparable)In a zoological manner.1901, J. E. S. Moore, The Geographical journal, By Royal Geographical Society (Great Britain), page 6 [1]After returning from my first expedition none of these more northern lakes were zoologically known nor had the other great lakes the Victoria Nyanza and the chains of lakes in the eastern arm of the rift been sufficiently minutely examined to show whether the halolimnic fauna existed in any of them or not.", "zar": " (uncountable)A religious set of beliefs and practices in parts of northern Africa and the Middle East, involving the possession of an individual (usually female) by a type of spirit.", "zanze": " (plural zanzes)Alternative form of zanza (musical instrument)", "zymosans": "plural of zymosan", "zimbabwe": " (plural zimbabwes)Any of the prominent cultural ruins of which Greater Zimbabwe is the most well known.", "zonulet": " (plural zonulets)A zonule", "zealotist": " (plural zealotists)A zealot.", "zigzagger": " (plural zigzaggers)An attachment for a sewing machine allowing for zigzag stitches.1942 The Chemistry leafletJoin the pieces with overlapping seams and finish off by stitching with the zigzagger attachment.1954 Kiplinger\\'s Personal FinanceIf a woman had the finest conventional sewing machine with all the attachments ever made, she could not do one tenth of the work that can be done on a modern zigzagger.Someone who zigzags; a person who makes rapid changes of direction, especially (figuratively) in opinion, policy etc.2005 William Safire - Before the fall: an inside view of the pre-Watergate White HouseThat is what has long worried many people about Nixon: they saw him as the political man, the born trimmer, the zigzagger and flipflopper, the constantly moving target2006 John A. Hall, Ralph Schroeder - An anatomy of power: the social theory of Michael MannAs a self-avowed \\'zigzagger\\' who works back and forth between historical particularities and sociological categories,2017, David Friend, The Naughty Nineties, Twelve Books:In the view of Greenberg and his colleagues, Clinton [] was a zigzagger who tailored his views to suit voters.", "zygose": " (comparative more zygose, superlative most zygose)Of a zygote.Relating to a zygote or to zygosis.", "ziphioid": " (not comparable)Obsolete form of ziphiid. (plural ziphioids)Obsolete form of ziphiid.", "zymes": "plural of zyme", "zebrula": " (plural zebrulas)Alternative form of zebrule", "zonate": " (not comparable)(biology) Having or appearing to have multiple zones, such as of color or texture.(biology) Having different colors, textures, or other patterns form a pattern of rings, bands, or stripes.", "zygal": "shaped like a yoke, or like the letter H", "zugzwang": " (countable and uncountable, plural zugzwangs or zugzwnge)(chess) A situation in which a player is forced to make a disadvantageous move.in figurative uses2002: Carl Friedrich Graumann and Werner Kallmeyer [eds.], Perspective and Perspectivation in Discourse, page 174An explanation for this phenomenon may be that speech acts that include instructions (e.g., a command or request) show a higher level of activity than speech acts of assertion; the ethnomethodological analysis of conversation speaks of conversational Zugzwnge:24 a request, a question or a command demands a reaction of the addressee.", "zenaida": " (plural zenaidas)A zenaida dove.", "zenana": " (plural zenanas)A harem on the Indian subcontinent; a part of the house reserved for high-caste women; a system of segregating women into harems.1888, Rudyard Kipling, The Bisara of Pooree, Plain Tales from the Hills, Folio Society 2005, p. 173:Depend upon it, Solomon would never have built altars to Ashtaroth and all those ladies with queer names, if there had not been trouble of some kind in his zenana, and nowhere else.1993, William Dalrymple, City of Djinns, Penguin 2004, p. 59:Yet inside the walls of the havelis and the lattice screens of the zenana, life goes on as it always did.1997, Kiran Nagarkar, Cuckold, HarperCollins 2013, p. 84:Out of the blue, the chief eunuch of the zenana appears.2008, Amitav Ghosh, Sea of Poppies, Penguin 2015, p. 110:You have more than enough to occupy you, I\\'m sure, with all your palaces and zenanas and budgerows.An effeminate or crossdressing male in northern India or Pakistan. (Also spelled zanna.)1911, A Glossary of the Tribes and Castes of the Punjab and North-West Frontier Province:For some years past the zannas have celebrated the Holi as a carnival. They assume female names, by which they are called in their own circle. Most of them are beardless youth; those who have beards shave them. Nz nakhra (flirtation) becomes their second nature.1999, Neither Man nor Woman: The Hijras of India:In parts of North India, effeminate males who are assumed to play the passive role in homosexual relationships are referred to as zenana, literally meaning woman.", "zinger": " (plural zingers)(informal) A very rapidly moving object, especially one that is thrown.2008,  Joseph Sutton, (Please provide the book title or journal name), ISBN:On the first pitch from Kline, Lofton hits a zinger of a single into right field that J.D. Drew picks up on one bounce, and if he makes a good throw he has a chance to throw David Bell out at home plate.The pitcher threw a real zinger and struck him out.(informal) A surprising or unusually pointed, humorous and impressive insult.2007,  Larry Groves,  Seasons in Time, ISBN, page 112:I wasn\\'t looking to make friends; there had been too much animosity between us in the past, and maybe the guy had a zinger waiting on me.2012,  Adam Fraser,  The Third Space, ISBN, page 124:You might think it\\'s almost worthwhile calling them and restarting the argument just to get that final zinger in. Why do you think of something good to say when it\\'s too late?My little niece let fly with the zinger that my sister was pregnant again.(informal) An event that when experienced leaves the witness dazed, either physically or metaphorically.I was still reeling from the zinger of seeing my ex on a date with my best friend.(informal) An outstanding, energetic and surprising thing or person.2006,  Olivia Hillis Wimbrow,  My Beloved Bohemian, ISBN, page 130:They\\'d have to come up with a zinger for their Christmas windows to compete with that competitor\\'s laughing Santa Claus and Stefan had that zinger in his proposal submitted to the President of the company.2006,  Cathy Pickens,  Done Gone Wrong, ISBN:Think about all the scientistsand all the microscopes and lab equipment and testingthat may come up with zero instead of a zinger.Something to eat or drink that is tart and stimulating.2013,  Paula Harrison,  Rescue Princesses #5: The Snow Jewel, ISBN:Here, have a strawberry zinger and don\\'t tell Mom and Dad that we had candy in the bedroom.2016,  Linda Goodnight,  The Rain Sparrow, ISBN:Want some he saluted her with one of Julia\\'s delicate white cups and a wry arch of eyebrow, sipped and made a face lemon zinger tea? At times like this she wished she was as outgoing as Nikki or gorgeous like Bailey or even a little wild and easy with men like Valery. But she was none of those things. She was plain Carrie, the librarian, wishing she could say something snappy and clever. If you don\\'t like lemon zinger, pick a different kind.\"", "zincoid": " (comparative more zincoid, superlative most zincoid)Of, pertaining to, or resembling zinc.(obsolete) Of or pertaining to the zinc electrode that connects to a copper one in a voltaic cell.", "zootoxin": " (plural zootoxins)A toxin produced by an animal.", "zealousness": " (uncountable)The quality of being zealous; zeal.", "zeilanite": " (uncountable)(mineralogy, archaic) candite", "zoography": " (usually uncountable, plural zoographies)A description of animals, their forms, and habits; descriptive zoology.", "zoonic": " (not comparable)Of or pertaining to animals; obtained from animal substances.", "zoril": " (plural zorils)zorille", "zymolysis": " (uncountable)(chemistry) The action of enzymes in breaking down organic substances during fermentation", "zymophore": " (plural zymophores)(biochemistry) The active part of an enzyme that is responsible for its function", "zootechnics": " (uncountable)animal husbandry", "zanana": " (plural zananas)Alternative spelling of zenana", "zebraic": " (comparative more zebraic, superlative most zebraic)(mineralogy) Having a pattern of broken stripes.", "zigs": "plural of zigThird-person singular simple present indicative form of zig", "zoic": " (comparative more zoic, superlative most zoic)(rare) Showing traces of life; containing organic remains.Having the form of an animal; animal-like, zoomorphic.", "ziti": " (usually uncountable, plural zitis)A type of penne pasta in the form of long smooth hollow tubes.", "zoophori": "plural of zoophorus", "zizzles": "Third-person singular simple present indicative form of zizzle", "zoosporangium": " (plural zoosporangia)(botany) A sporangium, or conceptacle containing or producing zoospores.", "zoogloeae": "plural of zoogloea", "zechin": " (plural zechins)Alternative spelling of zecchin", "zygomorphy": " (uncountable)The quality of being zygomorphic.2015 July 3,  Zhi-Jing Qiu et al.,  Origin and evolution of Petrocosmea (Gesneriaceae) inferred from both DNA sequence and novel findings in morphology with a test of morphology-based hypotheses, in  BMC Plant Biology[1], volume 15, DOI:10.1186/s12870-015-0540-3:We here distinguish clade A from other clades based on the retention of a caulescent habit and moderate floral zygomorphy.", "zygapophysis": " (plural zygapophyses)(anatomy) One of the articular processes of a vertebra, of which there are usually four, two superior and two inferior.", "zonula": " (plural zonulae or zonulas)(anatomy) Any of several small belt-like regions.1883, Half-yearly compendium of medical science, Volumes 31-34, page 146,The zonula originates by a small number of delicate fibres from the vitreous [lamella].1980, Yves Le Grand, Sami G. El Hage, Physiological Optics, page 95,Nevertheless, the zonula is most often considered as the principal agent of transmission.", "zyzzyvas": "plural of zyzzyva", "zucchinis": "plural of zucchini", "zag": " (plural zags)One of a series of sharp turns or reversals.twist in a storyline2017 August 27,  Brandon Nowalk,  Game Of Thrones slows down for the longest, and best, episode of the season (newbies), in  The Onion AV Club[1]:Afterward, she returns to the Dragon Pit to announce her agreement to the truce. The darkness is coming for us all. We will face it together. And when the Great War is over, perhaps you will remember that I chose to help, with no promises or assurances from any of you. I expect not. The self-pity and pettiness is classic Cersei, but what a zag! It was always hard to imagine what this show looks like with all the humans on all sides temporarily working together. (third-person singular simple present zags, present participle zagging, simple past and past participle zagged)to move with a sharp turn or reversalI guess I zigged when I should have zagged.", "zest": " (countable and uncountable, plural zests)Wikipedia has an article on:zestWikipediaThe outer skin of a citrus fruit, used as a flavouring or garnish.The orange zest gives the strong flavor in this dish.General vibrance of flavour.I add zest to the meat by rubbing it with a spice mixture before grilling.1959, Peter De Vries, The Tents of Wickedness, Boston: Little, Brown &amp; Co., The Treehouse, Chapter 7, p. 92,[1]He rolled his own cigarettes from a sack of Bull Durham, spilling flakes into his beer, which no doubt gained in zest thereby.1978, Joseph Singer et al. (translators), Shosha by Isaac Bashevis Singer, New York: Fawcett Crest, Part One, Chapter Five, 1, p. 99,[2]Basheles dishes tasted as good as they had when I was a child. No one could give to the borscht such a sweet-and-sour zest as Bashele.(by extension) Enthusiasm; keen enjoyment; relish; gusto.Auntie Mame had a real zest for life.1728, Edward Young, Love of Fame, the Universal Passion, Satire II in The Works of the Reverend Edward Young, London: P. Brown, H. Hill &amp; S. Payne, 1765, Volume I, p. 85,[3]Almighty vanity! to thee they oweTheir zest of pleasure, and their balm of woe.1807, Thomas Cogan, An Ethical Treatise on the Passions, Bath: Hazard &amp; Binns, Part 1, Disquisition 1, Chapter 1, Section 1 On the utility of the Passions and Affections, p. 51,[4]Liberality of disposition and conduct gives the highest zest and relish to social intercourse.1928, D. H. Lawrence, Lady Chatterleys Lover, New York: Barnes &amp; Noble, 1995, Chapter 9, p. 101,[5]Once started, Mrs. Bolton was better than any book, about the lives of the people. She knew them all so intimately, and had such a peculiar, flamey zest in all their affairs, it was wonderful, if just a trifle humiliating to listen to her.1962, James Baldwin, Another Country, New York: Dell, 1963, Book Two, Chapter 2, p. 221,[6]The singers, male and female, wore blue jeans and long hair and had more zest than talent.(rare) The woody, thick skin enclosing the kernel of a walnut.2006, N. J. Nusha, On the Edge (Short Stories), Lahore: Sang-e-Meel Publications, p. 85,The green zest of walnuts was used by the women to shine their teeth and it also gave a beautiful rust colour to their lips. (third-person singular simple present zests, present participle zesting, simple past and past participle zested)(cooking) To scrape the zest from a fruit.To make more zesty.", "zapateos": "plural of zapateo", "zwitterion": " (plural zwitterions)(chemistry) A molecule, such as an amino acid, that carries both a positive and a negative charge.", "zoogonous": " (not comparable)(zoology) That gives birth to live offspring (rather than laying eggs)(botany, of seeds or fruit) That sprout before they fall", "zeroth": " (not comparable)(mathematics) In the first position in a sequence whose elements are numbered starting at zero; the ordinal number corresponding to zero.The zeroth order polynomial approximation is constant.Corresponding to a position preceding the first.A and C are in equilibrium following the Zeroth Law of Thermodynamics.", "zufolo": " (plural zufolos or zufoli)(music) A little flute or flageolet, especially that which is used to teach birds.", "zeugmatically": " (comparative more zeugmatically, superlative most zeugmatically)In a zeugmatic manner.", "zincite": " (usually uncountable, plural zincites)(mineralogy) A yellow, orange or dark-red mineral form of zinc oxide, often also containing small amounts of manganese, with a chemical formula (Zn,Mn2+)O, an important ore of zinc.", "zehner": " (plural zehners)(archaic) An Austrian silver coin equal to ten kreutzers.", "zobo": " (plural zobos)A kind of Asian cattle, supposed to be a hybrid between the zebu and yak.", "zingiber": " (plural zingibers)Any member of the genus Zingiber of gingers.", "zymological": " (comparative more zymological, superlative most zymological)Of or pertaining to zymology; zymologic.", "zelotypia": " (uncountable)(formal) jealousy", "zonetimes": "plural of zonetime", "zeitgeist": " (plural zeitgeists or zeitgeister or zeitgeisten)The spirit of the age; the taste, outlook, and spirit characteristic of a period2014 February 10,  Anthony Faiola,  Swiss vote to limit foreign workers captures growing European fears about immigration, in  The Washington Post[1], retrieved 2014-02-11:The vote also stoked fears that Swiss citizens were reflecting the zeitgeist across Europe, 2000, MeanjinFor hundreds of years, learned theologians and ordinary people have been working to untangle the Gospel\\'s message of liberation from the zeitgeisten that found scriptural excuses for slavery, war, monarchy, imperialism, homophobia and the subjugation of women.1996, Michael Vanden Heuvel, Elmer Rice: A Research and Production Sourcebook, Greenwood Publishing Group ISBNAfter quickly summarizing the zeitgeisten of the Greek, Elizabethan, and early modern periods and their effects on the theatre, Rice turns to the contemporary world.1986, Robert Albritton, A Japanese Reconstruction Of Marxist Theory, Springer ISBN, page 186The materiality and complexity of history is absorbed into the most abstract idea which periodizes history into a series of \\'zeitgeisten\\'.", "zeks": "plural of zek", "zonochlorite": " (uncountable)(mineralogy) chlorastrolite found in rounded masses within or weathered out of amygdaloidal cavities", "zoism": " (uncountable)(dated) Reverence for animal life or belief in animal powers and influences, as among primitive groups.(dated) A former doctrine claiming that the phenomena of life are due to a peculiar vital principle; the theory of vital force.", "zygomorphous": " (not comparable)zygomorphic", "zealotic": " (comparative more zealotic, superlative most zealotic)In the manner of a zealot; zealous; fanatic.", "zooecia": "plural of zooecium", "zodiacs": "plural of zodiac", "zillah": " (plural zillahs)A district or local division, as of a province, in India.", "zinciferous": " (comparative more zinciferous, superlative most zinciferous)Containing or producing zinc.", "za": " (plural zas)(US, Canada, slang, 1970s, 1980s) Pizza.1994, Sara Borins, The Real Guide to Canadian Universities, ISBN, page 130:In fact, not ordering a SUB or ZA (pizza) is almost impossible since places to eat in Sackville include Subway (subs), Ed\\'s (subs), Joey\\'s (subs and za), Pizza Delight (mostly za), The Snack Shop (subs and za) and One Plus One (subs and za).2006, Lee Simon, The restaurant dream?: an inside look at restaurant development, from concept to reality, ISBN, page 44:But Chris, using some of his dated terminology, insisted that he wanted \"za\" for dinner. Back when Chris was a youngster in college, \"za\" was short for pizza--as if pizza were a lengthy word needing abbreviating.2010, Jim Butcher, Turn Coat:They call me the Za-Lord.Nonstandard spelling of the. mimicking foreign accents", "zoysias": "plural of zoysia", "zills": "plural of zill", "zirconian": " (comparative more zirconian, superlative most zirconian)(mineralogy) Describing minerals containing zirconium", "zebralike": " (comparative more zebralike, superlative most zebralike)Resembling a zebra, especially in having contrasting stripes.", "zeugma": " (plural zeugmata or zeugmas)ExamplesWe ate coffee and cake, forWe drank coffee and ate cake(rhetoric) The act of using a word, particularly an adjective or verb, to apply to more than one noun when its sense is appropriate to only one.(rhetoric) Syllepsis.1963 July, Fred Sommers, Types and Ontology, in The Philosophical Review, Volume LXXII, Bobbs-Merrill Reprint Series in Philosophy, page 343,The existence of zeugmas suggests the rule of transitivity. Zeugmas appear incorrect because they embody an allegedly univocal use of a term in a way which violated[sic] the rule of transitivity.2008, Amanda Holton, The Sources of Chaucer\\'s Poetics, page 104,Thus I would describe \\'He took his leave and the wrong umbrella\\' as zeugma, but not \\'He took his hat and umbrella\\'.Zeugma is an important element in Chaucer\\'s poetic technique, not because he uses it, but because he so regularly turns it down.", "zetetic": " (comparative more zetetic, superlative most zetetic)(rare) Seeking; proceeding by inquiry.1994, Willi Goetschel, Constituting Critique, page 74The zetetic approach or, as Kant translates it, the searching approach, becomes the element by means of which the discourse develops, the medium in which philosophical thinking occurs. (plural zetetics)A skeptic.", "zosters": "plural of zoster", "zenithwards": " (not comparable)Alternative form of zenithward1940, Stuart Gilbert (translator), Summer, 1914 by Roger Martin du Gard, London: John Lane, Part 2, Chapter 57, p. 751,The sun was climbing zenithwards across a haze of dazzling light.", "zygomaticoauricular": " (not comparable)(anatomy) Relating to the zygomatic bone and auricle.", "zestier": "comparative form of zesty: more zesty", "zygomaticomaxillary": " (not comparable)(anatomy) Relating to the zygomatic bone and maxilla.", "zorille": " (plural zorilles)Ictonyx striatus, a small, carnivorous, nocturnal African mammal resembling a skunk.", "zymotechnics": " (uncountable)The science or technology of fermentation.", "zaratites": "plural of zaratite", "zelkova": " (plural zelkovas)A kind of tree in the elm family (genus Zelkova).", "zionist": " (plural zionists)Alternative letter-case form of Zionist", "zoomorphism": " (plural zoomorphisms)The representation of gods as animals or the attributing of animal characteristics to gods.(art, literature) The use of animal figures in art and design or of animal symbols in literature.The viewing of human behavior in terms of the behavior of animals.", "zinc": " (uncountable)a chemical element (symbol Zn) with an atomic number of 30. (third-person singular simple present zincs, present participle zincing or zinking or zincking, simple past and past participle zinced or zinked or zincked)(rare) To electroplate with zinc.(rare) To coat with sunblock incorporating zinc oxide.", "zillionths": "plural of zillionth", "zirconiferous": " (comparative more zirconiferous, superlative most zirconiferous)Containing or producing zircon.", "zorilles": "plural of zorille", "zoopsychological": " (not comparable)Of or pertaining to zoopsychology.", "zincked": "simple past tense and past participle of zinc", "zymosan": " (countable and uncountable, plural zymosans)(biochemistry) an insoluble carbohydrate, obtained from the cell walls of yeast, used in the bioassay of blood serum", "zings": "plural of zingThird-person singular simple present indicative form of zing", "zimarra": " (plural zimarras)a cassock with a small cape attached", "zoomania": " (uncountable)An excessive or abnormal love of animals", "zingerone": " (usually uncountable, plural zingerones)(organic chemistry) A crystalline solid organic compound that gives ginger its pungent taste.", "zirconate": " (plural zirconates)(chemistry) Any salt of zirconic acid.", "zootomy": " (usually uncountable, plural zootomies)(zoology) The dissection or anatomy of animals.", "zoophobes": "plural of zoophobe", "zygotic": " (not comparable)(biology) Of or pertaining to a zygote.", "zircaloy": " (plural zircaloys)(metallurgy, nuclear industry) Any of a set of specialist alloys of zirconium", "zeekoe": " (plural zeekoes)(archaic) hippopotamus", "zestiness": " (uncountable)The state or property of being zesty.", "zonitid": " (plural zonitids)(zoology) Any member of the Zonitidae.", "zanier": "comparative form of zany: more zany", "zapateo": " (plural zapateos)A competitive stamping dance with percussive footwork, historically popular among the gauchos of South America.", "zootomies": "plural of zootomy1996, Marian Fournier, The fabric of life: microscopy in the seventeenth century (page 141)Many animal species had been thoroughly studied, although most of the zootomies do not appear to have benefited greatly from microscopic examination.", "zonetime": " (countable and uncountable, plural zonetimes)(rare) The time in a particular timezone, based on a meridian, as opposed to standard time.2011, Lawrence Rick, Life is a Cruise: The Log of Done Dreamin\\' (page 83)For all our weather and radio reports, we use UTC or Greenwich, and for everything else we use zonetime. This is quite easy to find by taking your longitude and dividing it by fifteen. Subtract this number from UTC time and you have zonetime.", "zygopteran": " (plural zygopterans)Any of various insects of the order Zygoptera; damselfly.", "zacaton": " (countable and uncountable, plural zacatons)Alternative spelling of sacaton", "zinco": " (plural zincos)(informal, dated) A line or half-tone block etched on zinc plate, used in zincography.", "zastrugi": "plural of zastruga", "zoonoses": "plural of zoonosisplural of zoonose", "zincky": " (comparative more zincky, superlative most zincky)Alternative form of zincy", "zephyrous": " (comparative more zephyrous, superlative most zephyrous)Like a zephyr; (of a wind) soft, gentle, refreshing.1753, Aaron Hill, Augustas Complaint to her Thames in The Works of the Late Aaron Hill, esq., London, 2nd edition, 1754, p. 345,[1]Hither no winds, but zephyrous breaths repair,Soft, as the sighs of love sick virgins are!1800, Frederick Howard, Earl of Carlisle, The Stepmother, London: R.H. Evans, Act V, Scene 1, p. 75,[2]The last nights tempest was a zephyrous gale,To the rough storm that tears his frame to atoms:1909, Jessie Mackay, The Garden of Art in Land of the Morning, Christchurch: Whitcombe &amp; Tombs, p. ,[3]And the blossom as scarlet as blood, the single, the starry, the strong,Is the Alpine love that is nurtured in clefts of the toilers life,The love that is sought not in languor nor chanted in zephyrous song,But held in the heart of the storm when the soul has been wed to a wife.2002, J. M. Coetzee, Youth, Vintage, 2003, Chapter 14, p. 117,He used to be impatient of poems about budding flowers and zephyrous breezes.Breezy; blown by a breeze.1915, Henry Sydnor Harrison, Angelas Business, Boston: Houghton Mifflin, Chapter 22,[4]It was March now, the mild March of an early spring. There came new days, zephyrous and sweet.1966, Allen Ginsberg, Bayonne Entering N.Y.C. in Collected Poems, 1947-1997, Harper Collins,[5]Green-hatted doormen awaken the evein statuary-niched yellow lobbieszephyrous canyons brightlit, gray stone Empire Statetoo small to be Godlords it over sweet Macys &amp; Seafood Cityby junkie Grant Hotel(of a fabric, garment, etc.) Light, fine, soft.1895, Feminine Affairs in To-Day (magazine edited by Jerome K. Jerome), Volume 9, Number 111, 21 December, 1895, p. 200,[6]That there will be flying machines before very long seems more than likely, and what deliciously zephyrous and diaphanous costumes will not the milliners devise for airy recreations in the near future!", "zonure": " (plural zonures)Any one of several of South African lizards of the genus Zonurus (now Smaug), common in rocky environments.", "zoophilism": " (uncountable)An affection for non-human animals2002,  Dario Martinelli,  How Musical Is a Whale?[1], page 76:Zoophilism bears witness to a new human being, one who no longer fears nature.(epidemiology) A preference of a parasite or vector to feed on non-human animals1951,  Meillon de Botha,  Species and varieties of malaria vectors in Africa and their bionomics, in (Please provide the book title or journal name)[2], page 421:They make the interesting suggestion that since cattle are rare in Kigezi christyi has had to abandon its zoophilism and become anthropophilic.Zoophilia, a sexual inclination towards bestiality", "zarzuela": " (countable and uncountable, plural zarzuelas)(music) A form of Spanish opera having spoken dialogue and usually a comic subject", "zymases": "plural of zymase", "zinging": "present participle of zing", "zoographical": " (not comparable)Of or pertaining to zoography.", "zoarium": " (plural zoaria)A colony of zooids.", "zazen": " (usually uncountable, plural zazens)A form of seated meditation in Zen Buddhism.1985, Lawrence Durrell, Quinx, Faber &amp; Faber 2004 (Avignon Quintet), p. 1226:They had sent out scouts to try and locate the original cave where the practice of Zazen was first initiated.1992,  Donna Tartt,  The Secret History:In the practice of Zen there is an exercise called zazen  similar, I think, to the Theravedic practice of vipassana. One sits facing a blank wall. No matter the emotion one feels, no matter how strong or violent, one remains motionless. Facing the wall. The discipline, of course, is in continuing to sit.", "zooflagellate": " (plural zooflagellates)(microbiology) Any of the heterotrophic flagellates of the phylum Zoomastigophora", "zany": " (comparative zanier, superlative zaniest)Unusual and bizarre in a funny, comical way; outlandish; clownish.1986,  John le Carr,  A Perfect Spy:And I will admit now but never then that, more than once, listening to the Viennese chattering their zany German on the pavements, or taking himself to one of the struggling small theatres that were cropping up in cellars and bombed houses...1999,  Alyn Shipton,  Gillespiana, in  Groovin\\' High: The Life of Dizzy Gillespie, Oxford: Oxford University Press, ISBN, page 293:Press articles emphasized his [Dizzy Gillespie\\'s] ambassadorial role and drew attention to the paradox that he was a shrewd musician and leader despite his zany image.2000,  Alan H. Levy,  Rube Waddell: The Zany, Brilliant Life of a Strikeout Artist, Jefferson, N.C.: London: McFarland &amp; Company, ISBN, page 241:When playing for Connie Mack, Rube [Waddell]\\'s pattern after one of his zany outbursts usually involved promises of good behavior and a spurt of excellent pitching.2013,  William Paul,  No Escaping the Depression: Utopian Comedy and the Aesthetics of Escapism in Frank Capra\\'s You Can\\'t Take it with You (1938), in Andrew Horton and Joanna E. Rapf, editors, A Companion to Film Comedy, Chichester, West Sussex: John Wiley &amp; Sons, ISBN, page 280:This runs counter to the play, where Grandpa is always benignly indulgent of all his zany progeny and their equally zany spouses, and is even somewhat zany himself.2015,  Kimberly D. Nettles-Barceln,  The Sassy Black Cook and the Return of the Magic Negress: Popular Representations of Black Women\\'s Food Work, in Jennifer Jensen Wallach, editor, Dethroning the Deceitful Pork Chop: Rethinking African American Foodways from Slavery to Obama, Fayetteville, Ark.: University of Arkansas Press, ISBN, page 117:The montage goes on to show scenes of Carla singing, dancing, meditating, breaking the tension amongst her co-cheftestants with sing-a-longs and hootie-hoo lessons, and ultimately wooing the judges with a combination of her zany personality and solid cooking skills.Ludicrously or incongruously comical. (plural zanies)(obsolete) A fool or clown, especially one whose business on the stage is to imitate foolishly the actions of the principal clown.John Donne:Then write that I may follow, and so be / Thy echo, thy debtor, thy foil, thy zany.Alexander Pope:Preacher at once, and zany of thy age.1898, J. Meade Falkner, Moonfleet Chapter 4So there he caught me lying like a zany on the ground. You may guess I stood at attention soon enough, but told him I was looking at the founds to see if they wanted underpinning from the floods.1996,  Fiona Haslam,  From Hogarth to Rowlandson: Medicine in Art in Eighteenth-century Britain, Liverpool: Liverpool University Press, ISBN, page 69:Part of the illusory world is the \\'quack\\' or mountebank who can be seen standing on his own special platform in the centre of the crowd&#160;[]. Such a person travelled round to fairs and markets selling his nostrums or medicines. This character is dressed in a lace hat, long periwig and embroidered coat with lace cuffs, and is attended by his zany, who is wearing a chequered harlequin outfit and is \\'quacking\\' or \\'puffing\\' his master\\'s wares. No seventeenth- or eighteenth-century mountebank was complete without his zany or \\'Merry Andrew\\'&#160; a term originally applied to Dr Andrew Boorde, physician to Henry VIII and noted for his ready wit and humour, who was the subject of many broadside ballads. (third-person singular simple present zanies, present participle zanying, simple past and past participle zanied)(obsolete) To mimic foolishly.", "zingers": "plural of zinger", "zigzaggedness": " (uncountable)The state or quality of being zigzagged or alternating directions sharply.", "zoophytic": " (not comparable)of, or relating to the zoophytes", "zincification": " (uncountable)The act or process of zincifying.", "zinged": "simple past tense and past participle of zing", "zygomycete": " (plural zygomycetes)(biology) An organism of the phylum Zygomycota.", "zoochores": "plural of zoochore", "ziggurat": " (plural ziggurats)A temple tower of the ancient Mesopotamian valley, having the form of a terraced pyramid of successively receding stories.", "zanies": "plural of zany", "zincum": " (uncountable)(archaic, homeopathy) Zinc.", "zapateados": "plural of zapateado", "zabajone": " (countable and uncountable, plural zabajones)Alternative form of zabaglione", "zonulae": "plural of zonula", "zizel": " (plural zizels)The suslik.", "zeolitize": " (third-person singular simple present zeolitizes, present participle zeolitizing, simple past and past participle zeolitized)(geology) To convert (or be converted) into a zeolite.(geology) To fill small cracks with zeolite.", "zygadite": " (uncountable)(mineralogy) A variety of albite.", "zanella": " (countable and uncountable, plural zanellas)An Italian wool or twill fabric.", "zeals": "plural of zeal", "zoological": " (comparative more zoological, superlative most zoological)Of, or relating to, animals.Of, or relating to, zoology.", "zebec": " (plural zebecs)Alternative spelling of xebec.1798,  John Charnock,  ST. VINCENT, Sir John Jervis, K.B. Earl of, in  Biographia Navalis; or, Impartial Memoirs of the Lives and Characters of Officers of the Navy of Great Britain, from the Year 1660 to the Present Time; Drawn from the Most Authentic Sources, and Disposed in a Chronological Arrangement, volume VI (Being the Second Volume of the Continuation), London: Printed for R. Faulder, Bond-Street, OCLC 858348049, footnote , page 406:Soon after this time he [John Jervis, 1st Earl of St Vincent] was put into the Experiment as acting captain, on account of a hort indipoition which attacked ir Richard Strachan, and ignalized himelf in the mot remarkable manner during an action with a very large zebec, carrying 26 heavy guns and 400 men.", "zaddik": " (plural zaddiks or zaddikim)Alternative spelling of tzaddik", "zips": "plural of zip", "zwanziger": " (plural zwanzigers)(historical) An Austrian silver coin equivalent to 20 kreutzers, or about 10 cents.", "zircons": "plural of zircon", "zeal": " (countable and uncountable, plural zeals)The fervor or tireless devotion for a person, cause, or ideal and determination in its furtherance; diligent enthusiasm; powerful interest.DrydenZeal, the blind conductor of the will.Bible, Romans x. 2I bear them record that they have a zeal of God, but not according to knowledge.(obsolete) A zealot.(Can we find and add a quotation of Ben Jonson to this entry?)The collective noun for a group of zebras.2012,  Alex Kuskowski,  Zeal of Zebras: Animal Groups on an African Safari, ISBN, page 8:A zeal of zebras confuses predators. Each zebra has a different set of stripes.", "zygomaticosphenoid": " (not comparable)(anatomy) Relating to the zygomatic bone and sphenoid bone.", "zygosis": " (plural zygoses)(biology) The union of gametes to form a zygote; conjugation.", "zamindars": "plural of zamindar", "zapote": " (plural zapotes)Alternative form of sapote (fruit or tree)", "zibelline": " (countable and uncountable, plural zibellines)(archaic) sable1885, Bacciotti\\'s Handbook of Florence and Its EnvironsOvercoats trimmed and lined with furs  Choice and varied collection in American and Russian zibellines", "zamarras": "plural of zamarra", "zonary": " (comparative more zonary, superlative most zonary)zonal", "zymosimeter": " (plural zymosimeters)An instrument for ascertaining the degree of fermentation occasioned by the mixture of different liquids, and the degree of heat which they acquire in fermentation; a zymometer.", "zygite": " (plural zygites)(historical) A rower of the middle tier in a trireme.", "zoonite": " (plural zoonites)(zoology, archaic) One of the segments of the body of an articulated animal, sometimes regarded as a distinct organism.1843,  The Medical Times, volume 7, page 183:An organite is always dependent, its life is always subordinate to that of the individual of which it forms a part; a zoonite is always independent, it has a life peculiar to itself.1891,  Journal of the Royal Microscopical Society, page 195:When there is budding the somite which proliferates is the pre-anal in Myrianida and certain species of Autolytus; the anal segment is, from the first, too differentiated to take part in the formation of new zoonites.", "zeuxite": " (uncountable)(mineralogy, obsolete) A form of green tourmaline.", "zeuglodont": " (plural zeuglodonts)(zoology) Any member of the Basilosauridae under the taxonomically invalid name Zeuglodontidae.", "zombielike": " (comparative more zombielike, superlative most zombielike)Similar to a zombie, having the appearance or character of a zombie.", "zeroize": " (third-person singular simple present zeroizes, present participle zeroizing, simple past and past participle zeroized)(nonstandard) To set, reset or initialize something (especially a variable or parameter) to zero.", "zymosis": " (plural zymoses)A fermentation; hence, an analogous process by which an infectious disease is believed to be developed.A zymotic disease.", "zindabad": "(South Asia) A shout of encouragement; a cheer, which can also be interpreted to mean \"may [idea or person] live forever\" -- in praise of a leader, for example: Inquilab Zindabad", "zippers": "plural of zipperThird-person singular simple present indicative form of zipper", "zoophytoid": " (comparative more zoophytoid, superlative most zoophytoid)(archaic) zoophytic", "zaps": "plural of zapThird-person singular simple present indicative form of zap", "zeoscope": " (plural zeoscopes)(historical) An instrument that was used to determine the alcoholic content of liquid by measuring its boiling point.", "zion": " (plural zions)zayin, Hebrew letter .", "zealot": " (plural zealots)One who is zealous, one who is full of zeal for his own specific beliefs or objectives, usually in the negative sense of being too passionate; a fanatic(historical) A member of a radical, warlike, ardently patriotic group of Jews in Judea, particularly prominent in the first century, who advocated the violent overthrow of Roman rule and vigorously resisted the efforts of the Romans and their supporters to convert the Jews.(historical) A member of an anti-aristocratic political group in Thessalonica from 1342 until 1350.", "zamindary": " (plural zamindaries)Alternative form of zamindari", "zoomorphy": " (uncountable)The quality of being zoomorphic.", "zemindar": " (plural zemindars)Alternative spelling of zamindar", "zo": " (plural zos)Alternative spelling of dzo", "zincites": "plural of zincite", "zakuska": " (plural zakuskas or zakuski)An assortment of hors doeuvres", "zamias": "plural of zamia", "zygobranch": " (plural zygobranchs)A zygobranchiate mollusc.", "zeatin": " (countable and uncountable, plural zeatins)A plant hormone derived from adenine, having the chemical formula C10H13N5O.", "zoanthid": " (plural zoanthids)Wikipedia has an article on:zoanthidWikipedia(zoology) Any member of the order Zoanthidea of cnidarians commonly found in coral reefs and other marine environments.", "zuchetto": "Misspelling of zucchetto.", "zymotechnic": " (not comparable)Relating to zymotechnics.", "zootomically": " (not comparable)In terms of zootomy.", "zendo": " (plural zendos)A hall at a Zen buddhist monastery where formal seated meditation (zazen) is practiced.", "zincolysis": " (uncountable)(chemistry, archaic) electrolysis", "zereba": " (plural zerebas)Alternative form of zariba (third-person singular simple present zerebas, present participle zerebaing, simple past and past participle zerebaed)Alternative form of zariba", "zygosporangium": " (plural zygosporangia)(mycology) A sporangium which produces a single zygospore.", "zebras": "plural of zebra", "zolotnik": " (plural zolotniks or zolotniki)An old Russian unit of weight, equal to 4.2658 grams.", "zayins": "plural of zayin", "zucchini": " (plural zucchinis or zucchini)(Australia, Canada, New Zealand, US) A courgette; a variety of squash, Cucurbita pepo, which bears edible fruit.(Australia, Canada, New Zealand, US) The edible fruit of this variety of squash.", "zoophilia": " (countable and uncountable, plural zoophilias)Human sexual attraction toward or sexual interaction with animals.(uncommon, chiefly pejorative) Excessive fondness for animals.For usage examples of this term, see Citations:zoophilia.", "zymolytic": " (comparative more zymolytic, superlative most zymolytic)Causing fermentation", "zone": " (plural zones)(geography, now  rare) Each of the five regions of the earth\\'s surface into which it was divided by climatic differences, namely the torrid zone (between the tropics), two temperate zones (between the tropics and the polar circles), and two frigid zones (within the polar circles).1621,  Democritus Junior [pseudonym; Robert Burton],  The Anatomy of Melancholy, Oxford: Printed by Iohn Lichfield and Iames Short, for Henry Cripps, OCLC 216894069;   The Anatomy of Melancholy, 2nd corrected and augmented edition, Oxford: Printed by John Lichfield and James Short, for Henry Cripps, 1624, OCLC 54573970, (please specify |partition=1, 2, or 3):, I.2.4.vi:To avoid which, we will take any pains&#160; [] ; we will dive to the bottom of the sea, to the bowels of the earth, five, six, seven, eight, nine hundred fathom deep, through all five zones, and both extremes of heat and cold&#160;[].1841, George Bancroft, History of the United States, from the Discovery of the American Continent, Volume 2, page 270,And while idle curiosity may take its walk in shady avenues by the ocean side, commerce [] defies every wind, outrides every tempest, and invades every zone.Any given region or area of the world.A given area distinguished on the basis of a particular characteristic, use, restriction, etc.There is a no-smoking zone that extends 25 feet outside of each entrance.The white zone is for loading and unloading only.Files in the Internet zone are blocked by default, as a security measure.A band or area of growth encircling anything.a zone of evergreens on a mountain; the zone of animal or vegetable life in the ocean around an island or a continentA band or stripe extending around a body.(crystallography) A series of planes having mutually parallel intersections.(baseball, informal) The strike zone.That pitch was low and away, just outside of the zone.(ice hockey) Every of the three parts of an ice rink, divided by two blue lines.Players are off side, if they enter the attacking zone before the puck.(handball) A semicircular area in front of each goal.1974,  Franko Blazic; Zorko Soric,  Team Handball[1], page 31:The defender playing at the top of the zone is nine to fourteen metres out from the goal line.(chiefly sports) A high-performance phase or period.I just got in the zone late in the game: everything was going in.(basketball, American football) A defensive scheme where defenders guard a particular area of the court or field, as opposed to a particular opposing player.(networking) That collection of a domain\\'s DNS resource records, the domain and its subdomains, that are not delegated to another authority.(Apple computing) A logical group of network devices on AppleTalk.(now  literary) A belt or girdle.17th c, John Dryden, 2005, Pygmalion and the Statue, Paul Hammond, David Hopkins (editors), The Poems of John Dryden: Volume Five: 1697-1700, page 263,Her tapered fingers too with rings are graced, / And an embroidered zone surrounds her slender waist.1671, John Milton, Paradise Regained, Book II, lines 211 to 220.[] Or should she, confident, / As sitting queen adored on beauty\\'s throne, / Descend with all her winning charms begirt / To enamour, as the zone of Venus once / Wrought that effect on Jove, so fables tell&#160;: / How would one look from his majestic brow, / Seated as on the top of virtue\\'s hill, / Discountenance her despised, and put to rout / All her array; her female pride deject, / Or turn to reverent awe&#160;? [] 1779, Thomas Forrest, A Voyage to New Guinea and the Moluccas from Balambangan, page 21,From the wait downwards, they wore a looe robe, girt with an embroidered zone or belt about the middle, with a large clap of gold, and a precious tone.18th c, William Collins, The Passions: An Ode for Music, 1810, Alexander Chalmers, Samuel Johnson (editors), The Works of the English Poets, from Chaucer to Cowper, Volume 13, page 204,Love fram\\'d with Mirth a gay fantastic round, / Loose were her tresses seen, her zone unbound,1819, Lord Byron, Don Juan, Canto I, LV, 1827, The Works of Lord Byron, including The Suppressed Poems, page 565,There was the Donna Julia, whom to call / Pretty were but to give a feeble notion / Of many charms in her as natural / As sweetness to the flower, or salt to ocean, / Her zone to Venus, or his bow to Cupid / (But this last simile is trite and stupid).1844, Charles Dickens, The life and Adventures of Martin Chuzzlewit, 1865, Works of Charles Dickens, Volume VI: Martin ChuzzlewitVolume II, page 421,[] it was the prettiest thing to see her girding on the precious little zone, and yet obliged to have assistance because her fingers were in such terrible perplexity;&#160;[].(geometry) The curved surface of a frustum of a sphere, the portion of surface of a sphere delimited by parallel planes.1835, Charles Davies, David Brewster (editors and translators), Adrien-Marie Legendre, Elements of Geometry and Trigonometry, [1794, Elments de gomtrie], page 293,To find the surface of a spherical zone.Rule.Multiply the altitude of the zone by the circumference of a great circle of the sphere, and the product will be the surface (Book VIII. Prop. X. Sch. 1).2014, John Bird, Engineering Mathematics, page 183,A zone of a sphere is the curved surface of a frustum. [] Determine, correct to 3 significant figures (a) the volume of the frustum of the sphere, (b) the radius of the sphere and (c) the area of the zone formed.(geometry, loosely, perhaps by meronymy) A frustum of a sphere.A circuit; a circumference.1667, John Milton, Paradise Lost, Book V, lines 558 to 560.And we have yet large day; for scarce the sun / Hath finish\\'d half his journey, and scarce begins / His other half in the great zone of heaven. (third-person singular simple present zones, present participle zoning, simple past and past participle zoned)To divide into or assign sections or areas.Please zone off our staging area, a section for each group.To define the property use classification of an area.This area was zoned for industrial use.To enter a daydream state temporarily, for instance as a result of boredom, fatigue, or intoxication; to doze off.I must have zoned while he was giving us the directions.Everyone just put their goddamn heads together and zoned. (Byron Coley, liner notes for the album \"Piece for Jetsun Dolma\" by Thurston Moore)To girdle or encircle.", "zyme": " (plural zymes)A ferment.(obsolete, medicine) The morbific principle of a zymotic disease.", "zestful": " (comparative more zestful, superlative most zestful)Having a spirited love of life; ebullient.1957, Arthur Upfield, Bony Buys a Woman, London: Heinemann, 1967, Chapter 13, p. 117,[1]Debonair youth! The spurs, the wide felt hat, the open shirt, the belt holding the array of small pouches, including a holstered revolver, the delight in the long stock-whip having a bright green silk cracker to produce loud reports, ranging from slow rifle fire to the rat-tat-tat of a machine-gun, all told the story of zestful youth.Eager, enthusiastic.1933, H. G. Wells, The Shape of Things to Come, London: Hutchinson &amp; Co., 1935, Book 1,  10, p. 77,[2][] there appeared a narrowly patriotic government, which presently developed into an aggressive, vindictive and pitiless dictatorship, and set itself at once to the zestful persecution of the unfortunate ethnic minorities []1968, Donald Barthelme, The Dolt in Sixty Stories, New York: Dutton, 1982, p. 94,[3][] the former priest, by now habituated to military life, and even zestful for it, enlisted under the new young king, with the rank of captain.", "zoea": " (plural zoeae or zoeas)Alternative spelling of zoaea", "zymograms": "plural of zymogram", "zebrinny": " (plural zebrinnies)The offspring of a male horse and a female zebra.1900, The Annual Register of World Events (volume 141, page 113)His zebra-horse hybrids, or zebrules, and his horse-zebra hybrids, or zebrinnies, are not marked like their Burchell-zebra parent, but resemble in both cases the Somali zebra, which is the most primitive of all its kind.1955, Ivan Terence Sanderson, Living mammals of the world (page 223)They will also interbreed with horses, producing zebrules (Plate 137) or zebrinnies.", "zephyrlike": " (comparative more zephyrlike, superlative most zephyrlike)Like a zephyr; gently breezy.", "zootechnician": " (plural zootechnicians)One working in the field of zootechnics, or animal husbandry.", "zoysia": " (plural zoysias)Any of a genus (Zoysia) of creeping perennial grasses of southern Asia and New Zealand having fine wiry leaves and including some suitable for lawn grasses, especially in warm regions.1957 August 1,  Popular Mechanics[1], volume 108, number 2, page 220:In areas farther north, zoysias will live but will not spread. Zoysias need bright, hot sunlight.", "zebrasses": "plural of zebrass", "zwieback": " (countable and uncountable, plural zwiebacks)a usually sweetened bread enriched with eggs that is baked and then sliced and toasted until dry and crispa teething food for toddler children", "zygogenesis": " (uncountable)(biology) zygote formation", "zoographer": " (plural zoographers)one who carries out zoography; a describer of animals", "zigzagged": "simple past tense and past participle of zigzag", "zapping": "present participle of zap (plural zappings)The act or result of being zapped.2009 March 28,  Linda Diebel,  The case of the deadly stapler, in  Toronto Star[1]:Then the inquiry heard the sound of the multiple Taser zappings, amplified for viewing by Braidwood, witnesses and spectators, including Dziekanski\\'s mother.", "zorgite": " (uncountable)A composite mineral containing umangite, clausthalite, and other minerals.", "zurlite": " (uncountable)(mineralogy) A white or green Vesuvian mineral.", "zincifies": "Third-person singular simple present indicative form of zincify", "zootechny": " (countable and uncountable, plural zootechnies)The science and technology of animal husbandry", "zoarial": " (not comparable)Relating to a zoarium.", "zoolatrous": " (comparative more zoolatrous, superlative most zoolatrous)animal-worshipping", "zonally": " (comparative more zonally, superlative most zonally)in zones.in a manner related to, associated with, or similar to zones.", "zoolaters": "plural of zoolater", "zenaidas": "plural of zenaida", "zaratite": " (plural zaratites)(mineralogy) a hydrous basic nickel carbonate occurring in emerald-green incrustations or compact masses", "zebrine": " (comparative more zebrine, superlative most zebrine)Of, like or pertaining to a zebra. (plural zebrines)A zebra or similar (notably equine) animal.", "zygoid": " (comparative more zygoid, superlative most zygoid)of a zygoterelating to a zygote or to zygosis", "zorro": " (plural zorros)A South American canid of the genus Lycalopex, visually similar to (and sometimes referred to as) a fox but more closely related to a wolf.", "zak": " (countable and uncountable, plural zaks)(South Africa, slang) Money.Sixpence or a small amount of money.", "zoonomia": " (uncountable)Synonym of zoonomy", "zincs": "Third-person singular simple present indicative form of zinc", "zincographic": " (not comparable)Of or pertaining to zincography.", "zoophysics": " (uncountable)(rare) The study of the structure of animal bodies; comparative anatomy.2013, Gilbert Gottlieb, Behavioral EmbryologyIn 1865, he did advanced study in Zoophysics and Zoochemistry while on the Philosophical Faculty at the University of Bonn, and he received his medical degree in 1866.", "zarfs": "plural of zarf", "zooparasite": " (plural zooparasites)Any organism that is parasitic to an animal", "zippy": " (comparative zippier, superlative zippiest)lively, quick and energetic", "zaibatsu": " (plural zaibatsus or zaibatsu)(economics) Japanese term for money clique or conglomerate, and sometimes used in the United States to refer to any large corporation.", "zendik": " (plural zendiks)Alternative form of zindiq", "zoopsia": " (usually uncountable, plural zoopsias)Visual hallucinations of animals.1986, Rod Jones, Julia Paradise:One of her most persistent hallucinations was a small brightly patterned snake moving across the floor in the periphery of her vision. Her zopsia was accompanied by a terror of real animals.", "zodiacal": " (comparative more zodiacal, superlative most zodiacal)(astronomy, astrology) Of or pertaining to the zodiac.1683, Thomas Browne, Observations upon Several Plants Mentiond in Scripture in Certain Miscellany Tracts, London: Charles Mearn, p. 3,[1][] in some passages of the Old Testament they think they discover the Zodiacal course of the Sun []1912, Mary Webb Artois (translator), Through the Desert by Henryk Sienkiewicz, New York: Benziger Brothers, Chapter 14,[2]For several evenings the pale twinkling of the somber zodiacal stars lighted up the west side of the heavens for some time after the sun had set.1959, Muriel Spark, Memento Mori, New York: New Directions, 2000, Chapter 2,She knew by heart everyones Zodiacal sign.", "zoographist": " (plural zoographists)zoographer", "zoogenesis": " (uncountable)The theory that the major types of lifeform on Earth evolved separately and independently from each other.", "zoochemy": " (uncountable)(obsolete) Zoochemistry.1802: Tobias George Smollett, The Critical Review, or, Annals of Literature, page 578Zochemy, says the author, has not for its object the analysis of dead animal substances, but should be considered as a part of general philosophy, of which the treatise before us contains the first principles.1851: Henry Philip Tappan, University Education, page 108Zochemy, once a week, by Prof. Mitscherlich, gratis.", "zoophytography": " (uncountable)The scientific description of zoophytes", "zooscopic": " (not comparable)Relating to zooscopy.", "zoetrope": " (plural zoetropes)An optical toy, in which figures made to revolve on the inside of a cylinder, and viewed through slits in its circumference, appear like a single figure passing through a series of natural motions as if animated or mechanically moved.1993, Will Self, My Idea of FunThis was the way I passed through the remainder of my childhood. The zoetrope span smoothly, times Chief Designer narrowed the legs of trousers and decreed that the cars should be more aerodynamic.2014 April 11,  Ron Charles,  David Grands Mount Terminus, in  The Guardian Weekly, volume 190, number 18, page 37:The Rosenbloom Loop is a clever little device, but its an even more clever symbol of the role that discipline plays in the creation of illusion: the persistence of vision that makes sequential still images appear to move. In a sense, thats the wizardry that Grand spins in this zoetrope of a novel as these characters love and build and pine and die.", "zoetic": " (not comparable)(rare) Of or pertaining to life", "zinebs": "plural of zineb", "zoisites": "plural of zoisite", "zooecium": " (plural zooecia)(zoology) One of the cells or tubes which enclose the feeding zooids of Bryozoa.", "zythem": " (uncountable)Alternative form of zythum", "zoogeological": " (not comparable)Relating to zoogeology.", "zoophilist": " (plural zoophilists)A lover of animals", "zanza": " (plural zanzas)A kind of thumb piano from Africa.2013, Simon Emmerson, Living Electronic Music (page 20)Idealized membranes, plates and bars are clearly inadequate and give way to the reality of tablas, gongs and zanzas.", "zikurats": "plural of zikurat", "zoophobe": " (plural zoophobes)A zoophobic person.", "zoogeographies": "plural of zoogeography", "zigamorph": " (plural zigamorphs)(computing, slang, dated, rare) The text character with hexadecimal value 0xff, when used as a string separator or terminator.", "zokor": " (plural zokors)Any of several Asiatic burrowing rodents native to Central Asia, in the spalacid subfamily Myospalacinae, related to the mole rats.", "zygoneure": " (plural zygoneures)(anatomy, obsolete) A neuron that connects to other nerve cells.1895,  Science[1], volume 2, page 778:The cells of the nerve roots (cellules radiculaires, von Gehuchten), could be called rhizoneures, the columnar cells (cellules des cordons), aromeures; commissural cells (cellules des voies courtes) would be zygoneures; long-path cells like those of the pyramidal tract (cellules des voies longues) would be maerodromic neures, from Gr. , , long course.1896,  New York Medical Journal[2], volume 63, page 374:Zygoneures lie mostly within the cerebro spinal axis, some cells of the sympathetic system offering an exception.1976,  The Soviet Journal of Marine Biology, page 164:The absence of a zygoneure, which is characteristic for the majority of Rissoidea, can be considered a consequence of decreased body measurements and results in a centralization of the nervous system.", "zebrina": " (plural zebrinas)The flowering plant Tradescantia zebrina (formerly Zebrina pendula), a species of spiderwort.2012, A. J. Oakes, Ornamental Grasses and Grasslike Plants (page 462)The plants are equally attractive when different-colored zebrinas are trained on a fan-shaped or rectangular trellis. The rose-colored flowers, of which new ones blossom each morning, add to the attractiveness of this viny, succulent herb.", "zlotych": "plural of zloty", "zoogamous": " (not comparable)Of or pertaining to zoogamy.", "zoophorous": " (plural zoophorouses)(archaeology) The part between the architrave and cornice; the frieze;  so called from the figures of animals carved upon it.", "zambomba": " (plural zambombas)A Spanish percussion instrument, a drum played by pulling a rope.", "zizz": " (plural zizzes)(informal) A nap or sleep.1973, Kyril Bonfiglioli, Don\\'t Point That Thing at Me (Penguin 2001, page 45)Then I had a little zizz until Martland telephoned.A buzzing or whizzing sound. (third-person singular simple present zizzes, present participle zizzing, simple past and past participle zizzed)(informal, intransitive) To take a nap.", "zoonal": " (not comparable)Of or pertaining to a zoon.", "zikurat": " (plural zikurats)Alternative spelling of ziggurat1915,  Robert William Rogers,  A History of Babylonia and Assyria, page 323:It had two zikurats, of which that on the north may, as Andrae supposes, have been dedicated to Anu, and that on the south to Adad.", "zac": " (plural zacs)Alternative form of zack1980, Clive James, Unreliable Memoirs, Picador 1981, p. 13:Coated with black crumbs and custard, the zac streaked out of his mouth like a dum-dum and ricocheted off a tureen.1985, Peter Carey, Illywhacker, Faber and Faber 2003, p. 370:\\'You\\'re very fortunate.\\' \\'I worked for it, every zac and deener.\\'", "zythum": " (uncountable)Egyptian malt beer, which is noted for being unfermented.", "zenanas": "plural of zenana", "zaribas": "plural of zariba", "zooter": " (plural zooters)(fandom slang) A fursuiter.", "zigzaggy": " (comparative more zigzaggy, superlative most zigzaggy)made up of zigzags", "zoons": "plural of zoon", "zincography": " (uncountable)A lithographic method of producing engravings using zinc plates", "zoopathology": " (uncountable)Animal pathology; veterinary pathology.", "ziarat": " (plural ziarats)(chiefly Baluchistan) An Islamic shrine1891,  Harry De Windt,  A Ride to India across Persia and Baluchistn[1]:On the wedding-day the bridegroom, gorgeously arrayed, and mounted on his best horse or camel, proceeds with his friends to a \"ziarat,\" or shrine, there to implore a blessing [] .1908,  G. J. Younghusband,  The Story of the Guides[2]:Palmer [] was only saved by the opportune appearance of these two men, who enabled him to get back to the shelter of the ziarat in safety.", "zymogenesis": " (uncountable)The transformation of a zymogen into an enzyme", "zinfandel": " (countable and uncountable, plural zinfandels)A dry red wine of California.2008, Danielle Corsetto, Girls with Slingshots: 419This zinfandels delish. Whered you get it?A small black grape from which zinfandel wine is made.", "zoophobia": " (countable and uncountable, plural zoophobias)An unusual fear of animals.The girl who had zoophobia didn\\'t like animals, domestic or wild.", "zink": " (countable and uncountable, plural zinks)(music, countable) A type of cornett.(uncountable) Obsolete form of zinc.1765, Temple H. Croker, Thomas Williams, Samuel Clarke, The complete dictionary of arts and sciences: Volume 2It is prepared, according to Dr. Shaw, as follows: take six ounces of copper, melting it in a wind furnace; add to it one ounce of zink: then stirring the whole well together, pour out the metal immediately.", "zygospore": " (plural zygospores)(botany) A zygosperm.(botany) A spore formed by the union of several zoospores.", "zesting": "present participle of zest", "zigzaggery": " (countable and uncountable, plural zigzaggeries)The quality or state of being zigzag; crookedness.", "zygomycetous": " (not comparable)Of or relating to the zygomycetes.", "zooblast": " (plural zooblasts)Any animal cell", "zealots": "plural of zealot", "zoophytes": "plural of zoophyte", "zeuglodon": " (plural zeuglodons)A basilosaurus.", "zygodactylism": " (uncountable)Synonym of zygodactyly", "zaires": "plural of zaire", "zantedeschia": " (plural zantedeschias)Any of the genus Zantedeschia of herbaceous flowering plants in the family Araceae, native to southern Africa.", "zoogleae": "plural of zooglea", "zayin": " (plural zayins)The seventh letter of many Semitic alphabets (Phoenician, Aramaic, Hebrew, Syriac, Arabic and others).", "zendos": "plural of zendo", "zoodendrium": " (plural zoodendria)Alternative spelling of zodendrium", "zootomic": " (not comparable)Relating to zootomy.", "zayat": " (plural zayats)Wikipedia has an article on:zayatWikipediaA building in Burma used for meetings and religious assemblies and to give shelter to travellers.1855, Emily Chubbuck Judson, Memoir of Sarah B. Judson: member of the American mission to Burmah (page 16)There are always several zayats in the neighborhood of a kyoung, to which the devotees of Boodh resort to listen to their priests.", "zirconias": "plural of zirconia", "zoilus": " (plural zoiluses or zoili)A critic characterized as bitter, carping, malignant.", "zitherists": "plural of zitherist", "zebroid": " (plural zebroids)A cross between a zebra and any other equine animal, but especially a horse. (comparative more zebroid, superlative most zebroid)Of or pertaining to such a cross.Of or pertaining to a zebra; zebrine.", "zittern": " (plural zitterns)Alternative form of cittern", "zonule": " (plural zonules)(anatomy) A little zone, or girdle; a zonula.1963, M. G. Farquar, G. E. Palade, Junctional complexes in various epithelia, The Journal of Cell Biology, Volume 17, republished 2001, Joseph G. Gall, J. Richard McIntosh (editors), Landmark Papers in Cell Biology, page 261,Each tight junction is followed by an adhering zonule extending between arrows 2 and 3 and, farther away, by a desmosome marked D. A condensation of finely fibrillar material occurs mainly along the adhering zonules on each side of the bile capillary.(anatomy) The zonule of Zinn.2004, E. Ahmed, A Textbook of Ophthalmology, page 270,The rim of a small-sized lens along with zonule is clearly seen through the fully dilated pupil.2009, Frank W. Howes, 5.4: Indications for Lens Surgery / Indications for Application of Different Lens Surgery Techniques, Myron Yanoff, Jay S. Duker (editors), Ophthalmology, 3rd Edition, page 429,In most cases, the goal of this type of lens surgery is the same as that for eyes without a compromised zonule: to remove the contents of the capsular bag through a CCC[continuous curvilinear capsulectomy] and replace the contents with a foldable IOL.[intraocular lens]", "zoantharian": " (not comparable)Of or pertaining to the Zoantharia. (plural zoantharians)Any member of the Zoantharia.", "zucchetto": " (plural zucchettos)A small skullcap worn by Roman Catholic clergy: the Pope\\'s is white, a cardinal\\'s red, a bishop\\'s purple, and a priest\\'s black.Synonyms: calotte", "zampogna": " (plural zampognas)A kind of Italian double-chantered bagpipe.1975, Francis M. Collinson, The bagpipe: the history of a musical instrument (page 188)The musician on the left is playing the zampogna, a bagpipe with two chanters and two drones. The zampogna is thought to be the bag-provided descendant of the ancient mouth-blown divergent pipes of the Romans, known as the tibia.", "zoologist": " (plural zoologists)One who studies zoology.", "zaniest": "superlative form of zany: most zany", "zamorin": " (plural zamorins)Leader of the medieval kingdom of Kozhikode", "zonality": " (countable and uncountable, plural zonalities)The state or condition of being zonal.", "zymogen": " (plural zymogens)(biochemistry) A proenzyme, or enzyme precursor, which requires a biochemical change (i.e. hydrolysis) to become an active form of the enzyme.", "zoogloea": " (plural zoogloeas or zoogloeae)(biology) A colony or mass of bacteria embedded in a viscous gelatinous substance, characteristic of a transitory stage through which rapidly multiplying bacteria pass in the course of their evolution.", "zumbooruk": " (plural zumbooruks)Alternative spelling of zamburak1971, Anthony Burgess, M/F (Penguin 2004), page 87:It was a long one, ranging from (but I may have misremembered) antipedobaptism to the illegal importation of zumbooruks.", "zonular": " (not comparable)Pertaining to a zonule or zonules.", "zoochore": " (plural zoochores)(botany) A plant whose seeds, spores, or fruit are dispersed by animals.", "zamouse": " (plural zamouses)A West African buffalo with short horns and large ears.", "zinnias": "plural of zinnia", "zoospermia": " (uncountable)The presence of live spermatozoa in the semen", "zygapophyseal": " (comparative more zygapophyseal, superlative most zygapophyseal)(anatomy) Of or pertaining to the zygapophysis.", "zikkurats": "plural of zikkurat", "zoogamy": " (uncountable)(zoology) The sexual reproduction of animals.", "zoo": " (plural zoos)A park where live animals are exhibited.2013 July 26,  Nick Miroff,  Mexico gets a taste for eating insects&#160;, in  The Guardian Weekly, volume 189, number 7, page 32:The San Juan market is Mexico City\\'s most famous deli of exotic meats, where an adventurous shopper can hunt down hard-to-find critters such as ostrich, wild boar and crocodile. Only the city zoo offers greater species diversity.(figuratively) Any place that is wild, crowded, or chaotic.The shopping center was a zoo the week before Christmas.", "zitherns": "plural of zithern", "zoisite": " (plural zoisites)(mineralogy) A mineral with orthorhombic crystals, Ca2Al3(SiO4)(Si2O7)O(OH).", "zila": " (plural zilas)A district or local division in Bangladesh.", "zoon": " (plural zoa or zoons)(biology)[1] An animal which is the sole product of a single egg.(biology)[1] Any one of the perfectly developed individuals of a compound animal.", "zaffir": "Alternative form of zaffre", "zonations": "plural of zonation", "zymic": " (not comparable)(chemistry) Pertaining to, or produced by, fermentation", "zoochlorella": " (plural zoochlorellas or zoochlorellae)Alternative form of zochlorella", "zymotic": " (not comparable)(pathology, now historical) Infectious, contagious, of diseases originally regarded as being caused by a process similar to fermentation.1997, Roy Porter, The Greatest Benefit to Mankind, Folio Society 2016, p. 394:Farr concluded that overcrowding was the main determinant of high mortality from what (following Liebig) he style zymotic diseases.Of or causing fermentation.", "zoopraxiscope": " (plural zoopraxiscopes)(photography, historical) An instrument developed by Eadweard Muybridge in the 1870\\'s, similar to the phenakistoscope. The instrument involves a disc that includes serial pictures being rotated in front of a light source, projecting them upon a screen, to exhibit the natural movements of animals and the like.", "zeppelin": " (plural zeppelins)Alternative letter-case form of Zeppelin", "zoonosis": " (plural zoonoses)An animal disease, such as rabies or anthrax, that can be transmitted to humans.2013 January 1,  Katie L. Burke,  Ecological Dependency, in  American Scientist[1], volume 101, number 1, page 64:In his first book since the 2008 essay collection Natural Acts: A Sidelong View of Science and Nature, David Quammen looks at the natural world from yet another angle: the search for the next human pandemic, what epidemiologists call the next big one. His quest leads him around the world to study a variety of suspect zoonosesanimal-hosted pathogens that infect humans.", "zygantrum": " (plural zygantra)(anatomy) zygosphene.", "zoophytologist": " (plural zoophytologists)One who studies zoophytology.", "zygomaticus": " (plural zygomatici)(anatomy) One of several small subcutaneous facial muscles arising from or in relation with the zygoma.", "zecchini": "plural of zecchino", "zoopsychologist": " (plural zoopsychologists)One who studies zoopsychology.", "zests": "plural of zestThird-person singular simple present indicative form of zest", "zygomaticofacial": " (not comparable)(anatomy) Relating to the zygomatic bone and face.", "zakat": " (uncountable)(Islam) Almsgiving, one of the five pillars of Islam.1958-1994, Hamilton Gibb &amp; CF Beckingham, in The Travels of Ibn Battutah, Folio Society 2012, p. 27:Amongst these stations is the well-known place called Qatya, where zakat is collected from the merchants, their goods are examined and their baggage most rigorously searched.", "zamang": " (plural zamangs)Alternative form of zaman (Albizia saman).1889,  Mayne Reid,  The Forest Exiles, page 259:The monkeys, after a short consultation, were seen scampering up the zamang.", "zygotene": " (plural zygotenes)(biology) The intimate pairing of homologous chromosomes during the synaptic stage of meiosis", "zenography": " (uncountable)The study of the planet Jupiter.", "zip": " (plural zips)The high-pitched sound of a small object moving rapidly through air.(informal) Energy; vigor; vim.(Britain, New Zealand) A zip fastener.(slang) Zero; nothing.I know zip about economics.A trip on a zipline.(computing, informal) A zip file.(slang) An ounce of marijuana.!The high-pitched sound of a small object moving rapidly through air. (third-person singular simple present zips, present participle zipping, simple past and past participle zipped)(transitive) To close with a zip fastener.(transitive, figuratively) To close as if with a zip fastener.zip one\\'s lip(transitive, computing) To compress (one or more computer files) into a single and often smaller file, especially one in the ZIP format.(intransitive) (followed by a preposition) To move rapidly (in a specified direction or to a specified place) with a high-pitched sound.The bullet zipped through the air.(intransitive, colloquial) (followed by a preposition) To move in haste (in a specified direction or to a specified place).Zip down to the shops for some milk.(transitive) To make (something) move quickly2011 December 27,  Mike Henson,  Norwich 0 - 2 Tottenham, in  BBC Sport[1]:Tottenham also initially struggled to create genuine goal-scoring opportunities, with Bale, Luka Modric and Rafael van der Vaart zipping passes around to little effect.To travel on a zipline. (plural zips)(US) A ZIP code; a US postal code.(US, by extension) Any postal code, for any country.", "zitherist": " (plural zitherists)Someone who plays the zither", "zoanthropy": " (uncountable)(medicine) A kind of delusion in which the patient believes himself transformed into one of the lower animals.[1]", "zincify": " (third-person singular simple present zincifies, present participle zincifying, simple past and past participle zincified)(transitive) To coat or impregnate with zinc.", "zealous": " (comparative more zealous, superlative most zealous)Full of zeal; ardent, fervent; exhibiting enthusiasm or strong passion.1791, James Boswell, The life of Samuel Johnson, new ed. (1831) by John Wilson Croker, volume 1, page 238:Johnson was truly zealous for the success of \"The Adventurer;\" and very soon after his engaging in it, he wrote the following letter:1896, Andrew Dickson White, A History of the Warfare of Science with Theology in Christendom (2004 edition), page 122:Doubtless many will exclaim against the Roman Catholic Church for this; but the simple truth is that Protestantism was no less zealous against the new scientific doctrine.1940, Foster Rhea Dulles, America Learns to Play: A history of popular recreation, 1607-1940, page 61:[] and there were few more zealous dancers at the fashionable balls in the Raleigh Tavern at Williamsburg.2011 April 4, \"Newt Gingrich,\" Time (retrieved 9 Sept 2013):Newt Gingrich . . . left Congress in 1998, following GOP midterm-election losses that many blamed on his zealous pursuit of Bill Clinton\\'s impeachment.", "zanzas": "plural of zanza", "zygotenes": "plural of zygotene", "zibet": " (plural zibets)(archaic) The large Indian civet, Viverra zibetha.", "zapped": "simple past tense and past participle of zap", "zagged": "simple past tense and past participle of zag", "zingiberene": " (uncountable)Wikipedia has an article on:zingibereneWikipedia(biochemistry) A monocyclic sesquiterpene, the predominant constituent of the oil of ginger.", "zygotes": "plural of zygote", "zoophysiology": " (uncountable)animal physiology", "zonated": " (not comparable)Synonym of zonate", "zabaione": " (countable and uncountable, plural zabaiones)Alternative form of zabaglione", "zoist": " (plural zoists)One who subscribes to the doctrine of zoism.", "zarf": " (plural zarfs)An ornamental container designed to hold a coffee cup and insulate it from the hand of the drinker.", "zoonomist": " (plural zoonomists)One who studies zoonomy.", "zygotically": " (not comparable)By means of, or in terms of, zygosis.", "zeniths": "plural of zenith", "zemstvo": " (plural zemstvos or zemstva)(now historical) A Russian district or provincial council, or elective local-governmental administrative division, founded in 1864 by Tsar Alexander the Liberator.1996, Orlando Figes, A People\\'s Tragedy, Folio Society 2013, p. 52:Two of Alexander III\\'s counter-reforms, in 1890 and 1892, greatly increased the governors\\' powers over the zemstvos and municipal bodies.", "zeroes": "plural of zero(rare) The decade of the 1800s, 1900s, 2000s, etc. The noughties. The 2000s.Third-person singular simple present indicative form of zero", "zipping": "present participle of zip", "zoosperms": "plural of zoosperm", "zoopathological": " (not comparable)Of or pertaining to zoopathology.", "zoocyst": " (plural zoocysts)A kind of encysted rhizopod resembling a sporocyst, except in the thickness and number of the protective layers.", "zoometry": " (uncountable)measurement of the bodies of animals", "zelatrice": " (plural zelatrices)(ecclesiastical) A zelatrix (nun).", "zoolithic": " (not comparable)Relating to zooliths.", "zakuski": "plural form of zakuska", "zeroed": "simple past tense and past participle of zero. Cf. also zeroized.", "zoophytological": " (not comparable)Of or pertaining to zoophytology.", "zabra": " (plural zabras)A small sailing vessel used off the coasts of Spain and Portugal.", "zoonitic": " (not comparable)Relating to a zoonite.", "zuffolo": " (plural zuffolos or zuffoli)Alternative spelling of zufolo", "zootheist": " (plural zootheists)One who worships animals.", "zoosporangial": " (not comparable)Of or pertaining to zoosporangia.", "zonation": " (plural zonations)An arrangement or distribution of things into zones.", "zinkiferous": " (comparative more zinkiferous, superlative most zinkiferous)Alternative spelling of zinciferous", "zoogony": " (usually uncountable, plural zoogonies)Alternative form of zoogeny", "zygodactylic": " (not comparable)(zoology) yoke-footed; having the toes disposed in pairs. Applied to birds which have two toes before and two behind, as the parrot, cuckoo, woodpecker, etc.", "zooplankton": " (countable and uncountable, plural zooplanktons)(zoology) Free-floating small protozoa, crustaceans (such as krill), etc. and the eggs and larvae from larger animals.", "zealotries": "plural of zealotry", "zap": " (plural zaps)(colloquial) A sound made by a sudden release of electricity or some similar energy.(colloquial) An electric shock.You might feel a little zap touching a metal doorknob when the air is dry.A raucous public demonstration designed to embarrass a public figure or celebrity as a form of political activism.1998, Raymond A. Smith, Encyclopedia of AIDSBlack AIDS activists were caught in the middle of a nearly yearlong series of zaps.2011, Michael Schiavi, Celluloid Activist: The Life and Times of Vito Russo (page 84)When a zap at Brooklyn\\'s Board of Education opened no dialogue on discrimination suffered by gay teachers, GAA targeted the BOE offices on April 13. (third-person singular simple present zaps, present participle zapping, simple past and past participle zapped)To make a zapping sound.To use a remote control to repeatedly change channels on a television.To strike (something or someone) with electricity or energy, as by shooting.They spent the whole movie zapping bad guys into oblivion.To damage (especially electronics) with electrostatic discharge.I think they zapped the processor.To heat (something) in a microwave oven.If it\\'s not warm in the middle, zap it some more.To delete or discard (electronic media).They zapped a lot of files before realizing they had not backed up lately.To further energize or charge (magnetic material).They zapped my motor\\'s magnets.!Representing the sound or action of a zap.Then the computer went zap and I lost all my work.", "zinked": "simple past tense and past participle of zinc", "zorillas": "plural of zorilla", "ziega": " (uncountable)(archaic) Curd produced from milk by adding acetic acid, after rennet has ceased to cause coagulation.", "zonked": " (comparative more zonked, superlative most zonked)(slang) Extremely fatigued.After eighteen hours of proofreading, I was completely zonked.(slang) Deeply asleep.I must have been really zonked. They said it took fifteen minutes to wake me up.(slang) Drunk.1974, New York Magazine (volume 7, number 27, July 1974)[] swingers in the audience were getting zonked on beer and fresh sea breezes and sound []2004, Ed Sanders, Tales of beatnik glory[] playing eight-ball while zonked, chugging beer with locals []", "zaffar": "Alternative form of zaffre", "zareebas": "plural of zareeba", "zho": " (plural zhos)Alternative spelling of dzo", "zincifying": "present participle of zincify", "zaffres": "plural of zaffre", "zydeco": " (uncountable)Wikipedia has an article on:zydecoWikipediaA form of Louisiana Creole music, characteristically performed by accordion and washboard bands, that combines Cajun and Creole roots music with elements of African American music.", "zygosphere": " (plural zygospheres)(botany) A plant\\'s gamete which can form a zygospore by uniting with a similar one.", "zelant": " (plural zelants)(obsolete) A zealot.", "zee": " (plural zees) (chiefly US, Newfoundland, sometimes Canada)The name of the Latin-script letter Z/z.Something Z-shaped. Found in compounds such as zee-bar.(colloquial) (usually plural) Sleep (as in \"get some zees\"). (third-person singular simple present zees, present participle zeeing, simple past and past participle zeed) (chiefly US, Newfoundland)(intransitive, informal) To sleep or nap. (Compare zzz, catch some z\\'s.)(intransitive, rare) To zigzag; to move with sharp alternating turns.Eye dialect spelling of the, representing primarily French-accented English.", "zebus": "plural of zebu", "zoografting": " (uncountable)zooplasty", "zwieselite": " (uncountable)(mineralogy) A brown to black mineral containing manganese, iron, phosphorus, oxygen, and fluorine.", "zingiberaceous": " (not comparable)zinziberaceous", "zeros": "plural of zero Two or more zero digits.The decade of the 1800s, 1900s, 2000s, etc. The noughties. The 2000s.", "zipless": " (not comparable)Without a zip fastener.1994, Jeff Torrington, Swing hammer swing!\"The patient was almost certainly saved by his zipless zoot suit,\" said a genial surgeon.2006, Anthony McDonald, AdamNo longer in muddy, zipless, trousers, Sylvain wore blue denims [](informal, figuratively) Without complications and hindrances.2002, Francisco Valdes, Jerome M Culp, Angela P Harris, Crossroads, Directions, and a New Critical Race TheoryErica Jong\\'s words regarding the zipless encounter applied completely to my white classmates\\' actions on that school bus []2004, Jane Isenberg, Hot on the Trail[] wedding planners who would check out venues, prices, caterers and all that stuff and then put it together for us, so it would be a zipless wedding.2007, James Day, Queer sexualities in French and Francophone literature and filmAnd yet this screen presence, going well beyond the literary, is the illusion that the world is like that, that sex is indeed zipless []", "zemindars": "plural of zemindar", "zincate": " (plural zincates)(chemistry) any salt formally derived from zinc oxide or hydroxide by combination with a more electropositive element", "zymoscope": " (plural zymoscopes)a zymometer", "zealotism": " (usually uncountable, plural zealotisms)The character or conduct of a zealot; zealotry.", "zonda": " (plural zondas)A hot, dry wind of the Andes.", "zoonomy": " (uncountable)(zoology) The laws of animal life, or the science dealing with the phenomena of animal life and their causes and relations.", "zirkelite": " (usually uncountable, plural zirkelites)(mineralogy) An isometric oxide mineral with the chemical formula (Ca,Th,Ce)Zr(Ti,Nb)2O7.", "zein": " (countable and uncountable, plural zeins)A protein derived from corn/maize, having many industrial applications.", "zep": " (plural zeps)(US, dialectal) A certain type of submarine sandwich1991,  Jerry Spinelli,  Dump Days[1], page 10:Anywhere else, it might be called a hoagie, or a sub, or a hero. In Two Mills it\\'s a zep. And even though at first it might look like the others, it\\'s not. Like, you\\'ll never find lettuce on a zep. Or mayonnaise.", "zymologic": " (comparative more zymologic, superlative most zymologic)Of or pertaining to zymology; zymological.", "zooks": "(archaic) Synonym of gadzooksAlain Ren Le Sage, The Adventures of Gil Blas of Santillane (translated by Tobias Smollett)Zooks! he is a man of great delicacy on these occasions. He is none of those fashionable youngsters, who are apt to take up from every body.1749, Henry Fielding, The History of Tom Jones, a FoundlingThe squire gave him a good curse at his departure; and then turning to the parson, he cried out, \"I smoke it: I smoke it. Tom is certainly the father of this bastard. Zooks, parson, you remember how he recommended the veather o\\' her to me. Dn un, what a sly bch \\'tis. Ay, ay, as sure as two-pence, Tom is the veather of the bastard.\"", "zoophytal": " (not comparable)Of or pertaining to the zoophytes.", "zingiest": "superlative form of zingy: most zingy", "zoophorus": " (plural zoophori)The frieze of a column, especially one decorated with animals.", "zenith": " (plural zeniths)(astronomy) The point in the sky vertically above a given position or observer; the point in the celestial sphere opposite the nadir.Antonyms: nadir, perigee1638 Herbert, Sir Thomas Some years travels into divers parts of Asia and AfriqueThe 12 day wee had the wind high and large o that in two dayes aile we made the Sunne our Zenith or verticall point [] 16711693: Rev. Thomas Jolly, private notebook; printed in: 1895, Henry Fishwick (editor), The Note Book of the Rev. Thomas Jolly: A.D. 16711693. Extracts from the Church Books of Altham and Wymondhouses, 16491725. And an Account of the Jolly Family of Standish, Gorton, and Altham, page 44In this 10th m. appeared that prodigious Comett the tayl whereof was like the blade of a double edged sword, and reached almost from the horizon to the zenith.1938, Xavier Herbert, Capricornia, New York: D. Appleton-Century, 1943, Chapter XI, p. 180, [1]In the east a pillar of cloud reared from horizon to zenith, with a kind of arm outstretched like a threatening colossus.(astronomy) The highest point in the sky reached by a celestial body.1719- Daniel Defoe, Robinson Crusoe[] in the middle of the day, when the sun was in the zenith, the violence of the heat was too great to stir out [] 1920, Peter B. Kyne, The Understanding Heart, Chapter II:As far to the west as Monica could see, her world was a sea of fog, [] . Above it arched a cerulean sky; as the sun climbed to the zenith, [] , the fog gradually took on a bluish tinge.(by extension) Highest point or state; peak.Synonyms: acme, apogee, culmination, pinnacleShakespeareI find my zenith doth depend upon / A most auspicious star.MacaulayIt was during those civil troubles [] this aspiring family reached the zenith.1900,  William Beckford,  The History of the Caliph Vathek[2], page 173:\"There for a while I enjoyed myself in the zenith of glory and pleasure.\"", "zoaria": "plural of zoarium", "zizit": "Alternative form of tsitsith", "zoned": "simple past tense and past participle of zone", "zincide": " (plural zincides)(chemistry) Any binary compound of zinc.", "zealously": " (comparative more zealously, superlative most zealously)Like a zealot; with zealotry.", "zippier": "comparative form of zippy: more zippy", "zoopsychology": " (uncountable)The study of psychology in animals.", "zoogloeas": "plural of zoogloea", "zagaie": " (plural zagaies)Archaic form of assegai.", "zadruga": " (plural zadrugas or zadruge)A social unit of rural community among the South Slavs, associated with family links and set customs.2007, Elizabeth Roberts, Realm of the Black Mountain, Hurst &amp; Co. 2007, pp. 7-8:Byzantine culture was forced to retreat in the face of a way of life based on the extended family commune or zadruga, which was further organised around loose tribal areas known as upanije.", "zymoplastic": " (comparative more zymoplastic, superlative most zymoplastic)That converts a substance (such as a proenzyme) into an enzyme", "zincified": "simple past tense and past participle of zincify", "zizith": " (plural ziziths)Alternative form of tzitzit", "zoogeographic": " (not comparable)Pertaining to zoogeography.", "zlote": "plural of zloty", "zeugmas": "plural of zeugma", "zoanthoid": " (not comparable)Of or pertaining to the Zoanthacea.", "zoologies": "plural of zoology", "zs": "&#160;pl (plural only)plural of zAlternative form of z\\'s (sleep)It\\'s getting late: it\\'s time to catch some zs.", "zymoid": " (comparative more zymoid, superlative most zymoid)(obsolete) Resembling a zymin or ferment (enzyme)", "zeta": " (plural zetas)The sixth letter of the modern Greek alphabet ( (Z),&#160; (z)) preceded by epsilon ( (E),&#160; (e)) and followed by eta, ( (I),&#160; (i)); or the seventh letter in the ancient Greek alphabet, in which it is preceded by digamma ( (W),&#160; (w))(mathematics) A mathematical function formally known as the Riemann zeta function.Zeta of 3 is irrational", "zingari": "plural of zingaro", "zedoaries": "plural of zedoary", "zoologic": "zoological", "zona": " (plural zonas or zonae or zon)(sciences) A zone or band; a layer. (plural zonas)A species of silverside fish (Atheriniformes), Bedotia geayi, from Madagascar, also called red-tailed silverside.", "zephyr": " (plural zephyrs)A light wind from the west.1671, R. Bohun, A Discourse Concerning the Origine and Properties of Wind, Oxford: Tho. Bowman, pp. 149-150,[1]The Western [winds] have been Counted the mildest, &amp; most Auspicious of all others; and were so highly in favour with the Poets, that they thought them worthy of the Golden Age, and to refresh the Elysian groves. [] But though the Breathing Zephyrs are so much celebrated in Poems and Romances, and happily were kinder to the delicious countries of Italy, &amp; Greece, yet wee find no lesse malignity in their natures from particular accidents and climats, then what wee have observd of other Winds.Any light refreshing wind; a gentle breeze.c. 1609, William Shakespeare, Cymbeline, Act IV, Scene 2,[2]O thou goddess,Thou divine Nature, how thyself thou blazonstIn these two princely boys! They are as gentleAs zephyrs blowing below the violet,Not wagging his sweet head []1796, John Gabriel Stedman, Narrative, of a five years expedition against the Revolted Negroes of Surinam, London: J. Johnson, Volume I, Chapter 2, p. 31,[3]The easterly or trade winds, which generally blow between the Tropics, are extremely refreshing to the coast of Guiana, between the hours of eight or ten in the morning, and six oclock in the evening, when they cease to operate, and a zephyr is scarcely ever heard to whisper during the night.1835,  William Gilmore Simms,  The Partisan, Harper, Chapter XI, page 135:The dusk of evening came on, soft in its solemnity, and unoppressive even in its gloom, under the sweet sky and unmolested zephyr, casting its pleasant shadows along the edges of the grove.1851, Herman Melville, Moby-Dick, Chapter 2,[4]It stood on a sharp bleak corner, where that tempestuous wind Euroclydon kept up a worse howling than ever it did about poor Pauls tossed craft. Euroclydon, nevertheless, is a mighty pleasant zephyr to any one in-doors, with his feet on the hob quietly toasting for bed.Anything of fine, soft, or light quality, especially fabric.1895, H. G. Wells, The Wonderful Visit, Chapter 10,[5]The world hummed and spun about him. There was a whirling of zephyr skirts, four impassioned faces sweeping towards the open door of the passage that ran through the vicarage. He felt his position went with them. (third-person singular simple present zephyrs, present participle zephyring, simple past and past participle zephyred)(intransitive, poetic) To blow or move like a zephyr, or light breeze.1879, Robert Stephen Hawker, An Inscription for an Aged Oak in The Poetical Works, London: The Bodley Head, p. 171,[6]There was a timeWhen the soft zephyring spring came joyfully,Like a young bride, with bloom upon her cheek1908, Clarence E. Mulford, The Coming of Hopalong Cassidy, New York: Grosset &amp; Dunlap, Chapter 4, p. 60,[7]There was a sudden scrambling and thumping overhead and hot exclamations zephyred down to them.1922, Thomas Hardy, An Experience in Late Lyrics and Earlier with Many Other Verses, London: Macmillan, p. 111,[8]But there was a new afflationAn aura zephyring round,That care infected not:(transitive, poetic) To blow or blow on gently like a zephyr; to cool or refresh with a gentle breeze.1849, letter from Leonidas Lent Hamline dated 15 December, 1849, in Walter Clark Palmer, Life and Letters of Leonidas L. Hamline, D.D., New York: Carlton &amp; Porter, 1866, Chapter 15, p. 361,[9]He was a fragrant poison, a zephyred pestilence spread through all the city.1914, Leonard Lanson Cline, untitled sonnet in Poems, Boston: The Poet Lore Company, p. 76,[10]Ah, but the skies are joyous in the spring,From dawn to dusk exuberantly blue;White-tufted oftentimes with clouds that doBut wanton in heavens zephyred merrying!1914, Juliane Paulsen (pseudonym of Juliane Grace Hansen), Poppy Fantasy in And Then Came Spring, Boston: The Gorham Press, p. 49,[11]Oh, graciously she led my soul withinWhere ever and forever went a windIn zephyred streams of poppies coursing sweetAbout the place, and waves of poppy heatAbout us there.", "zebrass": " (plural zebrasses)A zeedonk.", "zek": " (plural zeks)A prisoner at a Russian prison, especially (historical) at a Soviet labour camp. [from 20th c.]1988, Stefani Hoffman, translating Natan Sharansky, Fear No Evil, p. 235:Every prisoner who recants is a potential influence on other zeks to do likewise.2004, Jason Burke, The Observer, 8 Feb 2004:There are the zeks, the survivors of the gulags, some honest about their experiences, others still deluded or traumatised decades later.", "zoophytology": " (uncountable)The natural history of zoophytes.", "zonoid": " (plural zonoids)(mathematics) A vector sum of line segments", "zygomas": "plural of zygoma", "zedoary": " (countable and uncountable, plural zedoaries)Curcuma zedoaria, a perennial herb native to India and Indonesia.", "zaddikim": "plural of zaddik", "zootrophic": " (not comparable)(physiology) Of or pertaining to the nourishment of animals.", "zante": "Alternative form of zantewood", "zoolatry": " (uncountable)The worship of animals.2004, Simson R Najovits, Egypt, Trunk of the Tree: A Modern Survey of an Ancient Land, ISBN, p. 227:Excessive zoolatry and heka practices had always been fundamental aspects of Egyptian religion and lifestyles, but from about the Late Period (c. 747 BC), they increasingly became tinged with fundamentalism and fanaticism.", "zombies": "plural of zombie", "zirconoid": " (plural zirconoids)(crystallography) A double eight-sided pyramid, a form common with tetragonal crystals.", "zoosporic": " (not comparable)Having or pertaining to zoospores.", "zested": "simple past tense and past participle of zest", "zocco": " (plural zoccos)(architecture) Synonym of socle", "zonoskeleton": "(embryology) Part of the skeleton of a limb, comprising the scapula, clavicle, and hip bone.", "zunyite": " (uncountable)(mineralogy) A fluorosilicate mineral of alumina occurring in tetrahedral crystals, chemical formula Al13Si5O20(OH,F)18Cl.", "zygoma": " (plural zygomas or zygomata)(anatomy) The cheekbone.", "zyzzyva": " (plural zyzzyvas)A tropical American weevil of the genus Zyzzyva.1976,  Stevens, Edward,  The Religion Game, American Style[1], New York: Paulist Press, ISBN, LCCN 76009367, OL 4880944M, page 87:A zyzzyva is a weevil of the genus Zyzzyva.2003 May 30,  Swaminathan, Kalpana,  Ambrosia for Afters[2], New Delhi; New York: Penguin Books, ISBN, LCCN 2003323560, OCLC 54529400, OL 3716564M, page 43:Against the Yak, the zyzzyva zipsHe yammers, has yaws, he yawns and he yips2007 August 30,  Mann, Otto,  King Size, Lulu.com, ISBN, page 118:Everything on earth has an end, for your mortally thin dictionary, the tropical, American weevil, the Zyzzyva.2010 September 7,  Daheim, Mary,  Loco Motive: A Bed-and-Breakfast Mystery, First edition, HarperCollins, ISBN, LCCN 2010011922, OL 24085984M, page 240:No wonder you wanted to look it up. A zyzzyva is a weevil.", "zymogens": "plural of zymogen", "zoonomic": " (not comparable)Of or pertaining to zoonomy.", "zoologizing": "present participle of zoologize", "zygotoblast": " (plural zygotoblasts)An undeveloped sporozoan produced by multiple fission of a zygote", "zanders": "plural of zander", "zaptieh": " (plural zaptiehs)A Turkish policemanThe zaptieh was of the opinion I could do no better than pay my respects to the Bishop of the Greek Orthodox Church.", "zootypic": " (not comparable)Relating to zootype.", "zati": " (plural zatis)Macacus pileatus, a macaque native to India and Ceylon with a crown of long erect hair.", "zigzags": "plural of zigzagThird-person singular simple present indicative form of zigzag", "zoogeographer": " (plural zoogeographers)A person involved in zoogeography.", "zoa": "plural of zoonplural of zon", "zygapophysial": " (not comparable)Of or pertaining to zygapophysis.", "zithern": " (plural zitherns)A zither1876 August,  Characteristics of the International Fair, in  The Atlantic Monthly, page 237:The zitherns and mandolins have forms to match their pretty names, but the soul of the musical instrument abides elsewhere than in its body, and informs it only to the ear.", "zoolater": " (plural zoolaters)A worshipper of animals", "zaptiehs": "plural of zaptieh", "zizzle": " (third-person singular simple present zizzles, present participle zizzling, simple past and past participle zizzled)Synonym of sizzle1950, Rodney L. de B. Walkerley, Motoring Abroad (page 152)Water ran slap across the roadway from the hillsides and every few seconds the scene jumped into light and was gone again as the lightning zizzled through the clouds above.2001, Gene Gach, Honestly! (page 136)The fuse was lit and zizzling away; champagne, skyrockets, pinwheels and finally The Great Whiz-Bang; my back arched, my hands twisted around her soft silken hair.2008, Margot Starr Kernan, Secret Passages (page 79)Billy and I joined forces to pick on my sweet younger sister Lisaonce we had her electrocute worms by putting them into a peashooter and sticking them into an open light socket, which zizzled and sparked as the poor worms were fried.", "zloty": " (plural zloty or zlotys or zlote or zlotych or zloties)zoty, the currency unit of Poland, divided into 100 groszy.", "zygodactylous": " (not comparable)(ornithology) Having two toes pointing forward, and two toes pointing backward.", "zoophyte": " (plural zoophytes)(biology, now historical) An animal thought to have the characteristics of a plant, later specifically an invertebrate of the (former) group Zoophyta, comprising sponges, corals and sea anemones. [from 17th c.](biology, now historical) A plant believed to have the characteristics of an animal, especially a sensitive plant or vegetable lamb. [from 17th c.]1665, Robert Hooke, Micrographia, XIX:And besides, as there are many Zoophyts, and sensitive Plants [] so have we, in some Authors, Instances of Plants turning into Animals, and Animals into Plants, and the like [].", "zestiest": "superlative form of zesty: most zesty", "zamarra": " (plural zamarras)sheepskinA sheepskin coat worn in parts of Spain", "zarnich": " (uncountable)Alternative form of zarnec", "zirconium": " (countable and uncountable, plural zirconiums)A metallic chemical element (symbol Zr) with an atomic number of 40.", "zorils": "plural of zoril", "zaftig": " (comparative more zaftig, superlative most zaftig)(US, colloquial) Of a woman, having a plump and sexually attractive figure; voluptuous, well-proportioned; large.1980, Washington Journalism Review, Volume 2,Sportcasters are drawn from three different talent pools. Some are professional media people, others are ex-coaches and the most zaftig lot are ex-players.1996, Gay Morris, 9: \"Styles of the Flesh\": Gender in the Dances of Mark Morris, Gay Morris (editor), Moving Words: Re-Writing Dance, page 152,Mrs Stahlbaum, a much more zaftig figure than the Housekeeper, wears a strawberry blonde wig with bangs, her hair tied back in a bun.2000 January 22,  D.C. 90210, in  Time[1]:1995 Clinton has his first sexual encounter with zaftig intern Lewinsky.2011, Marlene Zuk, Sex on Six Legs: Lessons on Life, Love, and Language from the Insect World, page 156,And being fatter at the outset meant you had more to offer; scrawnier mothers were consumed sooner than their more zaftig counterparts, which then meant that the young spiders were less likely to turn from their parent to an arguably even more unsavory occupation: eating each other.", "zoftig": " (comparative more zoftig, superlative most zoftig)Alternative spelling of zaftig1998, Peter Biskind, Easy Riders, Raging Bulls, Bloomsbury 1999, p. 132:Short and zoftig, she wore muumuus and rose-tinted, oversize glasses, was loud, abrasive, and very funny.", "zopilote": " (plural zopilotes)A New World vulture of the family Cathartidae, especially the black vulture (Coragyps atratus).2016,  Lawrence Swaim,  Dangerous Pilgrims:I was laying absolutely still in the cab of the wrecked truck I had the crazy idea that if I did not move, I would bleed lessand I looked out of the hole where the windshield had been and saw a zopilote perched on the hood of the truck.", "zizania": " (plural zizanias)Any of several aquatic North American grasses, of the genus Zizania, grown for their edible grain; wild rice.", "zoaea": " (plural zoaeae or zoaeas)(zoology) A larval stage of development in crustaceans, especially decapods such as crabs, characterized by spines on the carapace and rudimentary thoracic and abdominal limbs.", "zecchins": "plural of zecchin", "zombiism": " (uncountable)The condition of being a zombie.", "zebecks": "plural of zebeck", "zootype": " (plural zootypes)(biology) A proposed archetype of the form of all animals, based not on a shared body plan but on conserved molecular homologies.(symbology) An animal totem; an animal (or animal figure) that is taken as symbolic of a deeper abstraction.", "zed": " (plural zeds) (chiefly Commonwealth)The name of the Latin-script letter Z/z.Something Z-shaped. Found in compounds such as zed-bar.(colloquial) (usually plural) Sleep (as in \"get some zeds\").(slang) A zombie.A horde of zeds began to shuffle into the shopping mall. (third-person singular simple present zeds, present participle zedding, simple past and past participle zedded) (chiefly Britain, Australia, New Zealand, Canada, Ireland, South Africa)(intransitive, informal) To sleep or nap. (Compare zzz, catch some z\\'s.)1991, Jim Cartwright, BedZedding hogs. Sleep sippers and spitters. Look at \\'em cooking in their own snoring heat. One nose after another.1992, David Robins, Tarnished vision: crime and conflict in the inner cityI guess I must have zedded, for I find a police officer, the same one that nicked me, shaking me.2007, Polly Williams, The Yummy Mummy\"Zedding away.\" \"God, I was having the most awful dream. That you\\'d got lost by the sea and I couldn\\'t find you and something was chasing me, me and Evie.\"(intransitive, rare) To zigzag; to move with sharp alternating turns.1931, Reginald Rankin, The Collected Works of Lt. Colonel Sir Reginald RankinWe were zedding hell-bells up the hill towards Cervione, with a bank of road metal and a precipice on our left...1994, Tibor Fischer, The thought gangLicking his lips, his hand zedded on my thigh and he commented, penetratingly, that it wasn\\'t pussy, but that driving the unmade road wasn\\'t at all bad.", "zabtie": " (plural zabties)Archaic form of zaptieh.", "zygodactyle": " (not comparable)Alternative form of zygodactyl (plural zygodactyles)Alternative form of zygodactyl", "zirconic": " (not comparable)Pertaining to, or composed of zirconium or zircons", "zoosperm": " (plural zoosperms)(biology) One of the spermatic particles; spermatozoid, spermatozoon.", "zorilla": " (plural zorillas)Alternative spelling of zorille", "zooming": "present participle of zoom (plural zoomings)A sound or motion that zooms.Donald FriendThen back to camp to a night of great discomfort and no sleep: for one thing, the adjacent aerodrome was busy, and the whole night was hideous with roarings and zoomings of planes landing and taking off, a sinister sound at any time []", "zippered": "simple past tense and past participle of zipper (not comparable)Fitted with a zipper.a zippered flight suit", "zooparasitic": " (not comparable)Being or pertaining to a zooparasite.", "zemni": "(archaic) Podolsk mole-rat (Spalax zemni)", "zitis": "plural of ziti", "zemindary": " (plural zemindaries)Alternative form of zamindari", "zagging": "present participle of zag", "zabaiones": "plural of zabaione", "zygomaxillary": " (not comparable)(anatomy) Relating to the cheekbone and maxilla.", "zincotype": " (plural zincotypes)(historical) A photographic print produced by coating zinc with bitumen, gelatin, etc. and exposing it under a negative.", "zonal": " (comparative more zonal, superlative most zonal)Divided into zones.Related to, associated with, or similar to zones.Roughly longitudinal movement of air or ocean currents (east to west, or west to east).", "zippering": "present participle of zipper", "zelator": " (plural zelators)A zealot; the male counterpart of a zelatrix.", "zoosterol": " (plural zoosterols)(biochemistry) Any sterol found in animal tissue", "zemstva": "plural of zemstvo", "zeunerite": " (plural zeunerites)(mineralogy) A mineral with tetragonal crystals, of the autunite group, Cu2+(UO2)2(AsO4)24H2O.", "zincous": " (not comparable)Of, pertaining to, or containing, zinc.zincous salts", "zephyry": " (comparative more zephyry, superlative most zephyry)zephyrlike", "zebrinnies": "plural of zebrinny", "zootechnic": " (not comparable)Of or pertaining to zootechny.", "zlotys": "plural of zloty", "zibeth": " (plural zibeths)Alternative form of zibet", "zerumbet": " (uncountable)(archaic) The rhizome of Zingiber zerumbet, a Javanese plant resembling ginger.", "zooscopy": " (uncountable)The scientific observation of living animals.A form of hallucination in which the sufferer believes he/she sees animals.", "zircofluoride": " (plural zircofluorides)(chemistry) A double fluoride of zirconium and hydrogen, or some other positive element or radical.", "zyga": "plural of zygon", "zing": " (plural zings)A short high-pitched humming sound, such as that made by a bullet or vibrating string.1998 March 15,  Edward E. Leslie,  Desperate Journeys, Abandoned Souls, Mariner Books, ISBN, OL 7468582M, page 387:I heard a zing close to my head and looked up again. Five or six men were lined up on the deck above me with rifles shooting at the shark.A witty insult or derogatory remark.(uncountable) Zest or vitality.2006 May 25,  Melinda Houston,  European Bier Cafe - Bar Reviews, in  The Age[1]:To accompany a meal, the fresh Italian lager Poretti is perfect; Erdinger Weisbier, a wheat beer from Germany, is full of zing;(uncountable, slang) Pleasant or exciting flavour of food. (third-person singular simple present zings, present participle zinging, simple past and past participle zinged)To move very quickly, especially while making a high-pitched hum.2000,  Nick Nelson,  The Golden Vortex, Conscious Publishing, ISBN, OL 8949607W, page 89:We are all a second or two older than an astronaut who has been zinging around the Earth at 18000 miles per hour, because of his or her greater speed and the lack of gravity.(onomatopoeia) A high pitched humming sound.1934,  James F. Hanley (music),  Zing! Went the Strings of My Heart:Something inside of me started a symphony / Zing! Went the strings of my heart(US, slang) Used to acknowledge a witty comeback, a zinger.2002,  Chellie Campbell,  The Wealthy Spirit, Sourcebooks, ISBN, OL 8698152M, page 162:Zing! The joke had rebounded back on the one who started it. \"Ouch!\" Mama Jane winced ruefully. We all dissolved in laughter at the good-natured repartee.", "zygodont": " (not comparable)Having or relating to molar teeth whose cusps are paired.", "zygenid": " (not comparable)Of or pertaining to moths in the family Zygaenidae. (plural zygenids)(zoology) Any one of numerous species of moths of the family Zygaenidae, most of which are bright colored.", "zirconia": " (countable and uncountable, plural zirconias)(chemistry) The oxide of zirconium, obtained as a white powder, and possessing both acid and basic properties. On account of its infusibility, and brilliant luminosity when incandescent, it is used as an ingredient of sticks for the Drummond light.", "zygogenetic": " (not comparable)Relating to zygogenesis.", "zoogonidium": " (plural zoogonidia)A gonidium that contains spores", "zoograft": " (plural zoografts)A surgical graft of tissue from an animal to a human.", "zequin": " (plural zequins)Alternative spelling of zecchin", "zipped": "simple past tense and past participle of zip", "zealed": " (comparative more zealed, superlative most zealed)(obsolete) Full of zeal.1808, Raphael Holinshed, Chronicles of England, Scotland and Ireland: Volume 3 (page 1008)Beside these, there is another sort of men desirous of aduantage, and disdainefull of our wealth, whose greefe is most our greatest hap, and be offended with religion, bicause they be drowned in superstition, men zealed toward God, but not fit to judge...", "zoochemistry": " (uncountable)Animal chemistry; particularly, the description of the chemical compounds entering into the composition of the animal body, in distinction from biochemistry.2013, Gilbert Gottlieb, Behavioral EmbryologyIn 1865, he did advanced study in Zoophysics and Zoochemistry while on the Philosophical Faculty at the University of Bonn, and he received his medical degree in 1866.", "zincates": "plural of zincate", "zaffer": " (countable and uncountable, plural zaffers)Alternative form of zaffre", "zemi": " (plural zemis)Any of various local deities, human or animal and represented by small idols, once worshipped by the Caribbean peoples of the Taino culture.", "zygote": " (plural zygotes)A fertilized egg cell.", "zymurgy": " (uncountable)The chemistry of fermentation with yeasts, especially the science involved in beer and wine making.", "zat": "Eye dialect spelling of that. (usually signifying a foreign accent, often French).2009, Sue Limb, Girl, Barely 15: Flirting for England, page 195:Marie-Louise emerged from the girls\\' tent, wrapped in a fleece. She sat down by Jess. \"It is wonderfool now zat Jodie is feelingue bettair,\" she said.", "zoology": " (countable and uncountable, plural zoologies)That part of biology which relates to the animal kingdom, including the structure, embryology, evolution, classification, habits, and distribution of all animals, both living and extinct.A treatise on this science.", "zygozoospore": " (plural zygozoospores)(botany) A spore formed by the union of several zoospores.", "zit": " (plural zits)(US, slang) pimple1968, J. Lawrence Hagen, \"Pinball 1959\", Generation volume 2021, page 182:I can\\'t help thinking how little good all that working out did him. I think the only thing he ever got out of it was more zits.1987Adventures in Babysitting, 00:06:35:Brad: Sara, did you take my Clearasil again? Sara: I ran out of brown (paint). Brad: Great. How am I supposed to cover up my zits?", "zoomelanin": " (uncountable)(physiological chemistry) A pigment giving the black color to the feathers of many birds.", "zygophyllaceous": " (not comparable)(botany) Of or relating to the Zygophyllaceae.", "zoogleal": " (not comparable)Alternative form of zoogloeal", "zoogeographically": " (not comparable)In a zoogeographical way.", "zymurgies": "plural of zymurgy", "zingy": " (comparative zingier, superlative zingiest)(informal) Full of zest.1991, Howard Karren, The Premiere guide to movies on videoIn the early drafts of the zingy script (by Charles Lederer), the visitor was to have been considerably more outre, but apparently the special effects folks weren\\'t up to the job []", "zygomata": "plural of zygoma", "zander": " (plural zanders or zander)A European freshwater fish in the family Percidae, closely related to the perch, Sander lucioperca.Any fish of the genus Sander that live in freshwater.", "zonulas": "plural of zonula", "zineb": " (countable and uncountable, plural zinebs)An organic fungicide and insecticide sprayed on cereal grasses, fruit trees, etc.", "zoomancy": " (uncountable)divination by means of animals1888, H. P. Blavatsky, The Secret Doctrine: The Synthesis of Science, Religion and Philosophy, The Theosophical Publishing Company, Limited (1888), pages 362-363:Yet why should so many generations have believed in divination by birds, and even in zoomancy, said by Suidas to have been imparted by Orpheus, who taught how to perceive in the yoke and white of the egg, under certain conditions, that which the bird born from it would have seen around it during its short life.1994, Michael David Cooperson, The Heirs of the Prophets in Classical Arabic Biography, page 207:The speech takes the form of a zoomancy, with no act of zoomancy in evidence.2004, Marc Kalinowski, \"Technical Traditions in Ancient China and Shushu Culture in Chinese Religion\", in Religion and Chinese Society (ed. John Lagerwey), Chinese University Press (2006), ISBN, page 224:[] these are mainly writings of a technical nature: scribes\\' registers on ritual divination by turtle and milfoil, calendars, manuals of hemerology, astrology, meteoromancy and Yijing divination, treatises on medicine, macrobiotics, and zoomancy.", "zooids": "plural of zooid", "zoomagnetic": " (not comparable)Relating to or exhibiting zoomagnetism.", "zionists": "plural of zionist", "zygodactylae": "&#160;pl (plural only)The zygodactylous birds. In a restricted sense, applied to a division of birds which includes the barbets, toucans, honey guides, and other related birds.", "ziggurats": "plural of ziggurat", "zebrafish": " (plural zebrafishes or zebrafish)A small striped fish, Danio rerio, originally from India but now common as an aquarium fish and as a subject of genetic experiments.2002 Lilianna Solnica-Krezel - Pattern Formation in ZebrafishUse of the GAL4-UAS technique for targeted gene expression in the zebrafish.", "zooplanktonic": " (not comparable)Of or pertaining to zooplankton.", "zymin": " (plural zymins)(obsolete) An enzyme, especially one used medicinally.", "zillahs": "plural of zillah", "zareeba": " (plural zareebas)Alternative spelling of zariba", "zinnia": " (plural zinnias)Any of several brightly coloured flowering plants, of the genus Zinnia, native to tropical America; a href=\"/wiki", "zygophyte": " (plural zygophytes)(botany) Any plant of a proposed class or grand division in which reproduction consists in the union of two similar cells.", "zosteriform": " (comparative more zosteriform, superlative most zosteriform)Resembling herpes zoster", "zithers": "plural of zither", "zaxes": "plural of zax", "zanyish": " (comparative more zanyish, superlative most zanyish)Somewhat zany.", "zietrisikite": " (usually uncountable, plural zietrisikites)Wikipedia has an article on:zietrisikiteWikipedia(mineralogy) A mineral wax resembling ozocerite.", "zoeae": "plural of zoea", "zooplasty": " (plural zooplasties)the surgical grafting of tissue from an animal to a human; zoografting", "zoetropic": " (comparative more zoetropic, superlative most zoetropic)Of, pertaining to, or reminiscent of a zoetrope.", "zonules": "plural of zonule", "zimb": " (plural zimbs)(archaic) An Ethiopian horsefly of the genus Pangonius, destructive to livestock.1840, Robert Montgomery Martin, Colonial magazine and commercial-maritime journal: Volume 3 (page 155)The illustrious Bruce and others imagine, that in the zimb of Abyssinia they recognize the fly plague which afflicted the Egyptians.1854, Samuel Griswold Goodrich, A history of all nations, from the earliest periods to the present time (volume 2, page 608)The zimb-fly sometimes depopulates whole territories, causing man and beast to fly from the lowlands into the mountains or the desert. Both the scorpion and locust infest the country.", "zygomatic": " (comparative more zygomatic, superlative most zygomatic)Pertaining to the zygoma.1970: They show (1) the left orbit and zygomatic arch of President Kennedy magnified from Zapruder frame 230  JG Ballard, The Atrocity Exhibition", "zillionth": " (not comparable)(informal) The ordinal form of the number zillion. (plural zillionths)(informal) The person or thing in the zillionth position.(informal) One of a zillion equal parts of a whole.", "zemindari": " (plural zemindaris)Alternative form of zamindari", "zoophily": " (uncountable)pollination by animals", "zikkurat": " (plural zikkurats)Alternative spelling of ziggurat", "zebeck": " (plural zebecks)Alternative spelling of xebec.1793 November 13,  attributed to Mathew Carey,  [Appendix.] No. IV. Extract of a Letter from John MShane, Captain of the Minerva, to William Bell, dated Algiers, November 13, 1793, in  A Short History of Algiers, with a Concise View of the Origin of the Rupture between Algiers and the United States. To which is Added a Copious Appendix: Containing Letters from Captain Penrose, MShane, and Sundry Other American Captives, with a Description of the Treatment Those Prisoners Experienced, 3rd improved edition, New York, N.Y.: Published by Evert Duyckinck, 110 Pearl-street; W[illiam] W. Vermilye, printer, published 1805, OCLC 80923186, page 82:On the 18th October, about five leagues from Gibraltar, we were boarded by a zebeck of 20 guns, belonging to this place, who after coming within musket-shot, kept up a constant firing with small arms, until they manned our yards from theirs, then the firing ceased, and they came down sword in hand, spared our lives, but nothing else, having stripped us of the clothes we had on, and put us on board the zebeck, [] ", "zooms": "plural of zoomThird-person singular simple present indicative form of zoom", "zygomaticofrontal": " (not comparable)(anatomy) Relating to the zygomatic bone and frontal bone.", "zoogleas": "plural of zooglea", "zoanthodeme": " (plural zoanthodemes)(zoology) The zooids of a compound anthozoan, collectively.", "zoolatria": " (uncountable)Synonym of zoolatry", "zestless": " (comparative more zestless, superlative most zestless)Lacking zest; passionless, unenthusiastic.1792, Robert Sadler, Wanley Penson, or The Melancholy Man, London: C. &amp; G. Kearsley, Volume 3, p. 252,[1]There are moments, indeed, in which I could be pleased to repay even a zestless joke with a smile, and, to feed the cheerfulness of a companion, rummage my own recollection for a mirthful incident; but, alas! tis not so nowMy soul is too much absorbed in its own gloomy ruminations, to be drawn forth by its accustomed urbanity []1865, Charles Heavysege, Jephthahs Daughter, Montreal: Dawson Brothers, IV, (unpaginated),[2][] So he passesTo second childhood; but, as quickening gases,Being fled, leave zestless a once cheering draught,We grow not merry though the Dotard laughed.1941, James Hilton, Random Harvest, Boston: Little, Brown &amp; Co., Part Four, p. 249,[3]As he descended the stairs he felt calmer, readier to do battle with the forces arrayed against him; and that made him feel a little warm towards the weak healthy boy who never did battle at all, but just drank and debauched himself in a bored, zestless way.c. 1956, Martin Luther King Jr., sermon delivered at the time of the Montgomery bus boycott, cited in Dream: The Words and Inspiration of Martin Luther King, Jr., Boulder, CO: Blue Mountain Press, p. 81,[4]Courageous men never lose the zest for living even though their life situation is zestless; cowardly men, overwhelmed by the uncertainties of life, lose the will to live.", "zain": " (plural zains)(archaic) A horse of a dark colour with no lighter spots.1905, Sir William Ridgeway, The origin and influence of the thoroughbred horseAzara estimates the proportion of bays amongst these horses to be about ninety to ten zains, that is, entirely dark-coloured without any white; and there is not one black in two thousand; pied and greys occur sometimes []", "zymogram": " (plural zymograms)(biochemistry, genetics) A strip of electrophoretic material on which enzymes are visibly separated through histochemical methods (eg by zone electrophoresis).", "zoopery": " (uncountable)(rare) experimentation on animals", "zauschneria": " (plural zauschnerias)Epilobium canum, a North American willowherb.", "zinnwaldite": " (plural zinnwaldites)(mineralogy) A mineral with monoclinic crystals, KLiFe2+Al(AlSi3)O10(F,OH)2, of the mica group.", "zoogloeal": " (not comparable)Of or relating to the zoogloea.", "zoners": "plural of zoner", "zenithward": " (not comparable)Facing or moving toward the zenith.1903, O. M. Ball, The Effect of Tension upon the Development of Mechanical Tissues of Plants, Transactions of the Texas Academy of Science, Austin, TX, Volume 5, p. 97,[1]In this manner are the results to be explained which appear when a forcibly bent stem is so placed that the plane of the curve is horizontal. Under these conditions it appears that the action of gravitation predominates, since only the zenithward side underwent thickening of the cell walls. (not comparable)Toward the zenith.1898, H. G. Wells, The War of the Worlds, Book One, Chapter One,[2]It was starlight and I explained the Signs of the Zodiac to her, and pointed out Mars, a bright dot of light creeping zenithward, towards which so many telescopes were pointed.1990, R. M. Koster and Guillermo Snchez Borbn, In the Time of the Tyrants: Panama, 1968-1990, New York: Norton, Chapter 1, p. 42,[3]Nineteen eighty-six was officially declared the Year of PeaceSecurity without War, by order of General of Forces Manuel Noriega. All over Panama, signs with that slogan blossomed, often embossed with a ring of five stars, the generals insignia, and little white doves flapping bravely zenithward.", "zaptiah": " (plural zaptiahs)Alternative form of zaptieh", "zygobranchiate": " (comparative more zygobranchiate, superlative most zygobranchiate)(zoology) Of or pertaining to the Zygobranchia", "zootic": " (not comparable)Containing the remains of organized bodies; -- said of rock or soil.", "zoneless": " (not comparable)Without zones; unzoned.1983, Robert Pollock, Soccer for Juniors, New York: Scribner, Tactics, p. 109,[1]In this style of defense he is the one zoneless player, being able to cross into either of the zones as he is needed.1988, Aniko Varpalotai, Ringette: The Sport for Girls, Orbit, Ontario Institute for Studies in Education, Volume 19, No. 3, October 1988, p. 10,[2][] ringette players are agitating for zoneless play which would make the game faster and more demanding.(literary, archaic) Without a belt or girdle.1749, William Mason, Isis: An Elegy, London: R. Dodsley, p. 7,[3]Closd was her eye, and from her heaving breastIn careless folds loose flowd her zoneless vest;1785, William Cowper, The Task, London: J. Johnson, Book 3, p. 94,[4]Thou art not known where pleasure is adored,That reeling goddess with the zoneless waistAnd wandring eyes, still leaning on the armOf novelty, her fickle frail support;(biology) Lacking bands or rings (particularly with reference to fungi).", "zoomorphs": "plural of zoomorph", "zipper": " (plural zippers)(chiefly US, Australia) A zip fastener.A pressure-sensitive plastic closure.(biochemistry) leucine zipper (third-person singular simple present zippers, present participle zippering, simple past and past participle zippered)to close a zipper.He zippered his sweater against the cold.to put a zipper on an article.These fall jackets are zippered.", "zapateado": " (plural zapateados)A dance of Mexican Indian origin characterized by a lively rhythm punctuated by the striking of the dancer\\'s shoes.", "zoogeographical": " (not comparable)Pertaining to zoogeography.", "zygodactyl": " (not comparable)Having two toes pointing forward, and two pointing backward; zygodactylous. (plural zygodactyls)(ornithology) Any bird with toes of this kind, such as the parrot.", "zeppelins": "plural of zeppelin", "zambra": " (plural zambras)A dance associated with Andalusia.1852, Washington Irving, Tales from the Alhambra:Can you be at a loss in wanton Seville, where black-eyed damsels dance the zambra under every orange grove?", "zachun": " (uncountable)An oil pressed by the Arabs from the fruit of a small thorny tree (Balanites aegyptiaca), and sold to pilgrims for a healing ointment.", "zoodendria": "plural of zoodendrium", "zoster": " (countable and uncountable, plural zosters)(countable) An ancient Greek waist-belt for men.(uncountable, medicine) The disease called herpes zoster (from the typically beltlike pattern of its rash); shingles.", "zoophytical": " (not comparable)Of or pertaining to the zoophytes.", "zalambdodont": " (not comparable)(zoology) Having teeth with two ridges that meet at an angle, forming the letter lambda. (plural zalambdodonts)A creature with teeth of this kind.", "zebrafishes": "plural of zebrafish", "zymosthenic": " (comparative more zymosthenic, superlative most zymosthenic)(medicine) Tending to strengthen the activity of an enzyme.", "zoophilic": " (comparative more zoophilic, superlative most zoophilic)Liking or preferring animals.Relating to or exhibiting zoophilia; sexually attracted to animals.", "zorillos": "plural of zorillo", "zareba": " (plural zarebas)Alternative spelling of zariba, particularly in figurative contexts (third-person singular simple present zarebas, present participle zarebaing, simple past and past participle zarebaed)Alternative spelling of zariba, particularly in figurative contexts", "zooerastia": " (uncountable)The practice of a human engaging in sexual intercourse with an animal1908,  Bernard Simon Talmey,  Woman: A Treatise on the Normal and Pathological Emotions of Feminine Love, page 8:A curious instance of perversion in religio-sexual feeling, bordering on zooerastia, is the case of St. Veronica.", "zizzled": "simple past tense and past participle of zizzle", "zygomaticotemporal": " (not comparable)(anatomy) Relating to the zygomatic bone and temples.", "zoistic": " (comparative more zoistic, superlative most zoistic)Of or relating to zoism.", "zoothecium": " (plural zoothecia)(zoology) The outer layer of certain protozoans.", "zygosperm": " (plural zygosperms)(botany) A spore formed by the union of the contents of two similar cells, either of the same or of distinct individual plants. Zygosperms are found in certain orders of alg and fungi.", "zygosities": "plural of zygosity", "zoonerythrin": " (uncountable)(biology) A red pigment found in some sponges and in the feathers of flamingos.", "zymotically": " (not comparable)(pathology, obsolete) In a zymotic manner, infectiously.", "zestfulness": " (uncountable)State or condition of being zestful or enthusiastic.", "zygantra": "plural of zygantrum", "zymology": " (uncountable)(zymurgy) A treatise on the fermentation of liquors, or the doctrine of fermentation.The science of or knowledge concerning fermentation.", "zymogenes": "plural of zymogene", "zastruga": " (plural zastrugi)Any of a series of long, wavelike ridges or grooves formed on a snow surface by the wind, especially in polar plains.2003,  William C. Wonders,  Canada\\'s changing North[1], McGill-Queen\\'s Press, ISBN, page 40:Later winds, if of sufficient force, will erode away the kalutoqaniq, producing sculptured forms which have great beauty but which are exceeding difficult to traverse. The sculpturings are widely known by the terms zastrugi (Russian) or skavler (Norwegian), but are more accurately known as kaioqlaq (Eskimo [Inuit]). Zastrugi or skavler refer to surface sculpturings in general. Kaioqlaq refers to large, hard sculpturings while the word tumarinyiq (Eskimo [Inuit]) refers to small zastrugi or \"ripple marks.\"", "zoonule": " (plural zoonules)(zoology) A zoonite.", "zees": "plural of zeeEye dialect spelling of this, representing primarily French-accented English.", "zoonosology": " (countable and uncountable, plural zoonosologies)The study of animal disease", "zaman": "Albizia saman, a large tropical tree in the pea family.1995,  Madison Smartt Bell,  All souls\\' rising[1], page 327:On shore, the mule\\'s pinkish ears revolved lazily in the shade of the zaman tree.", "zombis": "plural of zombi", "zygopleural": " (not comparable)(biology) Having bilateral symmetry", "zoologize": " (third-person singular simple present zoologizes, present participle zoologizing, simple past and past participle zoologized)(intransitive) To study zoology, especially by collecting animals to be studied.", "zaffers": "plural of zaffer", "zinced": "simple past tense and past participle of zinc", "zincing": "present participle of zinc", "zooid": " (plural zooids)(biology) An organic body or cell having locomotion, as a spermatic cell or spermatozoid.(zoology) An animal in one of its inferior or early stages of development, as one of the intermediate forms in alternate generation.(zoology) One of the individual animals in a composite group, as of Anthozoa, Hydrozoa, and Bryozoa;  sometimes restricted to those individuals in which the mouth and digestive organs are not developed. (comparative more zooid, superlative most zooid)(biology) Relating to, or resembling, an animal.", "zootomist": " (plural zootomists)One who carries out zootomies.1834, Robert Edmond Grant, Lectures on Comparative AnatomyThe structure of almost every class of animals has been the subject of separate and minute examination among the zootomists of France.", "zig": " (plural zigs)A sudden or sharp turn or change of direction. (third-person singular simple present zigs, present participle zigging, simple past and past participle zigged)To make such a turn.", "zeaxanthin": " (countable and uncountable, plural zeaxanthins)(organic chemistry) A yellow crystalline carotenoid alcohol that occurs widely with lutein, with which it is isomeric, and is the chief pigment of maize.", "zymogenous": " (not comparable)Causing fermentation.", "zamindar": " (plural zamindars)(India, Bangladesh, Pakistan, now historical) An Indian landowner who collected local taxes and paid them to the British government.2004, Khushwant Singh, Burial at Sea, Penguin 2014, p. 6:Indian princes, zamindars and industrialists engaged him as their counsel and paid him whatever he asked for as fees.2008, Amitav Ghosh, Sea of Poppies, Penguin 2015, p. 39:Thus it happened that the approach of the Ibis was witnessed by Raja Neel Rattan Halder, the zemindar of Raskhali, who was on board the palatial barge with his eight-year-old son and a sizeable retune of attendants.2017, Sunil Khilnani, Incarnations, Penguin 2017, p. 402:The power of the zamindars, who were mainly Brahmin or Rajput, was challenged in a series of peasant movements between 1919 and 1921, when Charan Singh was in his late teens.", "zoolite": " (plural zoolites)A fossilized animal.", "zoophoric": " (not comparable)Bearing or supporting the figure of an animal.a zoophoric column", "zamia": " (plural zamias)Any of various cycads of the genera Zamia and Macrozamia1997,  Knut Norstog &amp; Trevor J. Nicholls,  The Biology of the Cycads[1], page 19:It was, in fact, the starchy stems that in some cases led to depletion of wild zamias in some regions of Florida.", "zorillo": " (plural zorillos)(obsolete, rare) striped skunk1839, Charles Darwin, Voyage of the Beagle:We saw also a couple of Zorillos, or skunks,--odious animals, which are far from uncommon. In general appearance the Zorillo resembles a polecat, but it is rather larger, and much thicker in proportion. Conscious of its power, it roams by day about the open plain, and fears neither dog nor man. If a dog is urged to the attack, its courage is instantly checked by a few drops of the fetid oil, which brings on violent sickness and running at the nose. Whatever is once polluted by it, is for ever useless. Azara says the smell can be perceived at a league distant; more than once, when entering the harbour of Monte Video, the wind being off shore, we have perceived the odour on board the \"Beagle.\" Certain it is, that every animal most willingly makes room for the Zorillo.", "zilch": " (countable and uncountable, plural zilches)(informal, uncountable) nothing.1991, Judith Arnold, One Good Turn, page 104:\"If the homeless wind up with zilch,\" James retorted, veiling his indignation behind a malevolent smile, \"it\\'s because they deserve zilch.\"(informal, countable) A person who is unimportant or lacks character; a nobody.", "zantewood": "fustic (tree)", "zoometric": " (not comparable)Relating to zoometry.", "zootherapy": " (uncountable)The use of living animals for medical treatment or as an adjunct to medical diagnosis.", "zingier": "comparative form of zingy: more zingy", "zarnec": " (uncountable)(mineralogy, obsolete) A native sulfide of arsenic, including sandarac and orpiment.", "zoologists": "plural of zoologist", "zibets": "plural of zibet", "zoophagan": " (plural zoophagans)carnivore", "zimbi": " (plural zimbi)(archaic) A cowrie shell, once used as a form of currency in parts of Africa.2018 April 27,  Knight\\'s Penny Magazine, volume 13, page 159:In the kingdom of Congo there is said to be another kind of shell current, called zimbi. Two thousand of these zimbi form a maconti or macinte; and one of the writers on Central Africa some years ago stated that two Flemish knives were deemed worth a maconti; a copper basin, two pounds in weight and twelve inches in diameter, three maconti; a fusee, ten macontis, &amp;c.1850,  John Macgregor,  Commercial statistics: A digest of the productive resources, commercial legislation, customs tariffs, of all nations. Including all British commercial treaties with foreign states:It is true that the inhabitants of Congo do also make use of shells, by them called zimbi, or zinibi; but these are carried to them only by the Portuguese, who are in a manner masters of this great kingdom.", "zuisin": " (plural zuisins)(US) The American wigeon.", "zibelines": "plural of zibeline", "zygomycetes": "plural of zygomycete", "zoospore": " (plural zoospores)A motile asexual spore of some algae and fungi.", "zill": " (plural zills)One of a set of small finger cymbals used in belly dancing and similar performances.", "zoologized": "simple past tense and past participle of zoologize", "zooglea": " (plural zoogleas or zoogleae)Alternative form of zoogloea", "zither": " (plural zithers)(music) A musical instrument consisting of a flat sounding box with numerous strings placed on a horizontal surface, played with a plectrum or fingertips.(music, translations) Related or similar instruments in other cultures, such as the Chinese guqin or Norwegian harpeleik; especially any chordophone without a neck, and with strings that pass over the body. (third-person singular simple present zithers, present participle zithering, simple past and past participle zithered)To play a zither.1892, Edmund Gosse, The Secret of Narcisse, New York: United States Book Company, Chapter 3, pp. 100, 102,[1][] the fluting began again. Not alone this time, but, to Rosalies infinite surprise, accompanied on a zither. [] At this moment the fluting and zithering began again.1906, William John Locke, The Belovd Vagabond, New York: John Lane, 1911, Chapter 9, pp. 120-121,[2]We wandered and fiddled and zithered and tambourined through France till the chills and rains of autumn rendered our vagabondage less merry.1999, Richard Hacken (translator), Mary in Misery by Peter Rosegger in Into the Sunset: Anthology of Nineteenth-Century Austrian Prose, Riverside, CA: Ariadne Press, pp. 413-414,[3]We traveled far and wide: he played the zither while I sang an accompaniment. [] He keeps zithering, and I sing like before, and before long weve put together a pretty good pile of money . . .To make a sound similar to that made by a zither; to move while making such a sound.c. 1890, May Ostlere, Dead! London: Trischler, Chapter 3, p. 76,[4]Now [the wind] swithered through the badly-fixed windows, making zithering sounds as of an army of cold and frozen-out mosquitoes []1956, Gerald Durrell, My Family and Other Animals, Penguin, 2000, Part Two, Chapter 10, p. 123,[5]The olives seemed weighed down under the weight of their fruit, smooth drops of green jade among which the choirs of cicadas zithered.1985, Kim Chapin, Dogwood Afternoons, New York: Farrar, Straus and Giroux, Chapter 19, p. 178,[6]Once I owned a bike [] It had no fenders and one gear only, and on the forks, both fore and aft, I clipped some plastic playing cards to zither loudly through the spokes.1996, Carl Huberman, Eminent Domain, London: Macmillan, Chapter 38, p. 328,[7]Look at that! she shouted, already backing up the Jeep, its tyres zithering on the crusty surface.2004, Matt Braun, Black Gold, New York: St Martins Paperbacks, Chapter Fifteen, p. 158,[8]The other men opened fire with pistols, slugs zithering past him with a dull whine.", "zel": " (plural zels)Alternative form of zill", "zoomorphic": "Having the shape, form, or likeness of an animal.The zoomorphic Hindu god Ganesha has the head of an elephant.", "zoogeography": " (usually uncountable, plural zoogeographies)The scientific study of the geographical distribution of animal species.", "zits": "plural of zit", "zeds": "plural of zed", "zootomical": " (not comparable)Pertaining to zootomy, the dissection of animals.", "zeolitizing": "present participle of zeolitize", "zacatons": "plural of zacaton", "zingel": " (plural zingels)A fish of the perch family, found in the Danube.", "zinckenite": " (uncountable)(mineralogy) A sulfosalt mineral containing lead and antimony.", "zooxanthellae": "plural form of zooxanthella", "zoris": "plural of zori", "zoosmosis": " (uncountable)osmosis in living (animal) tissue", "zigzag": " (plural zigzags)a line or path that proceeds by sharp turns in alternating directionsone of such sharp turns (comparative more zigzag, superlative most zigzag)Moving in, or having a zigzag.1820, Walter Scott, Ivanhoe, Chapter 16,[1]The entrance to this ancient place of devotion was under a very low round arch, ornamented by several courses of that zig-zag moulding, resembling sharks teeth, which appears so often in the more ancient Saxon architecture.1912, Zane Grey, Riders of the Purple Sage, Chapter 8[] between two spears of rock, directly in line with his position, showed a zigzag crack that at night would let through the gleam of sky. (third-person singular simple present zigzags, present participle zigzagging, simple past and past participle zigzagged)To move or to twist in a zigzag manner.1912, Zane Grey, Riders of the Purple Sage, Chapter 8At the base this vent was dark, cool, and smelled of dry, musty dust. It zigzagged so that he could not see ahead more than a few yards at a time.2002, Malcolm Yorke, Mervyn Peake: My Eyes Mint Gold: A Life (page 298)If the first two novels created a new genre  Peakean fantasy  then this third volume zigzags between several: the Bildungsroman, science fiction, social satire, morality tale and dystopian prophecy. (comparative more zigzag, superlative most zigzag)in a zigzag manner or pattern", "zeatins": "plural of zeatin", "zillions": "plural of zillion", "ziganka": " (plural zigankas)A traditional lively Russian dance in 2/4 time.", "zymometer": " (plural zymometers)An instrument for ascertaining the degree of fermentation occasioned by the mixture of different liquids, and the degree of heat which they acquire in fermentation; a zymosimeter.", "zodiac": " (plural zodiacs)(astrology) The belt-like region of the celestial sphere approximately eight degrees north and south of the ecliptic which include the apparent path of the sun, moon, and visible planets.(astrology) The twelve equal divisions of the zodiacal region into signs or houses, each named for a prominent constellation in the region.(astronomy) The ecliptic: the belt-like region of the celestial sphere corresponding to the apparent path of the sun over the course of a year.Any of various astrological systems considered similar to the above.1998, Sylvia Sikundar and Barbara DuMoulin, Celebrating Our Cultures, Pembroke Publishers Limited, ISBN, page 58:Discussing both Chinese and Western zodiacs might be a prewriting activity.(countable) A circle decorated with the signs of the zodiac.", "zygosity": " (countable and uncountable, plural zygosities)The quality or characteristics of a zygote", "zootheism": " (uncountable)Animal worship; zoolatry.", "zygon": " (plural zyga or zygons)(anatomy, plural \"zyga\") In the cerebrum, a short crossbar fissure that connects the two pairs of branches of a larger zygal (H-shaped) fissure.1896, Andrew J. Parker, \"Morphology of the Cerebral Convolutions with special reference to the order of Primates\", Journal of the Academy of Natural Sciences of Philadelphia, Second Series, 10 (3): 323The evidence is threefold: (1) as admitted by Ecker, the zygon always appears independently in the foetus;1938, Lawrence Durrell, The Black Book, London: Faber and Faber, 1977, Book Three, p. 223,[1]I am falling apart, the delicate zygon of my brain is opened.(music, plural \"zygons\") An affinity or connection in a piece of music between tones, chords, or phrases, such that one part appears to repeat, to imitate, or to derive from the other, especially when perceived as an organising principle in the music; a zygonic relationship.2005, Adam Ockelford, Repetition in music: theoretical and metatheoretical perspectives (page 121)Chopin\\'s Prelude op. 28 no. 6 comprises 403 notes which give risein just one sub-domain (pitch class)to around 13,000 potential primary zygons, 500 million potential secondary zygons, and 1018 potential tertiary zygons.2006, Neil Lerner, Joseph Straus, Sounding Off: Theorizing Disability in Music (page 142)Zygonic relationships, or zygons, are depicted using the letter Z.2012, Adam Ockelford, Applied Musicology: Using Zygonic Theory to Inform Music Education, Therapy, and Psychology Research, page 106Observe that the second melodic interval is deemed to exist in imitation of the first through the repetition of magnitude but not polarity through an \"inverse\" secondary zygon of pitch.", "zowie": "(US, slang) An indication of astonishment or admiration.1908 July 17,  Rice, Thomas S.,  Nationals Swat at Lively Clip Until New Orleans Steps Into Breach., in  The Washington Times[1], Washington D.C., archived from the original on 2016-11-07, page 10:Zowie, what a walloping those Browns got in New York yesterday! A few more like that and the blow-up in Washington, then watch the anvil chorus in St. Louis.", "zucchettos": "plural of zucchetto", "zizzling": "present participle of zizzle", "zombie": " (plural zombies)A snake god or fetish in religions of West Africa and elsewhere.(voodoo, superstition) A person, usually undead, animated by unnatural forces (such as magic), with no soul or will of his/her own.(fiction) A deceased person who becomes reanimate to attack the living.I shot a zombie. He was a zombie, Kenneth. The pilot was bitten before he picked us up!2017 February 23,  Katie Rife,  The Girl With All The Gifts tries to put a fresh spin on overripe zombie clichs, in  The Onion AV Club[1]:The zombies first show up 20 minutes in, after Melanie volunteers herself as the next child to mysteriously disappear in the middle of the night. Thats when we learn that Melanie and her classmates are all hungries, or people infected with a toxic fungus that turns them into mindless flesh-eating animals.(figuratively) An apathetic person.(figuratively) A human being in a state of extreme mental exhaustion.After working for 18 hours on the computer, I was a zombie.An information worker who has signed a nondisclosure agreement.[1](computing) A process or task which has terminated but was not removed from the list of processes, typically because it has child processes that have not yet terminated.(computing) A computer affected by malware which causes it to do whatever the attacker wants it to do without the user\\'s knowledge.A cocktail of rum and fruit juices.1976, Harvard Advocate CX:ii, pages 8 and 380:The maitre d introduced us and I had a zombie with him. Those zombies are wicked.[]I watched Mario and drank zombies out of a thermos.(Canada, historical, derogatory) A conscripted member of the Canadian military during World War II who was assigned to home defence rather than to combat in Europe.[2]1944, \"Time for Decision,\" Time (US edition), 6 Nov.,Had the time come to order Canada\\'s home defense drafteessome 70,000 zombies idling at hometo battle overseas?(Australia, slang) Marijuana, or similar drugs.(philosophy) A hypothetical being that is indistinguishable from a normal human being except in that it lacks conscious experience, qualia, or sentience.", "zoos": "plural of zoo", "zoner": " (plural zoners)Someone who zones things.", "zoolith": " (plural zooliths)Synonym of zoolite", "zamarros": "plural of zamarro", "zeroing": "present participle of zero", "zabaglione": " (countable and uncountable, plural zabagliones)A custard-like dessert made with egg yolks, sugar and Marsala wine.Synonyms: sabayon", "zephyrless": " (not comparable)Without a zephyr.", "zooty": " (comparative more zooty, superlative most zooty)(dated, informal) stylish, flashy, snappy.", "ziram": " (uncountable)(organic chemistry) A zinc salt C6H12N2S4Zn used as a fungicide.", "zakah": "Alternative form of zakat", "zibeline": " (countable and uncountable, plural zibelines)a thick, soft woolen fabric with a long napthe sable, or its pelt", "zoomorph": " (plural zoomorphs)A figure in ancient art resembling an animal.", "zymase": " (plural zymases)(biochemistry) Any of a group of enzymes that catalyze the fermentation of simple carbohydrates to ethanol and carbon dioxide.", "zoccolo": " (plural zoccolos or zoccoli)(architecture) A plinth.(historical) A kind of ancient clog, consisting of a thick wooden sole and leather strap.", "zinky": " (comparative more zinky, superlative most zinky)Alternative form of zincy", "zinke": " (plural zinkes)Alternative form of zink (musical instrument)", "zygomorphic": " (comparative more zygomorphic, superlative most zygomorphic)(biology) having bilateral symmetry", "zygomorphism": " (uncountable)bilateral symmetry in flowers", "zirconyl": " (plural zirconyls)(inorganic chemistry) The oxygenated cation of zirconium ZrO2+", "zoolitic": " (not comparable)Relating to zoolites.", "zincking": "present participle of zinc", "zoomed": "simple past tense and past participle of zoom", "zoofulvin": " (uncountable)A yellow carotenoid pigment present in the feathers of some birds", "zebra": " (plural zebra or zebras)Any of three species of genus Equus: E. grevyi, E. quagga, or E. zebra, all with black and white stripes and native to Africa.(sports, slang) A referee.(medicine, slang) An unlikely diagnosis, especially for symptoms probably caused by a common ailment. (Originates in the advice often given to medical students: \"When you hear hoof beats, think of horses, not zebras.\")(vulgar, pejorative, slang) A biracial person, specifically one born to a member of the Sub-Saharan African race and a Caucasian.(informal) A fish, the zebra cichlid.", "zabajones": "plural of zabajone", "zinziberaceous": " (not comparable)Belonging to or resembling the ginger family, the Zingiberaceae.", "zygnemataceous": " (not comparable)(zoology) Belonging to the Zygnemataceae.", "zanthoxylum": " (plural zanthoxylums)Any of the genus Zanthoxylum of deciduous and evergreen trees and shrubs in the citrus or rue family.", "zaniness": " (countable and uncountable, plural zaninesses)The state or condition of being zany.", "zealless": " (not comparable)Without zeal.", "zloties": "plural of zloty", "zoomorphize": " (third-person singular simple present zoomorphizes, present participle zoomorphizing, simple past and past participle zoomorphized)To endow with animal qualities.1964, Margaret Mead, Continuities in Cultural EvolutionThis provides for greater communicability but it also introduces new pitfalls, for the possibility of anthropomorphizing birds is at least as great as that of a zoomorphizing man.", "zymome": " (uncountable)(chemistry, obsolete) A glutinous substance, insoluble in alcohol, resembling legumin; now called vegetable fibrin, vegetable albumin, or gluten casein.", "zecchino": " (plural zecchinos or zecchini)(historical) An old gold coin of Italy; a sequin.", "zephyrs": "plural of zephyr", "zaffre": " (countable and uncountable, plural zaffres)A blue pigment obtained by roasting cobalt ore.A cobalt blue colour, like that of the pigment.zaffre colour: &#160;", "zenithal": " (not comparable)Of or pertaining to a zenith.1891, Thomas Hardy, Tess of the dUrbervilles, Phase the Fourth, Chapter 25,[1][] since he had last shared in the Vicarage life it had grown even more distinctly foreign to his own than usual. Its transcendental aspirationsstill unconsciously based on the geocentric view of things, a zenithal paradise, a nadiral hellwere as foreign to his own as if they had been the dreams of people on another planet.(cartography, of a projection) azimuthal", "zymotechnical": " (not comparable)Relating to zymotechnics.", "zones": "plural of zoneThird-person singular simple present indicative form of zone", "zesty": " (comparative zestier or more zesty, superlative zestiest or most zesty)Having a piquant or pungent taste; spicy.Zestful.", "zags": "plural of zag", "zootaxy": " (uncountable)The scientific classification of animals.", "zebu": " (plural zebus)A domesticated ox native to Asia and Africa, having a large fleshy hump on its back and a dewlap (Bos primigenius indicus).", "zigging": "present participle of zig", "zamarro": " (plural zamarros)Alternative form of zamarra", "zymophyte": " (plural zymophytes)(biochemistry) A fermentation produced by bacteria, yeasts or similar micro-organisms.", "zoophilous": " (not comparable)pollinated by animals", "zooxanthella": " (plural zooxanthellae)An animal of the genus Symbiodinium, a yellow dinoflagellate, notably found in coral reefs.(dated) Any golden-brown planktonic endosymbiont.", "zygocactus": " (plural zygocacti)Any cactus in the genus Schlumbergera (previously Zygocactus)", "zealotry": " (countable and uncountable, plural zealotries)Something characteristic of a zealot; excessive zeal; fanaticism.", "zeolitized": "simple past tense and past participle of zeolitize", "zecchin": " (plural zecchins)(historical) Any of various gold coins produced in Italy or Turkey; a sequin.1820, Walter Scott, Ivanhoe, Chapter 9,[1][] the noble armour, that was worth so many zecchins to Joseph Pareira, the armourer of Milan, besides seventy in the hundred of profits, he cares for it as little as if he had found it in the highways!", "zoom": " (plural zooms)a humming noise from something moving very fasta quick ascenta big increasean augmentation of a view by varying the focal length of a lens (third-person singular simple present zooms, present participle zooming, simple past and past participle zoomed)to move fast with a humming noiseto fly an airplane straight upto move rapidlyto go up sharplyprices zoomedto change the focal length of a zoom lens(used with in or out) to manipulate a display so as to magnify or shrink it", "zecchinos": "plural of zecchino", "zebecs": "plural of zebec", "zilches": "plural of zilch", "zeolites": "plural of zeolite", "zoomantic": " (not comparable)Relating to zoomancy."}